<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description" content="Just a hobby, won't be big and professional like Linux."><title>机器学习算法系列之三：SVM（5） | 断鸿声里，立尽斜阳</title><link rel="stylesheet" type="text/css" href="//fonts.css.network/css?family=Source+Code+Pro"><link rel="stylesheet" type="text/css" href="/css/style.css?v=2.0.1"><link rel="stylesheet" type="text/css" href="/css/highlight.css?v=2.0.1"><link rel="Shortcut Icon" href="/favicon.ico"><link rel="bookmark" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><!--添加打赏连接--><!--link(rel='stylesheet', type='text/css', href=url_for(theme.css) + '/reward.scss')--><!--link(rel='stylesheet', type='text/x-scss', href=url_for(theme.css) + '/tooltip.css')--><!--end--><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">机器学习算法系列之三：SVM（5）</h1><a id="logo" href="/.">断鸿声里，立尽斜阳</a><p class="description">流萤弄月照玉窗，一纸红笺话思量</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 时间线</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div><div id="search-form"><div id="result-mask" class="hide"></div><label><input id="search-key" type="text" autocomplete="off" placeholder="search"></label><div id="result-wrap" class="hide"><div id="search-result"></div></div><div class="hide"><template id="search-tpl"><div class="item"><a href="/{path}" title="{title}"><div class="title">{title}</div><div class="time">{date}</div><div class="tags">{tags}</div></a></div></template></div></div></div><div id="layout" class="layout-g"><div class="layout-l"><div class="content_container"><div class="post"><h1 class="post-title">机器学习算法系列之三：SVM（5）</h1><div class="post-meta"><a href="/2018/03/31/机器学习算法系列之三：SVM5/#comments" class="comment-count"><i data-disqus-identifier="2018/03/31/机器学习算法系列之三：SVM5/" class="disqus-comment-count"></i>留言</a><p><span class="date">Mar 31, 2018</span><span><a href="/categories/机器学习/" class="category">机器学习</a></span><span><i id="busuanzi_container_page_pv"><i id="busuanzi_value_page_pv"></i><i>阅读</i></i></span></p></div><div class="post-content"><p><img src="/2018/03/31/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7CFB;&#x5217;&#x4E4B;&#x4E09;&#xFF1A;SVM5/SVM5&#x9996;&#x56FE;.png" width="430" height="200"></p>
<blockquote>
<font color="#0000FF" face="&#x5FAE;&#x8F6F;&#x96C5;&#x9ED1;" size="4">&#x6C34;&#x81F3;&#x6E05;&#x5219;&#x65E0;&#x9C7C;&#xFF01;</font>

</blockquote>
<hr>
<h2 id="&#x4E00;&#x3001;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;"><a href="#&#x4E00;&#x3001;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;" class="headerlink" title="&#x4E00;&#x3001;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;"></a>&#x4E00;&#x3001;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;</h2><h3 id="1-1-&#x53EF;&#x5206;-VS-&#x975E;&#x53EF;&#x5206;"><a href="#1-1-&#x53EF;&#x5206;-VS-&#x975E;&#x53EF;&#x5206;" class="headerlink" title="1.1 &#x53EF;&#x5206; VS &#x975E;&#x53EF;&#x5206;"></a>1.1 &#x53EF;&#x5206; <em>VS</em> &#x975E;&#x53EF;&#x5206;</h3><p>&#x2003;&#x2003;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x5206;&#x5272;&#x9762;&#x7684;&#x6C42;&#x89E3;&#x5747;&#x662F;&#x5728;&#x6570;&#x636E;<strong>&#x7EBF;&#x6027;&#x53EF;&#x5206;</strong>&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4E0E;&#x8BE5;&#x6761;&#x4EF6;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x5B66;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<p>$$<br>y_i \lgroup {\vec w} &#xB7; \vec x_i + {b} \rgroup - 1  \geq 0, \ \ i = 1,2,&#xB7;&#xB7;&#xB7;,N<br>\tag{1 - 1}<br>$$</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x5BF9;&#x5E94;&#x7684;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x5C31;&#x662F;&#xFF1A;<strong>&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x80FD;&#x88AB;&#x51C6;&#x786E;&#x7684;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</strong>&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x5BF9;&#x6211;&#x4EEC;&#x7B80;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x62BD;&#x8C61;&#x51FA;&#x6570;&#x5B66;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x9762;&#x5BF9;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x7684;&#x65F6;&#x5019;&#x5374;&#x663E;&#x5F97;&#x975E;&#x5E38;&#x4E4F;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x6211;&#x4EEC;&#x6240;&#x5904;&#x7406;&#x7684;&#x6570;&#x636E;&#x51E0;&#x4E4E;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x4E0D;&#x53EF;&#x5206;&#x751A;&#x81F3;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5982;&#x679C;&#x4E0D;&#x5BF9;&#x5F0F;&#xFF08;1-1&#xFF09;&#x505A;&#x8C03;&#x6574;&#xFF08;&#x6539;&#x52A8;&#xFF09;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x4E24;&#x65B9;&#x9762;&#x7684;&#x5F71;&#x54CD;&#xFF1A;</p>
<ul>
<li>&#x6761;&#x4EF6;&#x8FC7;&#x4E8E;&#x4E25;&#x683C;&#x5BFC;&#x81F4;&#x65B9;&#x7A0B;&#x7EC4;&#x5728;&#x5B9E;&#x6570;&#x57DF;&#x65E0;&#x89E3;&#xFF0C;&#x5373;&#x627E;&#x4E0D;&#x5230;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x7684;&#x5206;&#x5272;&#x9762;&#xFF1B;</li>
<li>&#x5B9E;&#x6570;&#x57DF;&#x4E2D;&#x6C42;&#x51FA;&#x4E86;&#x5206;&#x5272;&#x9762;&#xFF08;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x6A21;&#x578B;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x975E;&#x5E38;&#x5DEE;&#xFF08;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#x4E86;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x6570;&#x636E;&#xFF09;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x4EE5;&#x4E0A;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x4E00;&#x53E5;&#x53E4;&#x8BDD;&#x603B;&#x7ED3;&#x5C31;&#x662F;&#xFF1A;</p>
<blockquote>
<p>&#x6C34;&#x81F3;&#x6E05;&#x5219;&#x65E0;&#x9C7C; &#x4EBA;&#x81F3;&#x5BDF;&#x5219;&#x65E0;&#x5F92;</p>
</blockquote>
<h4 id="1-1-1-&#x76F8;&#x540C;&#x70B9;"><a href="#1-1-1-&#x76F8;&#x540C;&#x70B9;" class="headerlink" title="1.1.1 &#x76F8;&#x540C;&#x70B9;"></a>1.1.1 &#x76F8;&#x540C;&#x70B9;</h4><p>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x548C;&#x7EBF;&#x6027;&#x4E0D;&#x53EF;&#x5206;&#x4E8C;&#x8005;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#x6A21;&#x578B;&#x5747;&#x662F;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x6A21;&#x578B;&#x3002;<br>&#x2003;&#x2003;&#x6570;&#x5B66;&#x6A21;&#x578B;&#x3001;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF08;&#x5747;&#x8F6C;&#x6362;&#x4E3A;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x5BF9;&#x5076;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#xFF09;&#x4E5F;&#x76F8;&#x540C;&#x3002;</p>
<h4 id="1-1-2-&#x4E0D;&#x540C;&#x70B9;"><a href="#1-1-2-&#x4E0D;&#x540C;&#x70B9;" class="headerlink" title="1.1.2 &#x4E0D;&#x540C;&#x70B9;"></a>1.1.2 &#x4E0D;&#x540C;&#x70B9;</h4><p>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x6A21;&#x578B;&#x53EA;&#x80FD;&#x89E3;&#x51B3;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x6A21;&#x578B;&#x5219;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x7EBF;&#x6027;&#x95EE;&#x9898;&#xFF08;&#x5305;&#x542B;&#x4E86;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x3001;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#xFF09;&#x3002;<br>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x662F;&#x57FA;&#x7840;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x662F;&#x6269;&#x5C55;&#x3002;<br>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x4F7F;&#x7528;&#x786C;&#x95F4;&#x9694;&#x4F5C;&#x4E3A;&#x4F18;&#x5316;&#x76EE;&#x6807;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x4F7F;&#x7528;&#x8F6F;&#x95F4;&#x9694;&#xFF08;&#x5F15;&#x5165;&#x4E86;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x3001;&#x60E9;&#x7F5A;&#x7CFB;&#x6570;&#xFF09;&#x4F5C;&#x4E3A;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x3002;</p>
<h3 id="1-2-&#x89E3;&#x51B3;&#x4E4B;&#x9053;"><a href="#1-2-&#x89E3;&#x51B3;&#x4E4B;&#x9053;" class="headerlink" title="1.2 &#x89E3;&#x51B3;&#x4E4B;&#x9053;"></a>1.2 &#x89E3;&#x51B3;&#x4E4B;&#x9053;</h3><h4 id="1-2-1-&#x677E;&#x5F1B;&#x53D8;&#x91CF;"><a href="#1-2-1-&#x677E;&#x5F1B;&#x53D8;&#x91CF;" class="headerlink" title="1.2.1 &#x677E;&#x5F1B;&#x53D8;&#x91CF;"></a>1.2.1 &#x677E;&#x5F1B;&#x53D8;&#x91CF;</h4><p>&#x2003;&#x2003;&#x4E3A;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x51FA;&#x7684;&#x6A21;&#x578B;&#x80FD;&#x591F;&#x5904;&#x7406;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x589E;&#x5F3A;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x9002;&#x5F53;&#x7684;&#x653E;&#x677E;&#x95F4;&#x9694;&#x7684;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x3002;<strong>&#x5141;&#x8BB8;&#x5C11;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF08;&#x566A;&#x70B9;&#x3001;&#x79BB;&#x7FA4;&#x70B9;&#xFF09;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x51E0;&#x4F55;&#x95F4;&#x9694;&#x4E0D;&#x7B49;&#x4E8E;$\frac{1}{||\vec w||}$&#xFF08;&#x4E0D;&#x5728;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x4E0A;&#xFF09;&#xFF0C;&#x751A;&#x81F3;&#x4E3A;&#x8D1F;&#xFF08;&#x4E0D;&#x5728;&#x672C;&#x7C7B;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF09;&#x3002;</strong><br>&#x2003;&#x2003;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x70B9;&#x90FD;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x8C03;&#x63A7;&#x53C2;&#x6570;&#xFF0C;&#x6839;&#x636E;&#x9700;&#x8981;&#x6765;&#x8C03;&#x8282;&#x6570;&#x636E;&#x70B9;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x79F0;&#x4E3A;<strong>&#x677E;&#x5F1B;&#x53D8;&#x91CF;$\xi_i \geq 0$</strong>&#x3002;&#x4E8E;&#x662F;&#x539F;&#x6765;&#x7684;&#x4E0D;&#x7B49;&#x5F0F;&#x7EA6;&#x675F;&#x53D8;&#x4E3A;&#x4E0B;&#x5F0F;&#xFF1A;</p>
<p>$$<br>y_i(\vec w \cdot \vec x_i + b) \geq 1 - \xi_i<br>\tag{1 - 2}<br>$$</p>
<h4 id="1-2-2-&#x60E9;&#x7F5A;&#x53C2;&#x6570;"><a href="#1-2-2-&#x60E9;&#x7F5A;&#x53C2;&#x6570;" class="headerlink" title="1.2.2 &#x60E9;&#x7F5A;&#x53C2;&#x6570;"></a>1.2.2 &#x60E9;&#x7F5A;&#x53C2;&#x6570;</h4><p>&#x2003;&#x2003;&#x5F15;&#x5165;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x5012;&#x662F;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x5374;&#x53C8;&#x5F15;&#x5165;&#x4E86;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x3002;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x56E0;&#x4E3A;&#x653E;&#x5BBD;&#x4E86;&#x9650;&#x5236;&#x6761;&#x4EF6;&#xFF08;&#x5141;&#x8BB8;&#x67D0;&#x4E9B;&#x70B9;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x5C0F;&#x4E8E;1&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7C7B;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x628A;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x79BB;&#x7FA4;&#x70B9;&#xFF08;&#x66F4;&#x9760;&#x8FD1;&#x76F8;&#x53CD;&#x7C7B;&#xFF09;&#x7EB3;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x7248;&#x56FE;&#xFF08;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x4F1A;&#x4F7F;&#x5F97;&#x51FD;&#x6570;&#x95F4;&#x9694;&#x6700;&#x5927;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x6EE1;&#x8DB3;&#x4E0D;&#x7B49;&#x5F0F;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x8BEF;&#x5206;&#x7C7B;&#x3002;<br>&#x2003;&#x2003;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x505A;&#x4E00;&#x4E9B;&#x7EA6;&#x675F;&#xFF0C;&#x5177;&#x4F53;&#x529E;&#x6CD5;&#x662F;&#x5BF9;&#x5F15;&#x5165;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x8BA9;&#x5B83;&#x652F;&#x4ED8;&#x4E00;&#x4E2A;&#x7B49;&#x503C;&#x7684;&#x4EE3;&#x4EF7;&#xFF08;&#x6211;&#x59D1;&#x4E14;&#x628A;&#x5B83;&#x79F0;&#x4F5C;<strong>&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;</strong>&#xFF0C;&#x6CE8;&#x610F;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5B98;&#x65B9;&#x672F;&#x8BED;&#x3002;&#xFF09;&#x5373;$\xi _i$&#xFF0C;&#x540C;&#x65F6;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;<strong>&#x60E9;&#x7F5A;&#x53C2;&#x6570;$C&#xFF08;C &gt; 0&#xFF09;$</strong>&#x7684;&#x7EA6;&#x675F;&#x53C2;&#x6570;&#xFF0C;&#x6765;&#x8C03;&#x8282;&#x5BF9;&#x4E8E;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x5BB9;&#x5FCD;&#x7A0B;&#x5EA6;&#x3002;<br>&#x2003;&#x2003;&#x628A;&#x60E9;&#x7F5A;&#x53C2;&#x6570;&#x3001;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#x6574;&#x5408;&#x5230;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x540E;&#x6709;&#xFF1A;</p>
<p>$$<br>\min \limits_{w,b,\xi}{\frac{1}{2} {||\vec w||}}^2 + C\sum_{i=1}^N \xi_i\\\\<br>\tag{1 - 3}<br>$$</p>
<p>&#x2003;&#x2003;&#x4E0A;&#x5F0F;&#x4E2D;&#x7B2C;&#x4E00;&#x9879;&#x7684;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x5F97;&#x95F4;&#x9694;&#x5C3D;&#x91CF;&#x6700;&#x5927;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x9879;&#x7684;&#x6C42;&#x548C;&#x5F0F;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x5219;&#x662F;&#x4F7F;&#x5F97;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x70B9;&#x6570;&#x76EE;&#x5C3D;&#x91CF;&#x6700;&#x5C11;&#xFF08;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#x6700;&#x5C0F;&#xFF09;&#x3002;<br>&#x2003;&#x2003;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5BF9;&#x4E8E;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x6570;&#x636E;&#x6765;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x6570;&#x636E;&#x4EA4;&#x53C9;&#xFF0C;&#x6240;&#x4EE5;&#x95F4;&#x9694;&#x8D8A;&#x5927;&#xFF0C;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x70B9;&#x8D8A;&#x591A;&#x3002;&#x8BEF;&#x5206;&#x7C7B;&#x70B9;&#x8D8A;&#x5C11;&#xFF0C;&#x5FC5;&#x7136;&#x8981;&#x6C42;&#x95F4;&#x9694;&#x8D8A;&#x5C0F;&#x3002;&#x4E24;&#x8005;&#x5904;&#x4E8E;&#x4E00;&#x79CD;<strong>&#x9C7C;&#x548C;&#x718A;&#x638C;&#x4E0D;&#x53EF;&#x517C;&#x5F97;&#x7684;</strong>&#x77DB;&#x76FE;&#x72B6;&#x6001;&#x3002;<br>&#x2003;&#x2003;C&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8C03;&#x548C;&#x53C2;&#x6570;&#xFF0C;&#x5E73;&#x8861;&#x7740;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x77DB;&#x76FE;&#x5173;&#x7CFB;&#x3002;<font color="red">C&#x8D8A;&#x5927;&#xFF0C;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x60E9;&#x7F5A;&#x8D8A;&#x5F3A;&#xFF08;&#x4EE3;&#x4EF7;&#x8D8A;&#x9AD8;&#xFF0C;&#x8D8A;&#x5728;&#x610F;&#x8BEF;&#x5206;&#x7C7B;&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x5B66;&#x4E60;&#x51FA;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x7387;&#x66F4;&#x9AD8;&#x7684;&#x6A21;&#x578B;&#xFF1B;C&#x8D8A;&#x5C0F;&#xFF0C;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x60E9;&#x7F5A;&#x8D8A;&#x5F31;&#xFF08;&#x4EE3;&#x4EF7;&#x8D8A;&#x4F4E;&#xFF0C;&#x8D8A;&#x5728;&#x610F;&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x5B66;&#x4E60;&#x51FA;&#x4E00;&#x4E2A;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x66F4;&#x5F3A;&#x7684;&#x6A21;&#x578B;&#x3002;</font><br>&#x2003;&#x2003;<font color="red">&#x53E6;&#x5916;&#x9700;&#x8981;&#x8865;&#x5145;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x60E9;&#x7F5A;&#x7CFB;&#x6570;C&#x662F;&#x4F5C;&#x4E3A;<strong>&#x8D85;&#x53C2;&#x6570;</strong>&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x52A0;&#x5230;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E2D;&#x3002;</font></p>
<h4 id="1-2-3-&#x6C42;&#x89E3;&#x76EE;&#x6807;"><a href="#1-2-3-&#x6C42;&#x89E3;&#x76EE;&#x6807;" class="headerlink" title="1.2.3 &#x6C42;&#x89E3;&#x76EE;&#x6807;"></a>1.2.3 &#x6C42;&#x89E3;&#x76EE;&#x6807;</h4><p>&#x2003;&#x2003;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x8981;&#x6C42;&#x89E3;&#x7684;&#x5373;&#x662F;&#x5982;&#x4E0B;&#x51F8;&#x4E8C;&#x6B21;&#x89C4;&#x5212;&#x95EE;&#x9898;&#xFF1A;</p>
<p>$$<br>\begin{cases}<br>\min \limits_{w,b,\xi}{\frac{1}{2} {||\vec w||}}^2 + C\sum_{i=1}^N \xi_i, \ C &gt; 0\\\\<br>\\\\<br>y_i \lgroup {\vec w} &#xB7; \vec x_i + {b} \rgroup - (1 - \xi_i) \geq 0, \ \ i = 1,2,&#xB7;&#xB7;&#xB7;,N \\\\<br>\\\\<br>\xi_i \geq 0, \ i=1,2,\cdots,N \\\\<br>\end{cases}<br>\tag{1 - 4}<br>$$</p>
<h4 id="1-2-4-&#x8F6F;&#x95F4;&#x9694;"><a href="#1-2-4-&#x8F6F;&#x95F4;&#x9694;" class="headerlink" title="1.2.4 &#x8F6F;&#x95F4;&#x9694;"></a>1.2.4 &#x8F6F;&#x95F4;&#x9694;</h4><p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x628A;&#x5F15;&#x5165;&#x4E86;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x3001;&#x60E9;&#x7F5A;&#x53C2;&#x6570;&#x4E4B;&#x540E;&#x7684;&#x95F4;&#x9694;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x8F6F;&#x95F4;&#x9694;</strong>&#xFF0C;&#x5B83;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x4E4B;&#x524D;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x7684;<strong>&#x786C;&#x95F4;&#x9694;</strong>&#x800C;&#x8A00;&#x7684;&#xFF0C;&#x610F;&#x601D;&#x5C31;&#x662F;&#x8BE5;&#x95F4;&#x9694;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x6CA1;&#x90A3;&#x4E48;&#x4E25;&#x683C;&#x3002;<br>&#x2003;&#x2003;&#x4E0A;&#x5F0F;&#xFF08;1-4&#xFF09;&#x5BF9;&#x5E94;&#x7684;&#x95EE;&#x9898;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x8F6F;&#x95F4;&#x9694;&#x6700;&#x5927;&#x5316;&#x95EE;&#x9898;</strong>&#xFF0C;&#x7531;&#x8F6F;&#x4EF6;&#x9694;&#x6700;&#x5927;&#x5316;&#x5B66;&#x4E60;&#x51FA;&#x6765;&#x7684;SVM&#x6211;&#x4EEC;&#x79F0;&#x4E3A;<strong>&#x7EBF;&#x6027;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;</strong>&#x3002;<br>&#x2003;&#x2003;&#x9700;&#x8981;&#x8865;&#x5145;&#x8BF4;&#x660E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x7531;&#x786C;&#x95F4;&#x9694;&#x6700;&#x5927;&#x5316;&#x5B66;&#x4E60;&#x51FA;&#x6765;&#x7684;SVM&#x6211;&#x4EEC;&#x79F0;&#x4E3A;<strong>&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;</strong>&#xFF0C;&#x663E;&#x7136;&#xFF0C;<strong>&#x7EBF;&#x6027;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;</strong>&#x5305;&#x542B;&#x4E86;<strong>&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;</strong>&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x7EFC;&#x5408;&#x6027;&#x7684;&#x79F0;&#x8C13;&#x3002;</p>
<h3 id="1-3-&#x6C42;&#x8BC1;&#x4E4B;&#x8DEF;"><a href="#1-3-&#x6C42;&#x8BC1;&#x4E4B;&#x8DEF;" class="headerlink" title="1.3 &#x6C42;&#x8BC1;&#x4E4B;&#x8DEF;"></a>1.3 &#x6C42;&#x8BC1;&#x4E4B;&#x8DEF;</h3><p>&#x2003;&#x2003;</p>
<h4 id="1-3-1-&#x5B58;&#x5728;&#x6027;&#x8BC1;&#x660E;"><a href="#1-3-1-&#x5B58;&#x5728;&#x6027;&#x8BC1;&#x660E;" class="headerlink" title="1.3.1 &#x5B58;&#x5728;&#x6027;&#x8BC1;&#x660E;"></a>1.3.1 &#x5B58;&#x5728;&#x6027;&#x8BC1;&#x660E;</h4><p>&#x2003;&#x2003;&#x5173;&#x4E8E;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x7684;&#x5B58;&#x5728;&#x6027;&#x8BC1;&#x660E;&#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x7C7B;&#x4F3C;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x8D58;&#x8FF0;&#x4E86;&#x3002;</p>
<h4 id="1-3-2-&#x552F;&#x4E00;&#x6027;&#x8BC1;&#x660E;"><a href="#1-3-2-&#x552F;&#x4E00;&#x6027;&#x8BC1;&#x660E;" class="headerlink" title="1.3.2 &#x552F;&#x4E00;&#x6027;&#x8BC1;&#x660E;"></a>1.3.2 <a name="singleton_prove"></a>&#x552F;&#x4E00;&#x6027;&#x8BC1;&#x660E;</h4><p>&#x2003;&#x2003;&#x5173;&#x4E8E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x7684;&#x552F;&#x4E00;&#x6027;&#x8BC1;&#x660E;&#xFF0C;&#x300A;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x4E00;&#x7B14;&#x5E26;&#x8FC7;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x8BE6;&#x7EC6;&#x7684;&#x8BC1;&#x660E;&#x8FC7;&#x7A0B;&#xFF0C;&#x7F51;&#x4E0A;&#x4E5F;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x8D44;&#x6599;&#x3002;&#x76EE;&#x524D;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x8BC1;&#x660E;&#x51FA;&#x6765;&#xFF0C;&#x540E;&#x7EED;&#x8BC1;&#x660E;&#x4E86;&#x518D;&#x6765;&#x8865;&#x9F50;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x8D34;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;</p>
<ul>
<li>&#x6743;&#x91CD;&#x7CFB;&#x6570;&#x5411;&#x91CF;$\vec w$&#x7684;&#x503C;&#x65F6;&#x552F;&#x4E00;&#x7684;&#xFF1B;</li>
<li>&#x504F;&#x7F6E;&#x7CFB;&#x6570;<strong>$b$&#x7684;&#x503C;&#x53EF;&#x80FD;&#x4E0D;&#x552F;&#x4E00;&#xFF0C;&#x5B58;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x533A;&#x95F4;</strong>&#x3002;</li>
</ul>
<h4 id="1-3-3-&#x6C42;&#x89E3;&#x601D;&#x8DEF;"><a href="#1-3-3-&#x6C42;&#x89E3;&#x601D;&#x8DEF;" class="headerlink" title="1.3.3 &#x6C42;&#x89E3;&#x601D;&#x8DEF;"></a>1.3.3 &#x6C42;&#x89E3;&#x601D;&#x8DEF;</h4><p>&#x2003;&#x2003;&#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x601D;&#x8DEF;&#x4E00;&#x81F4;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x8981;&#x5148;&#x5229;&#x7528;KKT&#x6761;&#x4EF6;&#x5C06;&#x539F;&#x59CB;&#x95EE;&#x9898;&#x8F6C;&#x6362;&#x4E3A;&#x7B49;&#x4EF7;&#x7684;&#x5BF9;&#x5076;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5BF9;&#x8F6C;&#x6362;&#x540E;&#x7684;&#x5BF9;&#x5076;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x6C42;&#x89E3;&#xFF0C;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762; &#x3002;</p>
<h5 id="1-3-3-1-&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;"><a href="#1-3-3-1-&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;" class="headerlink" title="1.3.3.1 &#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;"></a>1.3.3.1 &#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;</h5><p>&#x2003;&#x2003;&#x5148;&#x6839;&#x636E;&#x5F0F;&#xFF08;1-4&#xFF09;&#x6784;&#x9020;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>L(\vec w, b, \vec \xi, \vec \alpha, \vec \beta) =  {\frac{1}{2} {||w||}}^2 + C\sum_{i=1}^N \xi_i - { \sum_{i=1}^N \alpha_i  [y_i (\vec w &#xB7; \vec x_i + b) - (1 - \xi_i)]} -  { \sum_{i=1}^N \beta_i \xi_i }<br>\tag{1 - 5}<br>$$</p>
<p>&#x2003;&#x2003;&#x5F0F;&#x4E2D;&#xFF0C;$\alpha_i \geq 0, \ \beta_i \geq 0$&#x3002;&#x53E6;&#x5916;&#x9700;&#x8981;&#x8865;&#x5145;&#x7684;&#x662F;&#xFF0C;&#x6784;&#x9020;&#x6B64;&#x5E7F;&#x4E49;&#x62C9;&#x4E2A;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x540E;&#x7684;&#x9644;&#x52A0;&#x7B49;&#x5F0F;&#x6761;&#x4EF6;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>\begin{split}<br>\begin{cases}<br>&amp; y_i \lgroup {\vec w} &#xB7; \vec x_i + {b} \rgroup - (1 - \xi_i) = 0 \\\\<br>\\\\<br>&amp; \beta_i \cdot\xi_i = 0<br>\end{cases}<br>\end{split}<br>$$</p>
<h5 id="1-3-3-2-&#x5BF9;&#x5076;&#x95EE;&#x9898;"><a href="#1-3-3-2-&#x5BF9;&#x5076;&#x95EE;&#x9898;" class="headerlink" title="1.3.3.2 &#x5BF9;&#x5076;&#x95EE;&#x9898;"></a>1.3.3.2 &#x5BF9;&#x5076;&#x95EE;&#x9898;</h5><p>&#x2003;&#x2003;&#x7531;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x7684;&#x8BBA;&#x8FF0;&#x53EF;&#x77E5;&#xFF0C;&#x539F;&#x59CB;&#x95EE;&#x9898;&#x7684;&#x5BF9;&#x5076;&#x95EE;&#x9898;&#x662F;&#x5176;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x7684;&#x6781;&#x5927;&#x6781;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x5373;$\max \limits_{\alpha} \min \limits_{\vec w, \vec b,\vec \xi} L(\vec w, \vec b,\vec \xi, \vec \alpha, \vec \beta)$&#x3002;</p>
<h5 id="1-3-3-3-&#x6781;&#x5C0F;&#x503C;"><a href="#1-3-3-3-&#x6781;&#x5C0F;&#x503C;" class="headerlink" title="1.3.3.3 &#x6781;&#x5C0F;&#x503C;"></a>1.3.3.3 &#x6781;&#x5C0F;&#x503C;</h5><p>&#x2003;&#x2003;&#x5148;&#x6C42;&#x6781;&#x5C0F;&#x503C;&#x95EE;&#x9898;&#x3002;&#x5C06;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x5BF9;$\vec w&#x3001;b&#x3001;\vec \xi$&#x5206;&#x522B;&#x6C42;&#x504F;&#x5BFC;&#x6709;&#xFF1A;</p>
<p>$$<br>\begin{cases}<br>\begin{split}<br>&amp;\nabla _{\vec w} L(\vec w, \vec b,\vec \xi, \vec \alpha, \vec \beta) = \vec w - \sum_{i=1}^N \alpha_i y_i \vec x_i \\\\<br>&amp;\nabla _b L(\vec w, \vec b,\vec \xi, \vec \alpha, \vec \beta) = - \sum_{i=1}^N \alpha_i y_i \\\\<br>&amp;\nabla _{\vec \xi} L(\vec w, \vec b,\vec \xi, \vec \alpha, \vec \beta) = \vec C - \vec \alpha - \vec \beta<br>\end{split}<br>\end{cases}<br>\tag{1 - 6}<br>$$</p>
<p>&#x2003;&#x2003;&#x6CE8;&#x610F;&#xFF0C;&#x4E0A;&#x5F0F;&#x4E2D;$\vec C = \underbrace{(C, C, \cdots, C)^T}_{N}$&#xFF0C;&#x662F;&#x4EE5;&#x60E9;&#x7F5A;&#x7CFB;&#x6570;C&#x4E3A;&#x57FA;&#x672C;&#x5143;&#x7D20;&#x7684;N&#x7EF4;&#x5E38;&#x6570;&#x5411;&#x91CF;&#x3002;<br>&#x2003;&#x2003;&#x7136;&#x540E;&#x5206;&#x522B;&#x53E6;&#x4E0A;&#x5F0F;&#xFF08;1-6&#xFF09;&#x7684;&#x4E09;&#x4E2A;&#x504F;&#x5BFC;&#x6570;&#x7B49;&#x4E8E;&#x96F6;&#xFF0C;&#x6709;&#xFF1A;</p>
<p>$$<br>\begin{cases}<br>\begin{split}<br>&amp; \vec w - \sum_{i=1}^N \alpha_i y_i \vec x_i = \vec 0\\\\<br>&amp; \sum_{i=1}^N \alpha_i y_i = 0\\\\<br>&amp; \vec C - \vec \alpha - \vec \beta = \vec 0<br>\end{split}<br>\end{cases}<br>\tag{1 - 7}<br>$$</p>
<p>&#x2003;&#x2003;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4E0A;&#x5F0F;&#xFF08;1-7&#xFF09;&#x56DE;&#x4EE3;&#x5230;&#x5F0F;&#xFF08;1-5&#xFF09;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5316;&#x7B80;&#xFF0C;&#x6709;&#xFF1A;</p>
<p>$$<br>\begin{split}<br>&amp; L(\vec w, \vec b,\vec \xi, \vec \alpha, \vec \beta)\\\\<br>&amp;= \underbrace{ {\frac{1}{2} {||w||}}^2 - { \sum_{i=1}^N \alpha_i  y_i (\vec w &#xB7; \vec x_i + b) } +  { \sum_{i=1}^N \alpha_i }}_{&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;} + C\sum_{i=1}^N \xi_i - \sum_{i=1}^N \alpha_i \xi_i - \sum_{i=1}^N \beta_i \xi_i \\\\<br>&amp;= \underbrace{ {\frac{1}{2} {||w||}}^2 - { \sum_{i=1}^N \alpha_i  y_i (\vec w &#xB7; \vec x_i + b) } +  { \sum_{i=1}^N \alpha_i }}_{&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;} + \sum_{i=1}^N (C - \alpha_i - \beta_i) \xi_i\\\\<br>&amp;= \underbrace{ {\frac{1}{2} {||w||}}^2 - { \sum_{i=1}^N \alpha_i  y_i (\vec w &#xB7; \vec x_i + b) } +  { \sum_{i=1}^N \alpha_i }}_{&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;} + \underbrace{(\vec C - \vec \alpha - \vec \beta)}_{\vec 0} \cdot \vec \xi\\\\<br>&amp;=  -\frac{1}{2} \sum_{i=1}^N \sum_{j=1}^N \alpha_i \alpha_j y_i y_j (\vec x_i &#xB7; \vec x_j) + \sum_{i=1}^N \alpha_i<br>\end{split}<br>\tag{1 - 8}<br>$$</p>
<p>&#x2003;&#x2003;&#x7531;&#x4E0A;&#x5F0F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;<strong>&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x4E2A;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x548C;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E7F;&#x4E49;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x7684;&#x6781;&#x5C0F;&#x503C;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#x5F62;&#x5F0F;&#x662F;&#x7B49;&#x4EF7;&#x7684;&#xFF0C;&#x5DEE;&#x522B;&#x5728;&#x4E8E;&#x4E24;&#x8005;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x540E;&#x8005;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x8FD8;&#x5305;&#x62EC;&#x4E86;&#x4E00;&#x4E9B;&#x5E76;&#x4E0D;&#x4E25;&#x683C;&#x6EE1;&#x8DB3;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x8981;&#x6C42;&#x7684;&#x6837;&#x672C;&#x70B9;</strong>&#xFF0C;&#x5373;&#x6709;&#x5982;&#x4E0B;&#x7ED3;&#x679C;&#xFF1A;</p>
<p>$$<br>\underbrace{\min \limits_{\vec w, \vec b} L(\vec w, \vec b, \vec \alpha)}_{&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x6781;&#x5C0F;&#x503C;}= \underbrace{\min \limits_{\vec w, \vec b,\vec \xi} L(\vec w, \vec b,\vec \xi, \vec \alpha, \vec \beta)}_{&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x6781;&#x5C0F;&#x503C;}= -\frac{1}{2} \sum_{i=1}^N \sum_{j=1}^N \alpha_i \alpha_j y_i y_j (\vec x_i &#xB7; \vec x_j) + \sum_{i=1}^N \alpha_i<br>\tag{1 - 9}<br>$$</p>
<h5 id="1-3-3-4-&#x6781;&#x5927;&#x503C;"><a href="#1-3-3-4-&#x6781;&#x5927;&#x503C;" class="headerlink" title="1.3.3.4 &#x6781;&#x5927;&#x503C;"></a>1.3.3.4 &#x6781;&#x5927;&#x503C;</h5><p>&#x2003;&#x2003;&#x6C42;&#x51FA;&#x6781;&#x5C0F;&#x503C;&#x95EE;&#x9898;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x6C42;&#x89E3;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6781;&#x5927;&#x503C;&#xFF0C;&#x5373;&#x6C42;&#x89E3;&#x4E0B;&#x5217;&#x95EE;&#x9898;&#xFF1A;</p>
<p>$$<br>\max \limits_{\vec \alpha} [-\frac{1}{2} \sum_{i=1}^N \sum_{j=1}^N \alpha_i \alpha_j y_i y_j (\vec x_i &#xB7; \vec x_j) + \sum_{i=1}^N \alpha_i] \\\\<br>\tag{1 - 10}<br>$$</p>
<p>&#x2003;&#x2003;&#x5F53;&#x7136;&#xFF0C;&#x4E0A;&#x5F0F;&#x7684;$\vec \alpha$&#x8FD8;&#x5FC5;&#x987B;&#x8981;&#x6EE1;&#x8DB3;&#x5982;&#x4E0B;&#x7684;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF1A;</p>
<p>$$<br>\begin{split}<br>\begin{cases}<br>\sum_{i=1}^N \alpha_i y_i = 0\\\\<br>\\\\<br>\vec C - \vec \alpha - \vec \beta = \vec 0, \ C &gt; 0 \\\\<br>\\\\<br>\alpha_i \geq 0, \ \ \beta_i \geq 0, \ i=1,2, \cdots, N<br>\end{cases}<br>\end{split}<br>\tag{1 - 11}<br>$$</p>
<p>&#x2003;&#x2003;&#x56E0;&#x4E3A;&#x8981;&#x6C42;&#x5BF9;$\vec \alpha$&#x7684;&#x6781;&#x5927;&#x503C;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x6D88;&#x53BB;&#x4E0A;&#x5F0F;&#x4E2D;&#x7684;$\vec \beta$&#xFF0C;$C$&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x6570;&#xFF0C;&#x4E0D;&#x7528;&#x7406;&#x4F1A;&#x3002;&#x6839;&#x636E;&#x4E0A;&#x5F0F;&#xFF08;1-11&#xFF09;&#x7684;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x5F0F;&#x5B50;&#x53EF;&#x6C42;&#x5F97;&#xFF1A;</p>
<p>$$<br>\begin{split}<br>\begin{cases}<br>\sum_{i=1}^N \alpha_i y_i = 0\\\\<br>\\\\<br>0 \leq \alpha_i \leq C, \ i=1,2, \cdots, N<br>\end{cases}<br>\end{split}<br>\tag{1 - 12}<br>$$</p>
<p>&#x2003;&#x2003;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x4FDD;&#x7559;$\beta_i$&#x800C;&#x6D88;&#x6389;$\alpha_i$&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5173;&#x4E8E;$\beta_i$&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E3A;&#xFF1A;$\beta_i \in [0, \ C]$&#x3002;<br>&#x2003;&#x2003;&#x4ECE;&#x4E0A;&#x5F0F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x7EBF;&#x6027;&#x53EF;&#x5206;SVM&#xFF08;$\alpha_i \in [0, \ \infty)$&#xFF09;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;SVM&#x7684;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;$\alpha_i$&#x7684;&#x53D6;&#x503C;&#x533A;&#x95F4;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x4E0A;&#x9650;&#x7EA6;&#x675F;&#xFF08;$\alpha_i \in [0, \ C]$&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0A;&#x9650;&#x7EA6;&#x675F;&#x6B63;&#x597D;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x60E9;&#x7F5A;&#x53C2;&#x6570;&#x3002;<br>&#x2003;&#x2003;&#x4ECE;&#x4E0A;&#x5F0F;&#xFF08;1-12&#xFF09;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6781;&#x5927;&#x503C;&#x6C42;&#x89E3;&#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6781;&#x5927;&#x503C;&#x6C42;&#x89E3;&#x601D;&#x8DEF;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5176;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x4E0A;&#x9650;&#x7EA6;&#x675F;&#x800C;&#x5DF2;&#x3002;&#x5229;&#x7528;&#x5F0F;&#xFF08;1-12&#xFF09;&#x7684;&#x7EA6;&#x675F;&#x7B49;&#x5F0F;&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#x5F0F;&#x5B50;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;$N$&#x4E2A;&#x6717;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#x4E2D;&#x7684;$N-1$&#x4E2A;&#x53BB;&#x8868;&#x793A;&#x5269;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x56DE;&#x4EE3;&#x5230;&#x5F0F;&#xFF08;1-10&#xFF09;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x5BF9;$N-1$&#x4E2A;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#x6C42;&#x504F;&#x5BFC;&#x5E76;&#x53E6;&#x5176;&#x7B49;&#x4E8E;&#x96F6;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;$N-1$&#x4E2A;&#x7B49;&#x5F0F;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51FA;&#x6240;&#x6709;&#x7684;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x7684;$\alpha_i^*,\  i=1,2, \cdots, N$&#x3002;</p>
<h5 id="1-3-3-5-vec-w-&#x6C42;&#x89E3;"><a href="#1-3-3-5-vec-w-&#x6C42;&#x89E3;" class="headerlink" title="1.3.3.5 $\vec w^*$&#x6C42;&#x89E3;"></a>1.3.3.5 <a name="weight-anchor"></a>$\vec w^*$&#x6C42;&#x89E3;</h5><p>&#x2003;&#x2003;&#x6C42;&#x51FA;$\vec \alpha^*$&#x540E;&#xFF0C;&#x6839;&#x636E;&#x5F0F;&#xFF08;1-7&#xFF09;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7B49;&#x5F0F;&#xFF0C;&#x53EF;&#x6C42;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x6743;&#x91CD;&#x7CFB;&#x6570;&#x5411;&#x91CF;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>\begin{split}<br>\vec w^* &amp;= \sum_{i=1}^N \alpha_i^* &#xB7; y_i &#xB7; \vec x_i \\\\<br>&amp;= \alpha_1^* y_1 \vec x_1 + \ \alpha_2^* y_2 \vec x_2 + \ \dots + \ \alpha_N^* y_N \vec x_N<br>\end{split}<br>\tag{1 - 13}<br>$$</p>
<p>&#x2003;&#x2003;&#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x7C7B;&#x4F3C;&#xFF0C;&#x5BF9;&#x4E8E;$\vec \alpha^* = 0$&#x7684;&#x70B9;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x53C2;&#x6570;$\vec w^*$&#x3002;</p>
<h5 id="1-3-3-6-vec-beta-i-&#x6C42;&#x89E3;"><a href="#1-3-3-6-vec-beta-i-&#x6C42;&#x89E3;" class="headerlink" title="1.3.3.6 $\vec \beta_i^*$&#x6C42;&#x89E3;"></a>1.3.3.6 $\vec \beta_i^*$&#x6C42;&#x89E3;</h5><p>&#x2003;&#x2003;&#x6C42;&#x51FA;$\vec \alpha^*$&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6839;&#x636E;&#x6761;&#x4EF6;$\vec C - \vec \alpha - \vec \beta = \vec 0$&#x53EF;&#x4EE5;&#x6C42;&#x5F97;$\beta_i^*$&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>\beta_i^* = C - \alpha_i^*, \ i=1,2, \cdots, N<br>\tag{1 - 14}<br>$$</p>
<h5 id="1-3-3-7-xi-i-&#x6C42;&#x89E3;"><a href="#1-3-3-7-xi-i-&#x6C42;&#x89E3;" class="headerlink" title="1.3.3.7 $\xi_i^*$&#x6C42;&#x89E3;"></a>1.3.3.7 $\xi_i^*$&#x6C42;&#x89E3;</h5><p>&#x2003;&#x2003;&#x6C42;&#x51FA;$\beta_i^*$&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6839;&#x636E;&#x6784;&#x9020;&#x5E7F;&#x4E49;&#x62C9;&#x4E2A;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x65F6;&#x7684;&#x6761;&#x4EF6;$\beta_i^* \cdot \xi_i^* = 0$&#x5BF9;$\xi_i^*$&#x7684;&#x89E3;&#x8BA8;&#x8BBA;&#x5982;&#x4E0B;&#xFF1A;<br>&#x2003;&#x2003;1. &#x5F53;$\beta_i^* = 0$&#x65F6;&#xFF0C;$\xi_i^*$&#x53EF;&#x4EE5;&#x53D6;&#x4EFB;&#x610F;&#x503C;&#xFF08;&#x5F53;&#x7136;&#x8FD8;&#x8981;&#x6EE1;&#x8DB3;&#x5176;&#x5B83;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF09;&#x3002;<br>&#x2003;&#x2003;2. &#x5F53;$\beta_i^* \neq 0$&#x65F6;&#xFF0C;$\xi_i^* \equiv 0$&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x53EA;&#x80FD;&#x53D6;0&#x3002;<br>&#x2003;&#x2003;&#x7EFC;&#x4E0A;&#xFF0C;$\xi_i^*$&#x7684;&#x53D6;&#x503C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>\xi_i^* =<br>\begin{cases}<br>any,  \ \ \beta_i^* = 0 \\\\<br>\\\\<br>0,  \ \ \beta_i^* \neq 0 \\\\<br>\end{cases}<br>\tag{1 - 15}<br>$$</p>
<h5 id="1-3-3-8-b-&#x6C42;&#x89E3;"><a href="#1-3-3-8-b-&#x6C42;&#x89E3;" class="headerlink" title="1.3.3.8 $b^*$&#x6C42;&#x89E3;"></a>1.3.3.8 <a name="bias-anchor"></a>$b^*$&#x6C42;&#x89E3;</h5><p>&#x2003;&#x2003;1. &#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6C42;&#x89E3;&#x7C7B;&#x4F3C;&#xFF0C;&#x5F53;$\alpha_i^* = 0$&#x65F6;&#xFF0C;&#x5373;&#x5BF9;&#x5E94;&#x7684;&#x6837;&#x672C;&#x70B9;&#x4E0D;&#x8D77;&#x7EA6;&#x675F;&#x4F5C;&#x7528;&#xFF0C;&#x6B64;&#x65F6;$b^*$&#x53D6;&#x4EFB;&#x610F;&#x503C;&#x90FD;&#x80FD;&#x6EE1;&#x8DB3;&#xFF0C;&#x5373;&#x6709;&#x65E0;&#x7A77;&#x4E2A;&#x89E3;&#x3002;&#x5BF9;&#x5E94;&#x7684;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x662F;&#xFF1A;&#x5F53;&#x524D;&#x70B9;&#x5C5E;&#x4E8E;&#x975E;&#x652F;&#x6301;&#x5411;&#x91CF;&#xFF0C;&#x4E0D;&#x53C2;&#x4E0E;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x53C2;&#x6570;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x6B64;&#x65F6;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;&#x6C42;&#x89E3;$b^*$&#x3002;<br>&#x2003;&#x2003;2. &#x5F53;$\alpha_i^* \neq 0 &#x4E14; \alpha_i^* = C $&#x65F6;&#xFF0C;&#x6709;$\beta_i^* = 0$&#xFF0C;&#x6B64;&#x65F6;$\xi_i^*$&#x53EF;&#x53D6;&#x4EFB;&#x610F;&#x503C;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x662F;&#xFF1A;&#x5F53;&#x524D;&#x70B9;&#x5C5E;&#x4E8E;&#x652F;&#x6301;&#x5411;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x4F4D;&#x4E8E;&#x7F13;&#x51B2;&#x533A;&#x5185;&#xFF0C;&#x5176;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#x53EF;&#x6839;&#x636E;&#x6A21;&#x578B;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4EFB;&#x610F;&#x503C;&#x3002;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x89E3;&#x51FA; $b^*$&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x70B9;&#x4E0D;&#x53D7;&#x60E9;&#x7F5A;&#x53C2;&#x6570;&#x548C;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#x7684;&#x5F71;&#x54CD;&#x3002;<br>&#x2003;&#x2003;<strong>3. &#x5F53;$\alpha_i^* \neq 0 &#x4E14; \alpha_i^* \neq C $&#x65F6;&#xFF08;&#x5373;$0 &lt; \alpha_i^* &lt; C&#xFF09;$&#xFF0C;&#x6709;$\beta_i^* \neq 0$&#xFF0C;&#x53EF;&#x77E5;$\xi_i^* = 0$&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x662F;&#xFF1A;&#x5F53;&#x524D;&#x6837;&#x672C;&#x70B9;&#x5728;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x4E0A;&#xFF0C;&#x4E25;&#x683C;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#x4E3A;0&#x3002;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x518D;&#x6839;&#x636E;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;KKT&#x6761;&#x4EF6;&#x5F97;&#x5230;&#xFF1A;$y_i \lgroup {\vec w} &#xB7; \vec x_i + {b} \rgroup - (1 - \xi_i) = 0$&#xFF0C;&#x5229;&#x7528;&#x8BE5;&#x6761;&#x4EF6;&#x53EF;&#x6C42;&#x5F97; $b^*$</strong>&#xFF1A;</p>
<p>$$<br>\begin{split}<br>b^* &amp;= y_i(1 - \xi_i^*) -  \vec w^* &#xB7; \vec x_i \\\\<br>&amp;= y_i(1 - \xi_i^*) - \sum_{j=1}^N \alpha_j^* &#xB7; y_j &#xB7; \vec x_j &#xB7; \vec x_i \\\\<br>&amp;= y_i - \sum_{j=1}^N \alpha_j^* &#xB7; y_j &#xB7; \vec x_j &#xB7; \vec x_i<br>\end{split}<br>\tag{1 - 16}<br>$$</p>
<p>&#x2003;&#x2003;&#x7531;&#x4E0A;&#x5F0F;&#x53EF;&#x77E5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x504F;&#x7F6E;&#x53C2;&#x6570;$b^*$&#x7684;&#x6C42;&#x89E3;&#x65B9;&#x6CD5;&#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x7684;&#x65F6;&#x5019;&#x76F8;&#x540C;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E8E;&#xFF0C;<font color="red">&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x6C42;&#x89E3;$b^*$&#x65F6;&#xFF0C;&#x5229;&#x7528;&#x7684;&#x662F;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x7CFB;&#x6570;$\alpha_i \neq 0$&#x7684;&#x70B9;&#xFF0C;&#x800C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6C42;&#x89E3;&#xFF0C;&#x5176;&#x8981;&#x6C42;&#x66F4;&#x4E25;&#x683C;&#xFF0C;&#x7528;&#x6765;&#x6C42;&#x89E3;&#x7684;&#x70B9;&#x5FC5;&#x987B;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;$\alpha_i \neq 0 &#x4E14; \alpha_i^* \neq C $&#x3002;</font><br>&#x2003;&#x2003;&#x53E6;&#x5916;&#x8FD8;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x5728;<a href="#singleton_prove">1.3.2&#x5C0F;&#x8282;</a>&#x4E2D;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x4E86;&#xFF0C;$b^*$&#x7684;&#x503C;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x552F;&#x4E00;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;$b^*$&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x503C;&#xFF0C;<strong>&#x7136;&#x800C;&#x6839;&#x636E;&#x674E;&#x822A;&#x8001;&#x5E08;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x53EA;&#x4F1A;&#x9047;&#x5230;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x552F;&#x4E00;&#x89E3;&#x8FD9;&#x79CD;&#x3002;</strong>&#x3002;<br>&#x2003;&#x2003;&#x81F3;&#x6B64;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;SVM&#x7684;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x53C2;&#x6570;$\vec w&#x3001;b$&#x5747;&#x6C42;&#x89E3;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x65B9;&#x7A0B;&#x81EA;&#x7136;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E86;&#x3002;</p>
<h4 id="1-3-4-&#x518D;&#x8C08;-vec-w"><a href="#1-3-4-&#x518D;&#x8C08;-vec-w" class="headerlink" title="1.3.4 &#x518D;&#x8C08;$\vec w^*$"></a>1.3.4 &#x518D;&#x8C08;$\vec w^*$</h4><p>&#x2003;&#x2003;<a href="#weight-anchor">1.3.3.5&#x5C0F;&#x8282;</a>&#x4E2D;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x4E86;&#xFF0C;&#x5BF9;&#x6C42;&#x89E3;&#x51FA;&#x7684;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x5B50;$\vec \alpha_i^* = 0$&#x7684;&#x70B9;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x53C2;&#x4E0E;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x53C2;&#x6570;$\vec w^*$&#x7684;&#x51B3;&#x7B56;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;$\vec w^*$&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x4E0E;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;/&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x3001;&#x60E9;&#x7F5A;&#x53C2;&#x6570;&#x6709;&#x5173;&#x7684;&#x9879;&#xFF0C;&#x518D;&#x7ED3;&#x5408;<a href="#bias-anchor">1.3.3.8&#x5C0F;&#x8282;</a>&#x4E2D;$b^*$&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;<font color="red"><strong>&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x4E0D;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8981;&#x6C42;&#x7684;&#x8FD9;&#x4E9B;&#x70B9;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x5206;&#x5E03;&#x8D70;&#x5411;&#x548C;&#x5F62;&#x72B6;&#xFF0C;&#x53EA;&#x5F71;&#x54CD;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x5728;&#x6574;&#x4E2A;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5206;&#x5E03;&#x4F4D;&#x7F6E;&#xFF01;</strong></font></p>
<h3 id="1-4-&#x652F;&#x6301;&#x5411;&#x91CF;"><a href="#1-4-&#x652F;&#x6301;&#x5411;&#x91CF;" class="headerlink" title="1.4 &#x652F;&#x6301;&#x5411;&#x91CF;"></a>1.4 &#x652F;&#x6301;&#x5411;&#x91CF;</h3><h4 id="1-4-1-&#x8F6F;&#x95F4;&#x9694;&#x652F;&#x6301;&#x5411;&#x91CF;"><a href="#1-4-1-&#x8F6F;&#x95F4;&#x9694;&#x652F;&#x6301;&#x5411;&#x91CF;" class="headerlink" title="1.4.1 &#x8F6F;&#x95F4;&#x9694;&#x652F;&#x6301;&#x5411;&#x91CF;"></a>1.4.1 &#x8F6F;&#x95F4;&#x9694;&#x652F;&#x6301;&#x5411;&#x91CF;</h4><p>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x4E0E;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x7565;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x5176;&#x652F;&#x6301;&#x5411;&#x91CF;&#x4E0D;&#x4EC5;&#x4EC5;&#x4F4D;&#x4E8E;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x4E0A;&#xFF0C;&#x8FD8;&#x4F1A;&#x5B58;&#x5728;&#x4E8E;&#x95F4;&#x9694;&#x4E4B;&#x4E2D;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x672C;&#x7CFB;&#x5217;<a href="/2017/04/30/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7CFB;&#x5217;&#x4E4B;&#x4E09;&#xFF1A;SVM3/">&#x7B2C;&#x4E09;&#x7BC7;</a>&#x6587;&#x7AE0;&#x4E2D;&#x5C31;&#x63D0;&#x5230;&#x8FC7;&#x7684;<strong>&#x7F13;&#x51B2;&#x533A;</strong>&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5982;&#x4E0B;&#x793A;&#x610F;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="/2018/03/31/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7CFB;&#x5217;&#x4E4B;&#x4E09;&#xFF1A;SVM5/&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;.png" width="550" height="400"></p>
<div align="center">&#x56FE;1-1&#x3000;&#x3000;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x652F;&#x6301;&#x5411;&#x91CF;&#x793A;&#x610F;&#x56FE;</div> 

<h4 id="1-4-2-&#x8DDD;&#x79BB;-VS-&#x51E0;&#x4F55;&#x95F4;&#x9694;"><a href="#1-4-2-&#x8DDD;&#x79BB;-VS-&#x51E0;&#x4F55;&#x95F4;&#x9694;" class="headerlink" title="1.4.2 &#x8DDD;&#x79BB; VS &#x51E0;&#x4F55;&#x95F4;&#x9694;"></a>1.4.2 &#x8DDD;&#x79BB; VS &#x51E0;&#x4F55;&#x95F4;&#x9694;</h4><p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x8BB0;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x3001;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x7684;&#x8DDD;&#x79BB;&#xFF08;&#x7EDD;&#x5BF9;&#x503C;&#xFF09;&#x3001;&#x51E0;&#x4F55;&#x95F4;&#x9694;&#x5206;&#x522B;&#x4E3A;&#xFF08;&#x4E0B;&#x540C;&#xFF09;$d_{h}&#x3001;d_{b}&#x3001;m_{\gamma}$&#xFF0C;&#x53EF;&#x77E5;&#x51E0;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x8BA1;&#x7B97;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<p>$$<br>\begin{cases}<br>\begin{split}<br>&amp; d_{h} = |1 - \xi_i|\\\\<br>\\\\<br>&amp; d_{b} = \xi_i \\\\<br>\\\\<br>&amp; m_{\gamma} = \frac{1}{||\vec w||} - \frac{\xi_i}{||\vec w||} = \frac{1 - \xi_i}{||\vec w||}<br>\end{split}<br>\end{cases}<br>\tag{1 - 17}<br>$$</p>
<p>&#x2003;&#x2003;<font color="red">&#x5907;&#x6CE8;&#xFF1A;&#x4EE5;&#x4E0A;&#x7ED3;&#x679C;&#x5747;&#x7531;&#x4E0D;&#x7B49;&#x5F0F;&#xFF08;1-2&#xFF09;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x95F4;&#x9694;$1 - \xi_i$&#x53CA;&#x51FD;&#x6570;&#x95F4;&#x9694;&#x4E0E;&#x51E0;&#x4F55;&#x95F4;&#x9694;&#x7684;&#x5173;&#x7CFB;&#x63A8;&#x5BFC;&#x800C;&#x6765;&#x3002;</font></p>
<h4 id="1-4-3-&#x652F;&#x6301;&#x5411;&#x91CF;&#x7C7B;&#x578B;"><a href="#1-4-3-&#x652F;&#x6301;&#x5411;&#x91CF;&#x7C7B;&#x578B;" class="headerlink" title="1.4.3 &#x652F;&#x6301;&#x5411;&#x91CF;&#x7C7B;&#x578B;"></a>1.4.3 &#x652F;&#x6301;&#x5411;&#x91CF;&#x7C7B;&#x578B;</h4><p>&#x2003;&#x2003;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x4F4D;&#x4E8E;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x4E0A;&#x3001;&#x4F4D;&#x4E8E;&#x672C;&#x7C7B;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x3001;&#x4F4D;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x4F4D;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x65CF;&#x7FA4;&#x4E2D;&#xFF08;&#x53E6;&#x4E00;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#x4E4B;&#x540E;&#xFF09;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x8FD9;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#x5206;&#x7C7B;&#x8BA8;&#x8BBA;&#x3002;</p>
<h5 id="1-4-3-1-&#x4F4D;&#x4E8E;&#x95F4;&#x9694;&#x8FB9;&#x754C;"><a href="#1-4-3-1-&#x4F4D;&#x4E8E;&#x95F4;&#x9694;&#x8FB9;&#x754C;" class="headerlink" title="1.4.3.1 &#x4F4D;&#x4E8E;&#x95F4;&#x9694;&#x8FB9;&#x754C;"></a>1.4.3.1 &#x4F4D;&#x4E8E;&#x95F4;&#x9694;&#x8FB9;&#x754C;</h5><p>&#x2003;&#x2003;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x4E0E;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BB2;&#x7684;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#x76F8;&#x540C;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;$\xi_i  \equiv 0$&#xFF0C;&#x5176;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x4E3A;$\frac{1}{||\vec w||}$&#xFF0C;&#x4E0A;&#x56FE;&#x4E2D;&#x865A;&#x7EBF;L1&#x3001;L2&#x4E0A;&#x7684;&#x4E24;&#x4E2A;&#x70B9;&#x5C31;&#x5C5E;&#x4E8E;&#x8FD9;&#x79CD;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x53D9;&#x8FF0;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x8FD9;&#x79CD;&#x5411;&#x91CF;&#x53D6;&#x4E2A;&#x540D;&#x5B57;&#x53EB;<font color="red">$&#x5F3A;&#x7EA6;&#x675F;/&#x6807;&#x51C6;&#x652F;&#x6301;&#x5411;&#x91CF;^*$</font>&#x3002;<br>&#x2003;&#x2003;<font color="red">&#x8FD9;&#x4E9B;&#x53F3;&#x4E0A;&#x89D2;&#x5E26;<code>*</code>&#x7684;&#x540D;&#x5B57;&#x662F;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x53D9;&#x8FF0;&#x6240;&#x547D;&#x540D;&#xFF0C;&#x4EC5;&#x5728;&#x672C;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x901A;&#x7528;&#xFF0C;&#x975E;&#x5B98;&#x65B9;/&#x6743;&#x5A01;&#x672F;&#x8BED;&#xFF0C;&#x540E;&#x6587;&#x4E0D;&#x518D;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x77E5;&#x6089;&#x3002;</font></p>
<h5 id="1-4-3-2-&#x4F4D;&#x4E8E;&#x672C;&#x7C7B;&#x7F13;&#x51B2;&#x533A;"><a href="#1-4-3-2-&#x4F4D;&#x4E8E;&#x672C;&#x7C7B;&#x7F13;&#x51B2;&#x533A;" class="headerlink" title="1.4.3.2 &#x4F4D;&#x4E8E;&#x672C;&#x7C7B;&#x7F13;&#x51B2;&#x533A;"></a>1.4.3.2 &#x4F4D;&#x4E8E;&#x672C;&#x7C7B;&#x7F13;&#x51B2;&#x533A;</h5><p>&#x2003;&#x2003;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#xFF0C;&#x4E0D;&#x80FD;&#x4E25;&#x683C;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x7684;&#x7EA6;&#x675F;&#x4F46;&#x504F;&#x5DEE;&#x4E0D;&#x5927;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;$ 0 &lt; \xi_i  \leq 1$&#xFF0C;&#x5B83;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x5C0F;&#x4E8E;1&#xFF0C;&#x540C;&#x65F6;&#x2265;0&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x79CD;&#x652F;&#x6301;&#x5411;&#x91CF;&#x4E3A;<font color="red">$&#x5F31;&#x504F;&#x5DEE;&#x652F;&#x6301;&#x5411;&#x91CF;^*$</font>&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;$\xi_1&#x3001;\xi_2$&#x5BF9;&#x5E94;&#x7684;&#x70B9;&#x3002;</p>
<h5 id="1-4-3-3-&#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x7F13;&#x51B2;&#x533A;"><a href="#1-4-3-3-&#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x7F13;&#x51B2;&#x533A;" class="headerlink" title="1.4.3.3 &#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x7F13;&#x51B2;&#x533A;"></a>1.4.3.3 &#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x7F13;&#x51B2;&#x533A;</h5><p>&#x2003;&#x2003;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#xFF0C;&#x4E0D;&#x4EC5;&#x4E0D;&#x80FD;&#x4E25;&#x683C;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x504F;&#x5DEE;&#x8F83;&#x5927;&#xFF08;&#x4F46;&#x4ECD;&#x7136;&#x5904;&#x4E8E;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x8D8A;&#x8FC7;&#x5BF9;&#x9762;&#x7684;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#xFF09;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;$\xi_i  &gt; 1$&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5B83;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x4E3A;&#x8D1F;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x79CD;&#x652F;&#x6301;&#x5411;&#x91CF;&#x4E3A;<font color="red">$&#x5F3A;&#x504F;&#x5DEE;&#x652F;&#x6301;&#x5411;&#x91CF;^*$</font>&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;$\xi_4$&#x5BF9;&#x5E94;&#x7684;&#x70B9;&#x3002;</p>
<h5 id="1-4-3-4-&#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x65CF;&#x7FA4;"><a href="#1-4-3-4-&#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x65CF;&#x7FA4;" class="headerlink" title="1.4.3.4 &#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x65CF;&#x7FA4;"></a>1.4.3.4 &#x4F4D;&#x4E8E;&#x53E6;&#x7C7B;&#x65CF;&#x7FA4;</h5><p>&#x2003;&#x2003;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x652F;&#x6301;&#x5411;&#x91CF;&#xFF0C;&#x5DF2;&#x7ECF;&#x8D8A;&#x8FC7;&#x4E86;&#x5BF9;&#x9762;&#x7684;&#x95F4;&#x9694;&#x8FB9;&#x754C;&#xFF0C;&#x8DD1;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x7684;&#x65CF;&#x7FA4;&#x4E2D;&#x53BB;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;$\xi_i  &gt; 2$&#xFF0C;&#x8FD9;&#x79CD;&#x6837;&#x672C;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x8BA9;&#x6A21;&#x578B;&#x4EA7;&#x751F;&#x8BEF;&#x5206;&#x7C7B;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x79CD;&#x652F;&#x6301;&#x5411;&#x91CF;&#x4E3A;<font color="red">$&#x5168;&#x504F;&#x5DEE;&#x652F;&#x6301;&#x5411;&#x91CF;^*$</font>&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;$\xi_5&#x3001;\xi_3$&#x5BF9;&#x5E94;&#x7684;&#x70B9;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x5408;&#x9875;&#x635F;&#x5931;"><a href="#&#x4E8C;&#x3001;&#x5408;&#x9875;&#x635F;&#x5931;" class="headerlink" title="&#x4E8C;&#x3001;&#x5408;&#x9875;&#x635F;&#x5931;"></a>&#x4E8C;&#x3001;&#x5408;&#x9875;&#x635F;&#x5931;</h2><h3 id="2-1-&#x518D;&#x8BBA;&#x539F;&#x59CB;&#x4F18;&#x5316;&#x95EE;&#x9898;"><a href="#2-1-&#x518D;&#x8BBA;&#x539F;&#x59CB;&#x4F18;&#x5316;&#x95EE;&#x9898;" class="headerlink" title="2.1 &#x518D;&#x8BBA;&#x539F;&#x59CB;&#x4F18;&#x5316;&#x95EE;&#x9898;"></a>2.1 &#x518D;&#x8BBA;&#x539F;&#x59CB;&#x4F18;&#x5316;&#x95EE;&#x9898;</h3><p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x770B;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x7684;&#x6C42;&#x89E3;&#x7684;&#x539F;&#x59CB;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x5176;&#x7B2C;&#x4E00;&#x3001;&#x7B2C;&#x4E8C;&#x9879;&#x4EA4;&#x6362;&#x987A;&#x5E8F;&#x540E;&#x5982;&#x4E0B;&#x5F0F;&#xFF1A;</p>
<p>$$<br>\min \limits_{\vec w, b, \vec \xi} C\sum_{i=1}^N \xi_i + {\frac{1}{2}{||\vec w||}}^2<br>\tag{2 - 1}<br>$$</p>
<p>&#x2003;&#x2003;&#x53EA;&#x770B;&#x5176;&#x5F62;&#x5F0F;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x6211;&#x4EEC;&#x8054;&#x60F3;&#x5230;&#x6B63;&#x5219;&#x5316;&#xFF08;&#x53C2;&#x89C1;&#x300A;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x300B;$P_{13} - P_{14}$&#xFF09;&#xFF0C;&#x53C2;&#x6570;&#x5411;&#x91CF;&#x7684;$L_2$&#x8303;&#x6570;&#x5BF9;&#x5E94;&#x7684;&#x6B63;&#x5219;&#x5316;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>\min \limits_{\vec w, b, \lambda} \frac{1}{N} \sum_{i=1}^N L[f(\vec x_i;\vec w), \ y_i] + \frac{\lambda}{2} ||\vec w||^2<br>\tag{2 - 2}<br>$$</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x79CD;&#x76F8;&#x4F3C;&#x5E76;&#x975E;&#x5DE7;&#x5408;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5F0F;&#xFF08;2-1&#xFF09;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;<strong>&#x7ECF;&#x9A8C;&#x98CE;&#x9669;</strong>&#xFF0C;&#x7B2C;&#x4E8C;&#x9879;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7684;<strong>$L_2$&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF08;&#x6216;&#x7F5A;&#x9879;&#xFF09;</strong>&#xFF0C;<strong>&#x539F;&#x59CB;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x7ED3;&#x6784;&#x98CE;&#x9669;&#x6700;&#x5C0F;&#x5316;&#x7B56;&#x7565;&#x7684;&#x5B9E;&#x73B0;</strong>&#x3002;&#x4ECE;&#x800C;&#xFF0C;$\xi_i$&#x5373;&#x4E3A;&#x6211;&#x4EEC;&#x7684;<strong>&#x635F;&#x5931;&#x51FD;&#x6570;</strong>&#xFF0C;&#x5373;&#x6709;&#xFF1A;</p>
<p>$$<br>\xi_i \sim L(Y, \ f(X))<br>\tag{2 - 3}<br>$$</p>
<p>&#x2003;&#x2003;&#x7136;&#x800C;&#x5728;&#x524D;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x4E2D;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x63D0;&#x5230;&#x4E86;$\xi_i$&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;&#x95EE;&#x9898;&#x800C;&#x5F15;&#x5165;&#x7684;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#xFF0C;&#x4EC5;&#x4EC5;&#x8BA8;&#x8BBA;&#x4E86;<strong>&#x6807;&#x51C6;&#x652F;&#x6301;&#x5411;&#x91CF;&#x3001;&#x5F3A;&#x504F;&#x5DEE;&#x652F;&#x6301;&#x5411;&#x91CF;&#x3001;&#x5168;&#x504F;&#x5DEE;&#x652F;&#x6301;&#x5411;&#x91CF;</strong>&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x677E;&#x5F1B;&#x53D8;&#x91CF;&#x5F97;&#x53D6;&#x503C;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x8BA1;&#x7B97;&#x8BE5;&#x53C2;&#x6570;&#x7684;&#x5177;&#x4F53;&#x516C;&#x5F0F;&#x3002;<br>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5F53;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5177;&#x6709;<strong>&#x51F8;&#x3001;&#x8FDE;&#x7EED;&#x3001;&#x53EF;&#x5BFC;</strong>&#x8FD9;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x6570;&#x5B66;&#x6027;&#x8D28;&#x65F6;&#xFF0C;&#x5176;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x624D;&#x5FC5;&#x7136;&#x6709;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x5BB9;&#x6613;&#x6C42;&#x89E3;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x7136;&#x4F1A;&#x95EE;&#xFF0C;&#x5F53;$\xi_i$&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x5B66;&#x8868;&#x8FBE;&#x5F0F;&#x624D;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;<br>&#x2003;&#x2003;<font color="red">&#x6CE8;&#x610F;&#xFF1A;&#x4EE5;&#x4E0B;&#x8BA8;&#x8BBA;&#x5747;&#x662F;&#x4EE5;$L_2$&#x8303;&#x6570;&#x4E3A;&#x6B63;&#x5219;&#x5316;&#x9879;&#x8FDB;&#x884C;&#x7684;&#x3002;</font></p>
<h3 id="2-2-&#x518D;&#x8C08;&#x635F;&#x5931;&#x51FD;&#x6570;"><a href="#2-2-&#x518D;&#x8C08;&#x635F;&#x5931;&#x51FD;&#x6570;" class="headerlink" title="2.2 &#x518D;&#x8C08;&#x635F;&#x5931;&#x51FD;&#x6570;"></a>2.2 &#x518D;&#x8C08;&#x635F;&#x5931;&#x51FD;&#x6570;</h3><p>&#x2003;&#x2003;&#x5728;<a href="2014/06/20/&#x300A;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x300B;&#x8BFB;&#x4E66;&#x624B;&#x672D;-&#x7B2C;&#x4E00;&#x7AE0;/">&#x300A;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x300B;&#x8BFB;&#x4E66;&#x624B;&#x672D;&#x7B2C;&#x4E00;&#x7AE0;</a>&#x4E2D;&#x6211;&#x4EEC;&#x8C08;&#x5230;&#x4E86;&#x51E0;&#x79CD;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5305;&#x62EC;&#x4E86;0-1&#x635F;&#x5931;&#x3001;&#x5E73;&#x65B9;&#x635F;&#x5931;&#x3001;&#x7EDD;&#x5BF9;&#x635F;&#x5931;&#x3001;&#x5BF9;&#x6570;&#x635F;&#x5931;&#xFF0C;&#x4F46;&#x8FD9;&#x51E0;&#x79CD;&#x635F;&#x5931;&#x51FD;&#x6570;&#x9664;&#x5BF9;&#x6570;&#x635F;&#x5931;&#x5916;&#x90FD;&#x4E0D;&#x5C5E;&#x4E8E;&#x4F18;&#x79C0;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;0-1&#x635F;&#x5931;&#x975E;&#x51F8;&#x3001;&#x975E;&#x8FDE;&#x7EED;&#xFF0C;&#x5E73;&#x65B9;&#x635F;&#x5931;&#x975E;&#x51F8;&#xFF0C;&#x7EDD;&#x5BF9;&#x635F;&#x5931;&#x975E;&#x51F8;&#x3001;&#x975E;&#x5904;&#x5904;&#x53EF;&#x5BFC;&#x3002;<br>&#x2003;&#x2003;&#x9664;&#x4E86;&#x4EE5;&#x4E0A;&#x63D0;&#x5230;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x4F18;&#x79C0;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x5177;&#x6709;&#x826F;&#x597D;&#x6570;&#x5B66;&#x6027;&#x8D28;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x79F0;&#x4E3A;<strong>&#x66FF;&#x4EE3;&#x635F;&#x5931;(surrogate loss)</strong>&#x3002;&#x4E00;&#x4E2A;&#x662F;<strong>&#x6307;&#x6570;&#x635F;&#x5931;</strong>&#x3001;&#x53E6;&#x4E00;&#x4E2A;&#x5C31;&#x662F;SVM&#x91CC;&#x9762;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#x7684;<strong>Hinge&#x635F;&#x5931;&#xFF08;&#x591A;&#x8BD1;&#x4F5C;&#x5408;&#x9875;&#x635F;&#x5931;&#xFF09;</strong>&#xFF0C;&#x4E09;&#x79CD;&#x635F;&#x5931;&#xFF08;&#x53E6;&#x9644;<strong>&#x5BF9;&#x7387;&#x635F;&#x5931;</strong>&#xFF09;&#x51FD;&#x6570;&#x7684;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$<br>\begin{cases}<br>\begin{split}<br>&amp;L_{hinge}(Y, \ f(X)) = max \lbrace 0, \ 1 - [y_i - f(\vec x_i)] \rbrace \\\\<br>\\\\<br>&amp;L_{exp}(Y, \ f(X)) = exp[-(y_i - f(\vec x_i))] = \frac{1}{e^{y_i - f(\vec x_i)}} \\\\<br>\\\\<br>&amp;L_{log}(Y, \ f(X)) = log \lbrace 1 + exp[-(y_i - f(\vec x_i)] \rbrace = log [1 + \frac{1}{e^{y_i - f(\vec x_i)}}]<br>\end{split}<br>\end{cases}<br>\tag{2 - 4}<br>$$</p>
<p>&#x2003;&#x2003;<font color="red">&#x6CE8;&#x610F;&#xFF1A;&#x5BF9;&#x6570;&#x635F;&#x5931;(logarithmic loss)&#x4E0E;&#x5BF9;&#x7387;&#x635F;&#x5931;(logistic loss)&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x4E0D;&#x540C;&#x53EB;&#x6CD5;&#xFF0C;<a href="https://stats.stackexchange.com/questions/223694/does-log-loss-refer-to-logarithmic-loss-or-logistic-loss" target="_blank" rel="noopener">&#x7F51;&#x4E0A;&#x8BA8;&#x8BBA;</a>&#xFF0C;&#x53EA;&#x662F;&#x5177;&#x4F53;&#x7528;&#x6CD5;&#x4E0A;&#x7565;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x5982;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5E95;&#x3002;</font><br>&#x2003;&#x2003;&#x4EE5;&#x4E0A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x56FE;&#x50CF;&#xFF08;&#x542B;0-1&#x635F;&#x5931;&#xFF09;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<div style="text-align:center;"><img src="/2018/03/31/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7CFB;&#x5217;&#x4E4B;&#x4E09;&#xFF1A;SVM5/&#x6307;&#x6570;&#x53CA;&#x5408;&#x9875;&#x635F;&#x5931;&#x7B49;&#x51FD;&#x6570;&#x7684;&#x56FE;&#x50CF;.png" width="430" height="250">&#x56FE;2-1&#x3000;&#x3000;&#x5408;&#x9875;&#x7B49;&#x635F;&#x5931;&#x51FD;&#x6570;&#x56FE;&#x5F62;<font color="red">(&#x56FE;&#x7247;&#x6458;&#x81EA;&#x5468;&#x5FD7;&#x534E;&#x300A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x300B;$P_{131}$)</font></div>

<h3 id="2-3-&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;"><a href="#2-3-&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;" class="headerlink" title="2.3 &#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;"></a>2.3 &#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;</h3><p>&#x2003;&#x2003;&#x5355;&#x7EAF;&#x4ECE;&#x6570;&#x5B66;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;SVM&#x4F18;&#x5316;&#x95EE;&#x9898;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x5408;&#x9875;&#x635F;&#x5931;&#x66F4;&#x9002;&#x5408;SVM&#x7684;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#xFF0C;&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<h4 id="2-3-1-&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4E0D;&#x8DB3;"><a href="#2-3-1-&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4E0D;&#x8DB3;" class="headerlink" title="2.3.1 &#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4E0D;&#x8DB3;"></a>2.3.1 &#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4E0D;&#x8DB3;</h4><p>&#x2003;&#x2003;&#x5F53;&#x6837;&#x672C;&#x88AB;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x4E14;&#x8BE5;&#x6837;&#x672C;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x95F4;&#x9694;&#x4E0D;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8981;&#x6C42;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6709;$0 &lt; y_i(\vec w \cdot \vec x_i + b) &lt; 1$&#x3002;&#x5BF9;&#x4E8E;&#x8BE5;&#x7C7B;&#x6837;&#x672C;&#xFF0C;&#x5982;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x6240;&#x8FF0;&#xFF0C;&#x867D;&#x7136;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x4E00;&#x4E2A;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#xFF0C;&#x4E5F;&#x5373;&#x5F53;$1 - y_i(\vec w \cdot \vec x_i + b) &gt; 0$&#x65F6;&#xFF0C;$L(Y, \ f(X)) &gt; 0$&#x3002;</p>
<h4 id="2-3-2-&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x6EE1;&#x8DB3;"><a href="#2-3-2-&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x6EE1;&#x8DB3;" class="headerlink" title="2.3.2 &#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x6EE1;&#x8DB3;"></a>2.3.2 &#x6B63;&#x786E;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x6EE1;&#x8DB3;</h4><p>&#x2003;&#x2003;&#x5F53;&#x6837;&#x672C;&#x88AB;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x4E14;&#x8BE5;&#x6837;&#x672C;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x95F4;&#x9694;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8981;&#x6C42;&#xFF08;&#x2265;1&#xFF09;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6709;$1 \leq y_i(\vec w \cdot \vec x_i + b) $&#x3002;&#x5BF9;&#x4E8E;&#x8BE5;&#x7C7B;&#x6837;&#x672C;&#xFF0C;&#x5982;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x6240;&#x8FF0;&#xFF0C;&#x56E0;&#x4E3A;&#x5929;&#x7136;&#x6EE1;&#x8DB3;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x9700;&#x652F;&#x4ED8;&#x4EFB;&#x4F55;&#x4EE3;&#x4EF7;&#xFF0C;&#x4E5F;&#x5373;&#x5F53;$1 - y_i(\vec w \cdot \vec x_i + b) \leq 0$&#x65F6;&#xFF0C;$L(Y, \ f(X)) = 0$&#x3002;</p>
<h4 id="2-3-3-&#x8BEF;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4EFB;&#x610F;"><a href="#2-3-3-&#x8BEF;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4EFB;&#x610F;" class="headerlink" title="2.3.3 &#x8BEF;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4EFB;&#x610F;"></a>2.3.3 &#x8BEF;&#x5206;&#x7C7B;&#x95F4;&#x9694;&#x4EFB;&#x610F;</h4><p>&#x2003;&#x2003;&#x5F53;&#x6837;&#x672C;&#x88AB;&#x8BEF;&#x5206;&#x7C7B;&#x4E14;&#x8BE5;&#x6837;&#x672C;&#x5230;&#x5206;&#x5272;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x95F4;&#x9694;&#x4E3A;&#x4EFB;&#x610F;&#x6761;&#x4EF6;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6709;$0 &lt; |y_i(\vec w \cdot \vec x_i + b)| &#x53CA; y_i(\vec w \cdot \vec x_i + b) &lt; 0$&#x3002;&#x5BF9;&#x4E8E;&#x8BE5;&#x7C7B;&#x6837;&#x672C;&#xFF0C;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x4E00;&#x4E2A;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x60E9;&#x7F5A;&#x53C2;&#x6570;C&#x5BF9;&#x8BE5;&#x7C7B;&#x884C;&#x4E3A;&#x7684;&#x60E9;&#x7F5A;&#x529B;&#x5EA6;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x4E5F;&#x5373;&#x5F53;$1 - y_i(\vec w \cdot \vec x_i + b) &gt; 1$&#x65F6;&#xFF0C;$L(Y, \ f(X)) &gt; 0$&#x3002;<br>&#x2003;&#x2003;&#x7EFC;&#x5408;&#x4E0A;&#x8FF0;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x518D;&#x7531;&#x56FE;&#xFF08;2-1&#xFF09;&#x53EF;&#x77E5;&#xFF0C;&#x51E0;&#x79CD;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;Hinge&#x51FD;&#x6570;&#x66F4;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x7ED8;&#x5236;&#x51FA;Hinge-Loss&#x51FD;&#x6570;&#x7684;&#x56FE;&#x50CF;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<div style="text-align:center;"><img src="/2018/03/31/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7CFB;&#x5217;&#x4E4B;&#x4E09;&#xFF1A;SVM5/Hinge-Loss&#x51FD;&#x6570;&#x56FE;&#x50CF;.png" width="400" height="300">&#x56FE;2-2&#x3000;&#x3000;SVM&#x635F;&#x5931;&#x51FD;&#x6570;&#x793A;&#x610F;&#x56FE;</div>

<p>&#x2003;&#x2003;&#x5373;&#x6211;&#x4EEC;&#x7406;&#x60F3;&#x7684;SVM&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;Hinge-Loss&#x51FD;&#x6570;&#x3002;</p>
<h4 id="2-3-4-SVM&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;"><a href="#2-3-4-SVM&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;" class="headerlink" title="2.3.4 SVM&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;"></a>2.3.4 SVM&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;</h4><p>&#x2003;&#x2003;&#x7EFC;&#x5408;&#x4E0A;&#x8FF0;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x5F97;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;SVM&#x7684;&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<p>$$<br>L_{hinge}[Y, \ f(X)] =<br>\begin{split}<br>\begin{cases}<br>1 - y_i(\vec w \cdot \vec x_i + b), \ &amp;y_i(\vec w \cdot \vec x_i + b) &lt; 1\\\\<br>0, \ &amp;y_i(\vec w \cdot \vec x_i + b) \geq 1<br>\end{cases}<br>\end{split}<br>\tag{2 - 5}<br>$$</p>
<p>&#x2003;&#x2003;&#x4E3A;&#x4E86;&#x53D9;&#x8FF0;&#x65B9;&#x4FBF;&#xFF0C;&#x6211;&#x4EEC;&#x8BB0;&#x4E0A;&#x8FF0;Hinge&#x51FD;&#x6570;&#x4E3A;$[1 - y_i(\vec w \cdot \vec x_i + b)]_{hinge}$&#x3002;<br>&#x2003;&#x2003;&#x4ECE;&#x4E0A;&#x8FF0;&#x51FD;&#x6570;&#x7684;&#x6027;&#x8D28;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0D;&#x4EC5;&#x4EC5;&#x8981;&#x6C42;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#xFF0C;&#x8FD8;&#x5FC5;&#x987B;&#x8981;&#x786E;&#x4FDD;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x95F4;&#x9694;&#xFF0C;&#x5176;&#x635F;&#x5931;&#x624D;&#x4E0D;&#x4F1A;&#x4E3A;0&#x3002;&#x76F8;&#x6BD4;&#x4E8E;0-1&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;<strong>&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5BF9;&#x5B66;&#x4E60;&#x66F4;&#x4E3A;&#x4E25;&#x683C;&#x3002;</strong></p>
<h4 id="2-3-5-&#x539F;&#x59CB;&#x95EE;&#x9898;&#x7684;Hinge&#x635F;&#x5931;&#x8868;&#x793A;"><a href="#2-3-5-&#x539F;&#x59CB;&#x95EE;&#x9898;&#x7684;Hinge&#x635F;&#x5931;&#x8868;&#x793A;" class="headerlink" title="2.3.5 &#x539F;&#x59CB;&#x95EE;&#x9898;&#x7684;Hinge&#x635F;&#x5931;&#x8868;&#x793A;"></a>2.3.5 &#x539F;&#x59CB;&#x95EE;&#x9898;&#x7684;Hinge&#x635F;&#x5931;&#x8868;&#x793A;</h4><p>&#x2003;&#x2003;&#x5BF9;&#x6BD4;&#x5F0F;&#xFF08;2-1&#xFF09;&#x3001;&#xFF08;2-2&#xFF09;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x5F0F;&#xFF08;2-5&#xFF09;&#x53EF;&#x77E5;&#x4E24;&#x4E2A;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x8981;&#x7B49;&#x4EF7;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x5982;&#x4E0B;&#x6761;&#x4EF6;&#xFF1A;</p>
<p>$$<br>\begin{split}<br>\begin{cases}<br>C = \frac{1}{N} \\\\<br>\lambda = 1 \\\\<br>\xi_i = [1 - y_i(\vec w \cdot \vec x_i + b)]_{hinge}<br>\end{cases}<br>\end{split}<br>\tag{2 - 6}<br>$$</p>
<p>&#x2003;&#x2003;&#x5219;&#x7EBF;&#x6027;&#x975E;&#x53EF;&#x5206;SVM&#x7684;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x53EF;&#x8868;&#x793A;&#x4E3A;&#x5982;&#x4E0B;&#x7684;&#x7B49;&#x4EF7;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF1A;</p>
<p>$$<br>\min \limits_{\vec w, b} \frac{1}{N} \sum_{i=1}^N [1 - y_i(\vec w \cdot \vec x_i + b)]_{hinge} + \frac{\lambda}{2} ||\vec w||^2<br>\tag{2 - 7}<br>$$</p>
<p>&#x2003;&#x2003;&#x4E0A;&#x5F0F;&#x76F8;&#x8F83;&#x4E8E;&#x5F0F;&#xFF08;2-1&#xFF09;&#xFF0C;&#x5C11;&#x4E86;&#x677E;&#x5F1B;&#x4EE3;&#x4EF7;$\xi_i$&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x3001;&#x5B9A;&#x91CF;&#x7684;&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x4E3A;&#x6700;&#x4F18;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x63D0;&#x4F9B;&#x4E86;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x3002;</p>
<h3 id="2-4-&#x5408;&#x9875;&#x4E4B;&#x540D;"><a href="#2-4-&#x5408;&#x9875;&#x4E4B;&#x540D;" class="headerlink" title="2.4 &#x5408;&#x9875;&#x4E4B;&#x540D;"></a>2.4 &#x5408;&#x9875;&#x4E4B;&#x540D;</h3><p>&#x2003;&#x2003;<a href="https://en.wikipedia.org/wiki/Hinge_loss" target="_blank" rel="noopener">&#x5408;&#x9875;&#x635F;&#x5931;&#x51FD;&#x6570;</a>&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x542C;&#x8D77;&#x6765;&#x602A;&#x602A;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x6811;&#x4E0A;&#x8BF4;&#x660E;&#x4E86;&#x5176;&#x540D;&#x79F0;&#x6765;&#x6E90;&#x662F;&#x56E0;&#x4E3A;&#x5176;&#x51FD;&#x6570;&#x56FE;&#x50CF;&#x795E;&#x4F3C;&#x6211;&#x4EEC;&#x5E73;&#x5E38;&#x95E8;&#x3001;&#x7A97;&#x3001;&#x8863;&#x67DC;&#x7B49;&#x7B49;&#x4E0A;&#x9762;&#x7528;&#x5230;&#x7684;&#x5408;&#x9875;&#xFF0C;&#x4F46;&#x662F;&#x6055;&#x6211;&#x773C;&#x62D9;&#xFF0C;&#x771F;&#x6CA1;&#x770B;&#x51FA;&#x6765;&#x54EA;&#x91CC;&#x50CF;^&#x2013;^&#x3002;</p>
</div><div class="tags"><a href="/tags/算法/">算法</a><a href="/tags/机器学习/">机器学习</a><a href="/tags/SVM/">SVM</a><a href="/tags/支持向量机/">支持向量机</a></div><div class="post-share"><div class="bdsharebuttonbox"><span style="float:left;line-height: 28px;height: 28px;font-size:16px;font-weight:blod">分享到：</span><a href="#" data-cmd="more" class="bds_more"></a><a href="#" data-cmd="mshare" title="分享到一键分享" class="bds_mshare"></a><a href="#" data-cmd="fbook" title="分享到Facebook" class="bds_fbook"></a><a href="#" data-cmd="twi" title="分享到Twitter" class="bds_twi"></a><a href="#" data-cmd="linkedin" title="分享到linkedin" class="bds_linkedin"></a><a href="#" data-cmd="youdao" title="分享到有道云笔记" class="bds_youdao"></a><a href="#" data-cmd="evernotecn" title="分享到印象笔记" class="bds_evernotecn"></a><a href="#" data-cmd="weixin" title="分享到微信" class="bds_weixin"></a><a href="#" data-cmd="qzone" title="分享到QQ空间" class="bds_qzone"></a><a href="#" data-cmd="tsina" title="分享到新浪微博" class="bds_tsina"></a></div></div><div class="post-nav"><a href="/2018/04/19/模运算中为何要用素数作为模/" class="pre"> 模运算中为何要用素数作为模</a><a href="/2018/02/16/深度学习：目标检测之一（基础篇）/" class="next">深度学习：目标检测之一（基础篇）</a></div><!--新增打赏功能在正文底部--><div class="page-reward"><a id="a_label" class="page-reward-btn tooltip-top"><div id="reward_guide" class="tooltip tooltip-east"><span id="btn_guide" href="javascript:;" class="tooltip-item">打赏</span></div><script type="text/javascript">document.getElementById("btn_guide").onclick = function(){
    document.getElementById("reward_guide").setAttribute("style", "display:none");
    document.getElementById("a_label").setAttribute("style", "display:none");
    document.getElementById("img_guide").setAttribute("style", "display:block");
}</script></a><div id="img_guide" style="display:none" class="tooltip reward-box"><table><tr><td><img src="https://flat2010.github.io/about/weixin_qrcode.jpg" style="text-align:center;float:center" class="reward-img"></td><td></td></tr></table></div><script type="text/javascript">document.getElementById("img_guide").onclick = function(){
    document.getElementById("reward_guide").setAttribute("style", "display:inline-block");
    document.getElementById("a_label").setAttribute("style", "display:inline-block");
    document.getElementById("img_guide").setAttribute("style", "display:none");
}</script></div><!--end--><div id="comments"><div id="disqus_thread"></div></div></div></div></div><div class="layout-r"><div id="sidebar"><div class="search-pla"></div><div id="toc" class="widget"><div class="widget-title"><i class="fa fa-fei">文章目录</i></div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#一、线性非可分"><span class="toc-text">一、线性非可分</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#1-1-可分-VS-非可分"><span class="toc-text">1.1 可分 VS 非可分</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#1-1-1-相同点"><span class="toc-text">1.1.1 相同点</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-1-2-不同点"><span class="toc-text">1.1.2 不同点</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#1-2-解决之道"><span class="toc-text">1.2 解决之道</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#1-2-1-松弛变量"><span class="toc-text">1.2.1 松弛变量</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-2-2-惩罚参数"><span class="toc-text">1.2.2 惩罚参数</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-2-3-求解目标"><span class="toc-text">1.2.3 求解目标</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-2-4-软间隔"><span class="toc-text">1.2.4 软间隔</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#1-3-求证之路"><span class="toc-text">1.3 求证之路</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#1-3-1-存在性证明"><span class="toc-text">1.3.1 存在性证明</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-3-2-唯一性证明"><span class="toc-text">1.3.2 唯一性证明</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-3-3-求解思路"><span class="toc-text">1.3.3 求解思路</span></a><ol class="toc-child"><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-1-广义拉格朗日函数"><span class="toc-text">1.3.3.1 广义拉格朗日函数</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-2-对偶问题"><span class="toc-text">1.3.3.2 对偶问题</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-3-极小值"><span class="toc-text">1.3.3.3 极小值</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-4-极大值"><span class="toc-text">1.3.3.4 极大值</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-5-vec-w-求解"><span class="toc-text">1.3.3.5 $\vec w^*$求解</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-6-vec-beta-i-求解"><span class="toc-text">1.3.3.6 $\vec \beta_i^*$求解</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-7-xi-i-求解"><span class="toc-text">1.3.3.7 $\xi_i^*$求解</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-3-3-8-b-求解"><span class="toc-text">1.3.3.8 $b^*$求解</span></a></li></ol></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-3-4-再谈-vec-w"><span class="toc-text">1.3.4 再谈$\vec w^*$</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#1-4-支持向量"><span class="toc-text">1.4 支持向量</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#1-4-1-软间隔支持向量"><span class="toc-text">1.4.1 软间隔支持向量</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-4-2-距离-VS-几何间隔"><span class="toc-text">1.4.2 距离 VS 几何间隔</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-4-3-支持向量类型"><span class="toc-text">1.4.3 支持向量类型</span></a><ol class="toc-child"><li class="toc-item toc-level-5"><a class="toc-link" href="#1-4-3-1-位于间隔边界"><span class="toc-text">1.4.3.1 位于间隔边界</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-4-3-2-位于本类缓冲区"><span class="toc-text">1.4.3.2 位于本类缓冲区</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-4-3-3-位于另类缓冲区"><span class="toc-text">1.4.3.3 位于另类缓冲区</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#1-4-3-4-位于另类族群"><span class="toc-text">1.4.3.4 位于另类族群</span></a></li></ol></li></ol></li></ol></li><li class="toc-item toc-level-2"><a class="toc-link" href="#二、合页损失"><span class="toc-text">二、合页损失</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#2-1-再论原始优化问题"><span class="toc-text">2.1 再论原始优化问题</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#2-2-再谈损失函数"><span class="toc-text">2.2 再谈损失函数</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#2-3-合页损失函数"><span class="toc-text">2.3 合页损失函数</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#2-3-1-正确分类间隔不足"><span class="toc-text">2.3.1 正确分类间隔不足</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-3-2-正确分类间隔满足"><span class="toc-text">2.3.2 正确分类间隔满足</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-3-3-误分类间隔任意"><span class="toc-text">2.3.3 误分类间隔任意</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-3-4-SVM合页损失函数"><span class="toc-text">2.3.4 SVM合页损失函数</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-3-5-原始问题的Hinge损失表示"><span class="toc-text">2.3.5 原始问题的Hinge损失表示</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#2-4-合页之名"><span class="toc-text">2.4 合页之名</span></a></li></ol></li></ol></div><div class="widget"><div class="widget-title"><i class="fa fa-xie"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2018/06/30/病态问题及条件数/">病态问题及条件数</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/06/24/hello-world/">Hello World</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/06/15/手算CNN中的参数/">CNN中的参数解释及计算</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/04/23/字符串匹配算法系列之一：BF-KMP/">字符串匹配算法系列之一：BF && KMP</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/04/21/机器学习算法系列之三：SVM6/">机器学习算法系列之三：SVM6</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/04/19/模运算中为何要用素数作为模/"> 模运算中为何要用素数作为模</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/03/31/机器学习算法系列之三：SVM5/">机器学习算法系列之三：SVM（5）</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/02/16/深度学习：目标检测之一（基础篇）/">深度学习：目标检测之一（基础篇）</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/12/17/Ubuntu各发行版详情/">Ubuntu各发行版详情</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/08/12/Docker上部署Hadoop等完全分布式集群/">Docker上部署Hadoop等完全分布式集群</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-gui"> 分类</i><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Docker/">Docker</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/个人博客/">个人博客</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/字符串匹配/">字符串匹配</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/安装配置教程/">安装配置教程</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/数学理论/">数学理论</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/日常技巧总结/">日常技巧总结</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/机器学习/">机器学习</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/深度学习/">深度学习</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程笔记/">编程笔记</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/读书笔记/">读书笔记</a><span class="category-list-count">5</span></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-biao"> 标签</i></div><div class="tagcloud"><a href="/tags/李航/" style="font-size: 12px; color: #00f">李航</a> <a href="/tags/Netfilter/" style="font-size: 12px; color: #00f">Netfilter</a> <a href="/tags/Linux/" style="font-size: 14.6px; color: #30f">Linux</a> <a href="/tags/Python/" style="font-size: 17.2px; color: #60f">Python</a> <a href="/tags/Docker/" style="font-size: 12px; color: #00f">Docker</a> <a href="/tags/Hadoop/" style="font-size: 12px; color: #00f">Hadoop</a> <a href="/tags/Spark/" style="font-size: 12px; color: #00f">Spark</a> <a href="/tags/分布式/" style="font-size: 12px; color: #00f">分布式</a> <a href="/tags/Numpy/" style="font-size: 12px; color: #00f">Numpy</a> <a href="/tags/3D图形/" style="font-size: 12px; color: #00f">3D图形</a> <a href="/tags/算法/" style="font-size: 25px; color: #f0f">算法</a> <a href="/tags/Pcapy/" style="font-size: 12px; color: #00f">Pcapy</a> <a href="/tags/Wireshark/" style="font-size: 12px; color: #00f">Wireshark</a> <a href="/tags/HTTP/" style="font-size: 12px; color: #00f">HTTP</a> <a href="/tags/Ubuntu/" style="font-size: 14.6px; color: #30f">Ubuntu</a> <a href="/tags/Oracle/" style="font-size: 12px; color: #00f">Oracle</a> <a href="/tags/数据库/" style="font-size: 12px; color: #00f">数据库</a> <a href="/tags/Hexo/" style="font-size: 12px; color: #00f">Hexo</a> <a href="/tags/个人博客/" style="font-size: 12px; color: #00f">个人博客</a> <a href="/tags/卷积/" style="font-size: 12px; color: #00f">卷积</a> <a href="/tags/池化/" style="font-size: 12px; color: #00f">池化</a> <a href="/tags/统计学习/" style="font-size: 12px; color: #00f">统计学习</a> <a href="/tags/Iptables/" style="font-size: 12px; color: #00f">Iptables</a> <a href="/tags/字符串匹配/" style="font-size: 12px; color: #00f">字符串匹配</a> <a href="/tags/数据挖掘/" style="font-size: 12px; color: #00f">数据挖掘</a> <a href="/tags/DataMine/" style="font-size: 12px; color: #00f">DataMine</a> <a href="/tags/JiaWei-Han/" style="font-size: 12px; color: #00f">JiaWei Han</a> <a href="/tags/机器学习/" style="font-size: 22.4px; color: #c0f">机器学习</a> <a href="/tags/SVM/" style="font-size: 19.8px; color: #90f">SVM</a> <a href="/tags/支持向量机/" style="font-size: 19.8px; color: #90f">支持向量机</a> <a href="/tags/拉格朗日/" style="font-size: 12px; color: #00f">拉格朗日</a> <a href="/tags/对偶问题/" style="font-size: 12px; color: #00f">对偶问题</a> <a href="/tags/数学概念/" style="font-size: 12px; color: #00f">数学概念</a> <a href="/tags/数学定义/" style="font-size: 12px; color: #00f">数学定义</a> <a href="/tags/回调函数/" style="font-size: 12px; color: #00f">回调函数</a> <a href="/tags/深度学习/" style="font-size: 12px; color: #00f">深度学习</a> <a href="/tags/目标检测/" style="font-size: 12px; color: #00f">目标检测</a> <a href="/tags/Hash/" style="font-size: 12px; color: #00f">Hash</a> <a href="/tags/模运算/" style="font-size: 12px; color: #00f">模运算</a> <a href="/tags/病态/" style="font-size: 12px; color: #00f">病态</a> <a href="/tags/条件数/" style="font-size: 12px; color: #00f">条件数</a> <a href="/tags/特征值/" style="font-size: 12px; color: #00f">特征值</a> <a href="/tags/特征向量/" style="font-size: 12px; color: #00f">特征向量</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-archive"> 时间线</i></div><ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/06/">2018年06月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/04/">2018年04月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/03/">2018年03月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/02/">2018年02月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/12/">2017年12月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/08/">2017年08月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/07/">2017年07月</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/05/">2017年05月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/04/">2017年04月</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017年02月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017年01月</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016年12月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016年11月</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016年08月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06/">2014年06月</a><span class="archive-list-count">1</span></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-github"> Github</i></div><ul></ul><a href="https://github.com/flat2010" title="flat2010" target="_blank">flat2010</a><iframe width="100%" height="400" frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&amp;width=0&amp;height=550&amp;fansRow=2&amp;ptype=1&amp;speed=0&amp;skin=5&amp;isTitle=0&amp;noborder=0&amp;isWeibo=1&amp;isFans=0&amp;uid=1700139362&amp;verifier=85be6061&amp;colors=ffffff,ffffff,333333,40759b,ecfbfd&amp;dpc=1" class="share_self"></iframe></div></div></div></div><a id="totop" href="#top"></a><div id="footer"><div class="footer-info"><p><a href="/baidusitemap.xml">baidusitemap</a> |  <a href="/atom.xml">订阅</a> |  <a href="/about/">关于</a></p><p>本站访客总数：<i id="busuanzi_container_site_uv"><i id="busuanzi_value_site_uv"></i></i>次</p><p>文章总阅读次数：<i id="busuanzi_container_site_pv"><i id="busuanzi_value_site_pv"></i></i>次</p><p><span> Copyright &copy;<a href="/." rel="nofollow">Jineney.</a></span><span> Theme by<a rel="nofollow" target="_blank" href="https://github.com/flat2010/Molin"> Molin.</a></span><span> Count by<a href="http://busuanzi.ibruce.info/"> busuanzi.</a></span><span> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a></span></p></div></div></div><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><script type="text/javascript" src="/js/search.json.js?v=2.0.1"></script><script type="text/javascript" src="/js/toctotop.js?v=2.0.1" async></script><script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"2","bdMiniList":["mshare","weixin","tsina","qzone","linkedin","fbook","twi","print","renren","sqq","evernotecn","bdysc","tqq","tqf","bdxc","kaixin001","tieba","douban","bdhome","thx","ibaidu","meilishuo","mogujie","diandian","huaban","duitang","hx","fx","youdao","sdo","qingbiji","people","xinhua","mail","isohu","yaolan","wealink","ty","iguba","h163","copy"],"bdPic":"","bdStyle":"1","bdSize":"16"},"share":{},"image":{"viewList":["tsina","qzone","weixin","fbook","twi","linkedin","youdao","evernotecn","mshare"],"viewText":"分享到：","viewSize":"16"},"selectShare":{"bdContainerClass":null,"bdSelectMiniList":["tsina","qzone","weixin","fbook","twi","linkedin","youdao","evernotecn","mshare"]}};with(document)0[(getElementsByTagName('head')[0]||head).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];
</script><script>var disqus_shortname = 'flat2010';
var disqus_identifier = '2018/03/31/机器学习算法系列之三：SVM5/';
var disqus_title = '机器学习算法系列之三：SVM（5）';
var disqus_url = 'https://flat2010.github.io/2018/03/31/机器学习算法系列之三：SVM5/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//flat2010.disqus.com/count.js" async></script><script type="text/javascript" src="//flat2010.disqus.com/recent_comments_widget.js?num_items=5&amp;hide_avatars=1&amp;avatar_size=32&amp;excerpt_length=20&amp;hide_mods=1"></script></body></html><!--为主题添加mathjax支持--><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-MML-AM_CHTML" async></script><script type="text/x-mathjax-config">MathJax.Hub.Config({"HTML-CSS": { preferredFont: "TeX", availableFonts: ["STIX","TeX"], linebreaks: { automatic:true }, EqnChunk: (MathJax.Hub.Browser.isMobile ? 10 : 50) },
tex2jax: { inlineMath: [ ["$", "$"], ["\\\(","\\)"] ], processEscapes: true, ignoreClass: "tex2jax_ignore|dno",skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']},
TeX: { noUndefined: { attributes: { mathcolor: "red", mathbackground: "#FFEEEE", mathsize: "90%" } }, Macros: { href: "{}" } },
messageStyle: "none"
});</script>