<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description" content="Just a hobby, won't be big and professional like Linux."><title>特征值和特征向量内幕详解 | 断鸿声里，立尽斜阳</title><!-- 之前的google字体加载缓慢，换成本地加载--><!--link(rel="stylesheet", type="text/css", href="//fonts.css.network/css?family=Source+Code+Pro")--><link rel="stylesheet" href="https://flat2010.github.io/static/vendor/fonts/fonts.css"><link rel="stylesheet" type="text/css" href="/css/style.css?v=2.0.1"><link rel="stylesheet" type="text/css" href="/css/highlight.css?v=2.0.1"><link rel="Shortcut Icon" href="/favicon.ico"><link rel="bookmark" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><!--添加打赏连接--><!--link(rel='stylesheet', type='text/css', href=url_for(theme.css) + '/reward.scss')--><!--link(rel='stylesheet', type='text/x-scss', href=url_for(theme.css) + '/tooltip.css')--><!--end--><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">特征值和特征向量内幕详解</h1><a id="logo" href="/.">断鸿声里，立尽斜阳</a><p class="description">流萤弄月照玉窗，一纸红笺话思量</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 时间线</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div><div id="search-form"><div id="result-mask" class="hide"></div><label><input id="search-key" type="text" autocomplete="off" placeholder="search"></label><div id="result-wrap" class="hide"><div id="search-result"></div></div><div class="hide"><template id="search-tpl"><div class="item"><a href="/{path}" title="{title}"><div class="title">{title}</div><div class="time">{date}</div><div class="tags">{tags}</div></a></div></template></div></div></div><div id="layout" class="layout-g"><div class="layout-l"><div class="content_container"><div class="post"><h1 class="post-title">特征值和特征向量内幕详解</h1><div class="post-meta"><a href="/2017/04/03/特征值和特征向量内幕详解/#comments" class="comment-count"><i data-disqus-identifier="2017/04/03/特征值和特征向量内幕详解/" class="disqus-comment-count"></i>留言</a><p><span class="date">Apr 03, 2017</span><span><a href="/categories/数学理论/" class="category">数学理论</a></span><span><i id="busuanzi_container_page_pv"><i id="busuanzi_value_page_pv"></i><i>阅读</i></i></span><!-- 增加文章字数统计 Node-7.6.0+ 'npm i --save hexo-wordcount' or Node-7.6.0- 'npm install hexo-wordcount@2 --save'--><span><i id="word_count"></i><i>7,174 字</i></span><span><i id="read_time"></i><i>28 分钟</i></span></p></div><!-- 正文内容        --><div class="post-content"><p><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x9996;&#x56FE;.jpg" alt="image"></p>
<blockquote>
<font color="#0000FF" face="&#x5FAE;&#x8F6F;&#x96C5;&#x9ED1;" size="4">All in matrix.</font>

</blockquote>
<h3 id="1-&#x6982;&#x8FF0;"><a href="#1-&#x6982;&#x8FF0;" class="headerlink" title="1. &#x6982;&#x8FF0;"></a>1. &#x6982;&#x8FF0;</h3><p>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x5230;&#x4E86;PCA&#xFF0C;&#x5E76;&#x4E14;&#x60F3;&#x57FA;&#x4E8E;PCA&#x505A;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x5C1D;&#x8BD5;&#x3002;PCA&#x53EF;&#x4EE5;&#x7528;&#x6765;<strong>&#x964D;&#x7EF4;</strong>&#xFF0C;&#x8FD9;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x719F;&#x77E5;&#x7684;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x89C9;&#x5F97;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x968F;&#x7740;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5BF9;&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x7684;&#x7406;&#x89E3;&#x539F;&#x6765;&#x4E00;&#x76F4;&#x5F88;&#x80A4;&#x6D45;&#xFF0C;&#x5E94;&#x8BE5;&#x8BF4;&#x6211;&#xFF08;&#x5176;&#x5B9E;&#x591A;&#x6570;&#x4ECE;&#x5927;&#x5B66;&#x91CF;&#x4EA7;&#x51FA;&#x6765;&#x7684;&#x5B66;&#x751F;&#x90FD;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF09;&#x53EA;&#x662F;&#x5B66;&#x4F1A;&#x4E86;&#x600E;&#x4E48;&#x73A9;&#x5F04;&#x6570;&#x5B57;&#xFF08;<strong>&#x8BB0;&#x4F4F;&#x4E86;&#x516C;&#x5F0F;</strong>&#xFF09;&#xFF0C;&#x5374;&#x6CA1;&#x80FD;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x53BB;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x5BF9;&#x4E8E;&#x7406;&#x5DE5;&#x79D1;&#x5B66;&#x751F;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FDE;&#x6700;&#x8D77;&#x7801;&#x7684;&#x4E25;&#x8C28;&#x3001;&#x6C42;&#x5B9E;&#x3001;&#x8D28;&#x7591;&#x7684;&#x7CBE;&#x795E;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x6050;&#x6015;&#x6709;&#x70B9;&#x8D3B;&#x7B11;&#x5927;&#x65B9;&#x3002;<br>&#x2003;&#x2003;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x5C31;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x9505;&#x771F;&#x7684;&#x5C31;&#x8BE5;&#x5B66;&#x751F;&#x6765;&#x80CC;&#x5417;&#xFF1F;<br>&#x2003;&#x2003;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x9505;&#x5E94;&#x8BE5;&#x7529;&#x7ED9;&#x9AD8;&#x6821;&#xFF0C;&#x56FD;&#x5185;&#x9AD8;&#x7B49;&#x6559;&#x80B2;&#x7684;&#x53E4;&#x677F;&#x4E0E;&#x50F5;&#x5316;&#x662F;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#x3002;&#x5728;&#x6211;&#x7684;&#x8BB0;&#x5FC6;&#x529B;&#xFF0C;&#x80FD;&#x591F;&#x628A;&#x4E66;&#x672C;&#x4E0A;&#x7684;&#x5927;&#x90E8;&#x5206;&#x516C;&#x5F0F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x7167;&#x672C;&#x5BA3;&#x79D1;&#xFF09;&#x5B8C;&#x6574;&#x7684;&#x8BC1;&#x660E;&#x548C;&#x677F;&#x4E66;&#x4E00;&#x904D;&#x7684;&#x8001;&#x5E08;&#xFF0C;&#x5DF2;&#x7ECF;&#x7B97;&#x662F;&#x53EF;&#x9047;&#x800C;&#x4E0D;&#x53EF;&#x6C42;&#x4E86;&#x3002;<br><a id="more"></a><br>&#x2003;&#x2003;&#x672C;&#x6587;&#x7684;&#x4E3B;&#x65E8;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x4E3A;&#x5F62;&#x8C61;&#xFF08;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#xFF09;&#x7684;&#x53BB;&#x89E3;&#x8BFB;&#x7279;&#x5F81;&#x503C;<strong>&#xFF08;eigenvalue&#xFF09;</strong>&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;<strong>&#xFF08;eigenvector&#xFF09;</strong>&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x4F1A;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x5F00;&#x59CB;&#x626F;&#x8FD9;&#x4E24;&#x4E2A;&#x4E1C;&#x4E1C;&#xFF0C;&#x5148;&#x4ECE;&#x4E00;&#x4E9B;&#x8F83;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x6982;&#x5FF5;&#x6252;&#x8D77;&#xFF0C;&#x529B;&#x6C42;&#x505A;&#x5230;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#x3002;<br>&#x2003;&#x2003;&#x5728;&#x672C;&#x6587;&#x5199;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x4E5F;&#x5728;&#x7F51;&#x4E0A;&#x641C;&#x7D22;&#x8FC7;&#x5927;&#x91CF;&#x7684;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF08;&#x5305;&#x62EC;&#x7FA4;&#x82F1;&#x835F;&#x8403;&#x7684;<strong>&#x77E5;&#x4E4E;</strong>&#xFF09;&#xFF0C;&#x7136;&#x800C;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x7BC7;&#x771F;&#x6B63;&#x4ECE;&#x6E90;&#x5934;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x8BED;&#x7684;&#x6587;&#x7AE0;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x592A;&#x8FC7;&#x57FA;&#x7840;&#xFF0C;&#x5927;&#x795E;&#x4EEC;&#x90FD;&#x4E0D;&#x592A;&#x60F3;&#x8BB2;&#xFF09;&#x3002;<br>&#x2003;&#x2003;&#x672C;&#x6587;&#x529B;&#x56FE;&#x8BA9;&#x975E;&#x6570;&#x5B66;&#x4E13;&#x4E1A;&#x7684;&#x540C;&#x5B66;&#x4E5F;&#x80FD;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7684;&#x7406;&#x89E3;&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x3002;<strong>&#x6587;&#x7AE0;&#x6709;&#x70B9;&#x957F;&#xFF08;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x8FDC;&#x975E;&#x4E09;&#x8A00;&#x4E24;&#x8BED;&#x80FD;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#x7684;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x8010;&#x5FC3;&#x7684;&#x770B;&#x5B8C;&#xFF0C;&#x76F8;&#x4FE1;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x6240;&#x6536;&#x83B7;&#x3002;</strong><br>&#x2003;&#x2003;OK&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4ECE;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6982;&#x5FF5;&#x5F00;&#x59CB;&#x3002;</p>
<h3 id="2-&#x57FA;&#x7840;&#x6982;&#x5FF5;"><a href="#2-&#x57FA;&#x7840;&#x6982;&#x5FF5;" class="headerlink" title="2. &#x57FA;&#x7840;&#x6982;&#x5FF5;"></a>2. &#x57FA;&#x7840;&#x6982;&#x5FF5;</h3><h4 id="2-1-&#x5411;&#x91CF;"><a href="#2-1-&#x5411;&#x91CF;" class="headerlink" title="2.1 &#x5411;&#x91CF;"></a>2.1 &#x5411;&#x91CF;</h4><p>&#x2003;&#x2003;&#x63D0;&#x5230;&#x5411;&#x91CF;&#xFF0C;&#x6700;&#x65E9;&#x63A5;&#x89E6;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5E94;&#x8BE5;&#x662F;&#x5728;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x5B9A;&#x4E49;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x4E00;&#x6761;&#x6709;&#x8D77;&#x70B9;&#x3001;&#x6709;&#x7EC8;&#x70B9;&#x3001;&#x6709;&#x65B9;&#x5411;&#xFF08;&#x7BAD;&#x5934;&#x6307;&#x793A;&#xFF09;&#x7684;&#x7EBF;&#x6BB5;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;<br><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E2D;&#x7684;&#x5411;&#x91CF;.png" alt="image" title="&#x56FE;&#x5F62;&#x65CB;&#x8F6C;&#x793A;&#x610F;&#x56FE;"></p>
<div align="center">&#x56FE;2-1&#x3000;&#x3000;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E2D;&#x7684;&#x5411;&#x91CF;</div>

<p><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5411;&#x91CF;.png" alt="image" title="&#x56FE;&#x5F62;&#x65CB;&#x8F6C;&#x793A;&#x610F;&#x56FE;"></p>
<div align="center">&#x56FE;2-2&#x3000;&#x3000;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5411;&#x91CF;</div>  

<p>&#x2003;&#x2003;&#x662F;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x76F4;&#x767D;&#x3002;&#x4F3C;&#x4E4E;&#x9AD8;&#x4E2D;&#x90A3;&#x4F1A;&#x513F;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x633A;&#x7B80;&#x5355;&#x7684;&#x3002;&#x4E0A;&#x4E86;&#x5927;&#x5B66;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x5C31;&#x4E0D;&#x518D;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x5C31;&#x8FDE;&#x5411;&#x91CF;&#x4E5F;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x73A9;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5DE5;&#x79D1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x7406;&#x79D1;&#x7684;&#x6570;&#x5B66;&#x9886;&#x57DF;&#x505A;&#x4E86;&#x6982;&#x5FF5;&#x7684;&#x5EF6;&#x4F38;&#x548C;&#x6269;&#x5C55;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5206;&#x522B;&#x4ECE;&#x7269;&#x7406;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x3001;&#x6570;&#x5B66;&#x4E09;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x4ECB;&#x7ECD;&#x5411;&#x91CF;&#x3002;</p>
<h5 id="2-1-1-&#x7269;&#x7406;&#x5B66;&#x7684;&#x5411;&#x91CF;"><a href="#2-1-1-&#x7269;&#x7406;&#x5B66;&#x7684;&#x5411;&#x91CF;" class="headerlink" title="2.1.1 &#x7269;&#x7406;&#x5B66;&#x7684;&#x5411;&#x91CF;"></a>2.1.1 &#x7269;&#x7406;&#x5B66;&#x7684;&#x5411;&#x91CF;</h5><p>&#x2003;&#x2003;&#x7269;&#x7406;&#x5B66;&#x91CC;&#x9762;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x4E0D;&#x592A;&#x5173;&#x6CE8;&#x5B83;&#x7684;&#x8D77;&#x70B9;&#xFF0C;&#x66F4;&#x4FA7;&#x91CD;&#x4E8E;&#x5176;<strong>&#x65B9;&#x5411;&#x3001;&#x5927;&#x5C0F;&#xFF08;&#x7BAD;&#x5934;&#x957F;&#x5EA6;&#xFF09;</strong>&#x3002;&#x53EA;&#x8981;&#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x4E0D;&#x7BA1;&#x5982;&#x4F55;&#x79FB;&#x52A8;&#xFF0C;&#x6211;&#x4EEC;&#x59CB;&#x7EC8;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x5411;&#x91CF;&#x901A;&#x5E38;&#x662F;&#x6709;&#x7740;&#x975E;&#x5E38;&#x660E;&#x786E;&#x800C;&#x6E05;&#x6670;&#x7684;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x53D7;&#x5230;&#x7684;&#x6D1B;&#x4F26;&#x5179;&#x529B;&#xFF1A;<br><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x7684;&#x6D1B;&#x4F26;&#x5179;&#x529B;.jpg" alt="image"></p>
<div align="center">&#x56FE;2-3&#x3000;&#x3000;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x7684;&#x6D1B;&#x4F26;&#x5179;&#x529B;</div>  

<h5 id="2-1-2-&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x5411;&#x91CF;"><a href="#2-1-2-&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x5411;&#x91CF;" class="headerlink" title="2.1.2 &#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x5411;&#x91CF;"></a>2.1.2 &#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x5411;&#x91CF;</h5><p>&#x2003;&#x2003;&#x800C;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x6765;&#x8BF4;&#xFF0C;&#x5411;&#x91CF;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x7EC4;<strong>&#x6709;&#x5E8F;</strong>&#x7684;&#x6570;&#x5B57;&#x5217;&#x8868;&#xFF08;C/C++&#x4EE5;&#x53CA;Java&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#x3001;Python&#x4E2D;&#x7684;&#x5217;&#x8868;&#x7B49;&#xFF09;&#xFF0C; &#x6BD4;&#x5982;&#xFF1A;<br><figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment"># python tuple</span></span><br><span class="line">vector1 = (<span class="number">3</span>, <span class="number">5</span>, <span class="number">2</span>, <span class="number">9</span>, <span class="number">7</span>)</span><br><span class="line"><span class="comment"># python list</span></span><br><span class="line">vector2 = [<span class="number">2</span>, <span class="number">4</span>, <span class="number">0.6</span>, <span class="number">3</span>, <span class="number">1.3</span>]</span><br></pre></td></tr></table></figure></p>
<p>&#x2003;&#x2003;&#x7279;&#x522B;&#x662F;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x901A;&#x5E38;&#x5BF9;&#x5E94;&#x4E86;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x800C;&#x5411;&#x91CF;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x76F8;&#x5E94;&#x7684;&#x7279;&#x5F81;&#x5C5E;&#x6027;&#x7684;&#x53D6;&#x503C;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x5411;&#x91CF;&#x901A;&#x5E38;&#x5E76;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x3002;</p>
<h5 id="2-1-3-&#x6570;&#x5B66;&#x7684;&#x5411;&#x91CF;"><a href="#2-1-3-&#x6570;&#x5B66;&#x7684;&#x5411;&#x91CF;" class="headerlink" title="2.1.3 &#x6570;&#x5B66;&#x7684;&#x5411;&#x91CF;"></a>2.1.3 &#x6570;&#x5B66;&#x7684;&#x5411;&#x91CF;</h5><p>&#x2003;&#x2003;&#x6570;&#x5B66;&#x4E2D;&#x7684;&#x5411;&#x91CF;&#x5219;&#x662F;&#x517C;&#x5177;&#x4E86;&#x7269;&#x7406;&#x5B66;&#x7684;&#x6982;&#x5FF5;&#x6E05;&#x6670;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x901A;&#x7528;&#x6027;&#x4F18;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x5411;&#x91CF;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x8FD0;&#x7B97;&#x8FDB;&#x884C;&#x4E86;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x5B9A;&#x53CA;&#x6570;&#x5B66;&#x8BC1;&#x660E;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<br><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x6570;&#x5B66;&#x4E2D;&#x7684;&#x5411;&#x91CF;.png" alt="image"></p>
<div align="center">&#x56FE;2-4&#x3000;&#x3000;&#x6570;&#x5B66;&#x4E2D;&#x7684;&#x5411;&#x91CF;</div>  

<h5 id="2-1-4-&#x5411;&#x91CF;&#x7684;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;"><a href="#2-1-4-&#x5411;&#x91CF;&#x7684;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;" class="headerlink" title="2.1.4 &#x5411;&#x91CF;&#x7684;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;"></a>2.1.4 &#x5411;&#x91CF;&#x7684;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;</h5><p>&#x2003;&#x2003;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x5411;&#x91CF;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9886;&#x57DF;&#x5176;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;&#x4E5F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x751A;&#x81F3;&#x5927;&#x76F8;&#x5F84;&#x5EAD;&#xFF0C;&#x5728;&#x51E0;&#x4F55;&#x5B66;&#x4E2D;&#xFF0C;&#x5411;&#x91CF;&#x901A;&#x5E38;&#x7528;&#x4E00;&#x5BF9;&#x5706;&#x62EC;&#x53F7;&#x5305;&#x88F9;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x6A2A;&#x7740;&#x4E66;&#x5199;&#xFF0C;&#x5982;&#xFF1A;<br>$$<br>\vec w = (3, 2, 5)<br>\tag {&#x5411;&#x91CF;&#x7684;&#x51E0;&#x4F55;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;}<br>$$<br>&#x2003;&#x2003;&#x800C;&#x5411;&#x91CF;&#x5728;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x4E2D;&#x7684;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F0F;&#x5219;&#x4E3A;&#xFF1A;<br>$$\vec w =<br>\begin{bmatrix}<br>3\\\\<br>2\\\\<br>5<br>\end{bmatrix} &#x6216; \<br>\begin{bmatrix}<br>3\ \ 2\ \ 5<br>\end{bmatrix}^T<br>\tag {&#x5411;&#x91CF;&#x7684;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;}<br>$$</p>
<h5 id="2-1-5-&#x6CE8;&#x610F;"><a href="#2-1-5-&#x6CE8;&#x610F;" class="headerlink" title="2.1.5 &#x6CE8;&#x610F;"></a>2.1.5 &#x6CE8;&#x610F;</h5><p>&#x2003;&#x2003;&#x4E0A;&#x9762;&#x53EA;&#x662F;&#x6BD4;&#x8F83;&#x7C97;&#x7565;&#x7684;&#x5BF9;&#x5411;&#x91CF;&#x7684;&#x6982;&#x5FF5;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#xFF0C;&#x52A1;&#x5FC5;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x5272;&#x88C2;&#x4E86;&#x6765;&#x770B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x4E2D;&#x4E09;&#x8005;&#x7684;&#x6982;&#x5FF5;&#x5F80;&#x5F80;&#x662F;&#x76F8;&#x4E92;&#x4EA4;&#x53C9;&#x878D;&#x5408;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x5411;&#x91CF;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x8BC1;&#x660E;&#x8981;&#x4ECE;&#x6570;&#x5B66;&#x89D2;&#x5EA6;&#x6765;&#x4FDD;&#x8BC1;&#x5176;&#x4E25;&#x8C28;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6D89;&#x53CA;&#x5927;&#x91CF;&#x8FD0;&#x7B97;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x53C8;&#x9700;&#x8981;&#x501F;&#x52A9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x77E9;&#x9635;&#x8FD0;&#x7B97;&#x6765;&#x5B9E;&#x73B0;&#x3002;<br>&#x2003;&#x2003;&#x672C;&#x6587;&#x5219;&#x4EE5;&#x51E0;&#x4F55;&#x6982;&#x5FF5;&#x4E3A;&#x4E3B;&#xFF0C;&#x65B9;&#x4FBF;&#x5927;&#x5BB6;&#x66F4;&#x76F4;&#x89C2;&#x3001;&#x672C;&#x8D28;&#x7684;&#x53BB;&#x7406;&#x89E3;&#x5411;&#x91CF;&#x3002;</p>
<h4 id="2-2-&#x57FA;"><a href="#2-2-&#x57FA;" class="headerlink" title="2.2 &#x57FA;"></a>2.2 &#x57FA;</h4><p>&#x2003;&#x2003;&#x57FA;&#x8FD9;&#x4E2A;&#x8BCD;&#x8BED;&#xFF0C;&#x4E5F;&#x662F;&#x88AB;&#x5927;&#x5BB6;&#x73A9;&#x574F;&#x4E86;&#x3002;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x660E;&#xFF0C;&#x672C;&#x6587;&#x4E2D;&#x7684;&#x57FA;&#x7EAF;&#x7CB9;&#x662F;&#x6570;&#x5B66;&#x548C;&#x51E0;&#x4F55;&#x5B66;&#x4E0A;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x8BF7;&#x52FF;&#x505A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8054;&#x60F3;&#x3002;</p>
<h5 id="2-2-1-&#x6982;&#x5FF5;"><a href="#2-2-1-&#x6982;&#x5FF5;" class="headerlink" title="2.2.1 &#x6982;&#x5FF5;"></a>2.2.1 &#x6982;&#x5FF5;</h5><p>&#x2003;&#x2003;&#x6839;&#x636E;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x57FA;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x57FA;&#x5E95;&#xFF09;&#x662F;&#x63CF;&#x8FF0;&#x3001;&#x523B;&#x753B;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x7684;&#x57FA;&#x672C;&#x5DE5;&#x5177;&#x3002;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x7684;&#x57FA;&#x662F;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x57FA;&#x7684;&#x5143;&#x7D20;&#x79F0;&#x4E3A;&#x57FA;&#x5411;&#x91CF;&#x3002;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x4E2D;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x552F;&#x4E00;&#x5730;&#x8868;&#x793A;&#x6210;&#x57FA;&#x5411;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#x3002;&#x57FA;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x4E00;&#x7EC4;&#xFF08;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#xFF09;n&#xFF08;n&#x2265;0)&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x4EE5;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x5750;&#x6807;&#x7CFB;&#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x91C7;&#x7528;&#x57FA;<font color="green">$\vec i(1, 0)$</font>&#x548C;<font color="#FF33CC">$\vec j(0, 1)$</font>&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;<br><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E2D;&#x7684;&#x57FA;&#x53CA;&#x5411;&#x91CF;.png" alt="image"></p>
<div align="center">&#x56FE;2-5&#x3000;&#x3000;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E2D;&#x7684;&#x57FA;&#x53CA;&#x5411;&#x91CF;</div> 

<p>&#x2003;&#x2003;&#x5B9A;&#x4E49;&#x4E86;&#x4E24;&#x4E2A;&#x57FA;&#x540E;&#xFF0C;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x4EFB;&#x610F;&#x5411;&#x91CF;&#x90FD;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#x8FD9;&#x4E24;&#x4E2A;&#x57FA;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x56FE;2-5&#x4E2D;&#x7684;&#x5411;&#x91CF;$\overrightarrow{OP}=(3,2)$&#xFF0C;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;$\overrightarrow{OP}=3\vec i + 2\vec j$&#xFF0C;&#x5176;&#x542B;&#x4E49;&#x975E;&#x5E38;&#x660E;&#x786E;&#xFF0C;&#x5373;&#x2460;&#x5148;&#x5F80;$X(&#x57FA;&#x5411;&#x91CF;i)$&#x6B63;&#x5411;&#x79FB;&#x52A8;<strong><font color="green" size="4">3<font></font></font></strong>&#x4E2A;&#x5355;&#x4F4D;&#x2461;&#x518D;&#x5F80;$Y(&#x57FA;&#x5411;&#x91CF;j)$&#x6B63;&#x5411;&#x79FB;&#x52A8;<strong><font color="#FF33CC" size="4">2</font></strong>&#x4E2A;&#x5355;&#x4F4D;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5411;&#x91CF;&#x5728;&#x7ED9;&#x5B9A;&#x5750;&#x6807;&#x7CFB;&#xFF08;&#x8FD9;&#x91CC;&#x662F;$X-Y$&#xFF09;&#x4E0B;&#x7684;&#x5750;&#x6807;&#x503C;&#x6700;&#x672C;&#x8D28;&#x7684;&#x542B;&#x4E49;&#x2014;&#x2014;&#x628A;&#x5411;&#x91CF;&#x770B;&#x505A;&#x7269;&#x4F53;&#x7684;&#x8FD0;&#x52A8;&#x3002;<br>&#x2003;&#x2003;<strong><font color="red">&#x6CE8;&#x610F;&#xFF1A;&#x57FA;&#x5411;&#x91CF;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x5411;&#x91CF;&#xFF08;&#x6BD4;&#x5982;$\vec i=(2,1)$&#xFF09;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x5355;&#x4F4D;&#x5411;&#x91CF;&#xFF0C;&#x4E0A;&#x9762;&#x53EA;&#x662F;&#x4E3E;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7279;&#x6B8A;&#x7684;&#x4F8B;&#x5B50;&#xFF08;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x4E0B;&#x6587;&#x7684;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x53D9;&#x8FF0;&#x548C;&#x8BC1;&#x660E;&#xFF09;&#x3002;</font></strong></p>
<h5 id="2-2-2-&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;"><a href="#2-2-2-&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;" class="headerlink" title="2.2.2 &#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;"></a>2.2.2 <a name="vector_transform"></a>&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;</h5><p>&#x2003;&#x2003;&#x6B63;&#x5982;&#x6211;&#x5728;2.2.1&#x4E2D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x5728;&#x4E8C;&#x7EF4;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x91C7;&#x7528;<font color="green">$\vec i(1, 0)$</font>&#x548C;<font color="#FF33CC">$\vec j(0, 1)$</font>&#x4F5C;&#x4E3A;&#x57FA;&#x5411;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x7B80;&#x6D01;&#x3001;&#x76F4;&#x89C2;&#xFF0C;&#x6240;&#x89C1;&#x5373;&#x6240;&#x5F97;&#xFF08;&#x5750;&#x6807;&#x503C;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4EE5;&#x6307;&#x5B9A;&#x7684;&#x5411;&#x91CF;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x4EFB;&#x610F;&#x503C;&#xFF09;&#x6765;&#x4F5C;&#x4E3A;&#x57FA;&#x53BB;&#x8868;&#x793A;&#x5176;&#x5B83;&#x5411;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;<strong>&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;</strong>&#x3002;<br>&#x2003;&#x2003;&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x8981;&#x4EE5;<font color="green">$\vec a(1, 3)$</font>&#x548C;<font color="#FF33CC">$\vec b(-1, 2)$</font>&#x4F5C;&#x4E3A;&#x57FA;&#x6765;&#x8868;&#x793A;$\overrightarrow{OP}$&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;<br><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x57FA;&#x53D8;&#x6362;&#x793A;&#x610F;&#x56FE;.png" alt="image"></p>
<div align="center">&#x56FE;2-6&#x3000;&#x3000;&#x57FA;&#x53D8;&#x6362;&#x793A;&#x610F;&#x56FE;</div> 

<p>&#x2003;&#x2003;&#x7ED9;&#x51FA;&#x4E86;&#x53D8;&#x6362;&#x540E;&#x7684;&#x57FA;&#x5411;&#x91CF;&#xFF0C;&#x5982;&#x4F55;&#x6C42;&#x89E3;&#x4EFB;&#x610F;&#x5411;&#x91CF;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5750;&#x6807;&#x5462;&#xFF1F;&#x5F88;&#x591A;&#x6559;&#x79D1;&#x4E66;&#x4E0A;&#x90FD;&#x7ED9;&#x51FA;&#x4E86;&#x8F6C;&#x6362;&#x516C;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x4ECE;&#x51E0;&#x4F55;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x89E3;&#x91CA;&#x6E05;&#x695A;&#x8F6C;&#x6362;&#x7684;&#x8FC7;&#x7A0B;&#x4EE5;&#x53CA;&#x516C;&#x5F0F;&#x7684;&#x63A8;&#x5BFC;&#x3002;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x53BB;&#x770B;&#x770B;<a href="https://www.youtube.com/playlist?list=PLZHQObOWTQDPD3MizzM2xVFitgF8hE_ab" target="_blank" rel="noopener">3Blue1Brown</a>&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x8BB2;&#x7684;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x56FD;&#x5185;&#x5F88;&#x591A;&#x6240;&#x8C13;&#x7684;&#x6559;&#x6388;&#x770B;&#x4E86;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x53EF;&#x4EE5;&#x627E;&#x4E2A;&#x81EA;&#x4E60;&#x5BA4;&#x597D;&#x597D;&#x8E72;&#x5899;&#x89D2;&#x4E86;&#x3002;<br>&#x2003;&#x2003;&#x4F5C;&#x8005;&#x5728;&#x89C6;&#x9891;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x6838;&#x5FC3;&#x70B9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;<strong>&#x53D8;&#x6362;&#x524D;&#x540E;&#x7684;&#x7269;&#x4F53;&#x8FD0;&#x52A8;&#x7684;&#x672C;&#x8D28;&#xFF08;&#x65B9;&#x5411;&#x3001;&#x5927;&#x5C0F;&#xFF09;&#x662F;&#x4E0D;&#x53D8;&#x7684;</strong>&#xFF0C;&#x53EA;&#x8981;&#x7262;&#x7262;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x80FD;&#x638C;&#x63E1;&#x6574;&#x4E2A;&#x53D8;&#x6362;&#x7684;&#x8109;&#x7EDC;&#x3002;&#x4EE5;&#x4E0A;&#x9762;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BF4;&#xFF0C;&#x53D8;&#x6362;&#x540E;&#x7684;&#x57FA;&#x5411;&#x91CF;$\vec a$&#x548C;$\vec b$&#x7684;&#x5750;&#x6807;&#x503C;&#x5206;&#x522B;&#x4E3A;$(1,3)&#x3001;(-1,2)$&#xFF0C;&#x4E0D;&#x7BA1;&#x57FA;&#x5982;&#x4F55;&#x53D8;&#x6362;&#xFF0C;&#x5411;&#x91CF;&#x7684;&#x672C;&#x8D28;&#xFF08;&#x7269;&#x4F53;&#x7684;&#x8FD0;&#x52A8;&#xFF09;&#x662F;&#x4E0D;&#x5E94;&#x8BE5;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x5373;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;$\vec P&#x2019;$&#x76F8;&#x5BF9;&#x53D8;&#x6362;&#x540E;&#x7684;&#x57FA;&#x7684;&#x8FD0;&#x52A8;&#x4E5F;&#x662F;&#xFF1A;<br>&#x2003;&#x2003;<font color="#FF9900">&#x2460;&#x5148;&#x6CBF;&#x7740;&#x57FA;&#x5411;&#x91CF;$\vec a$&#x79FB;&#x52A8;3&#x4E2A;&#x5355;&#x4F4D;&#xFF08;&#x56E0;&#x4E3A;&#x53D8;&#x6362;&#x524D;&#x7684;$\vec i$&#x5BF9;&#x5E94;&#x53D8;&#x6362;&#x540E;&#x7684;$\vec a$)&#xFF1B;</font><br>&#x2003;&#x2003;<font color="#FF6600">&#x2461;&#x518D;&#x6CBF;&#x7740;&#x57FA;&#x5411;&#x91CF;$\vec b$&#x79FB;&#x52A8;2&#x4E2A;&#x5355;&#x4F4D;&#x3002;</font><br>&#x2003;&#x2003;&#x77E5;&#x9053;&#x4E86;&#x53D8;&#x6362;&#x540E;&#x7684;&#x8FD0;&#x52A8;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63A8;&#x5BFC;&#x51FA;&#x6BCF;&#x4E00;&#x6B65;&#x8FD0;&#x52A8;&#x540E;&#x7684;&#x5750;&#x6807;&#x503C;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;<br>&#x2003;&#x2003;<font color="#0000FF">&#x2460;&#x6CBF;$\vec a$&#x79FB;&#x52A8;3&#x4E2A;&#x5355;&#x4F4D;&#xFF0C;&#x5373;$3\vec a$&#xFF0C;&#x5230;&#x8FBE;$P&#x2019;_a=(0,0) + (3,9)=(3,9)$&#xFF1B;</font><br>&#x2003;&#x2003;<font color="#9933FF">&#x2461;&#x518D;&#x6CBF;$\vec b$&#x79FB;&#x52A8;2&#x4E2A;&#x5355;&#x4F4D;&#xFF0C;&#x5373;$2\vec b$&#xFF0C;&#x5230;&#x8FBE;&#x6700;&#x7EC8;&#x70B9;$P&#x2019;=(3,9) + (-2,4)=(1,13)$&#x3002;</font><br>&#x2003;&#x2003;&#x53D8;&#x6362;&#x7684;&#x8BE6;&#x7EC6;&#x56FE;&#x89E3;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;OP&apos;.png" width="70%" height="40%"></p>
<div align="center">&#x56FE;2-7&#x3000;&#x3000;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;OP&#x2019;</div> 

<p>&#x2003;&#x2003;&#x56FE;&#x4E2D;&#x84DD;&#x8272;&#x7BAD;&#x5934;&#x5373;&#x4E3A;&#x57FA;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;$OP&#x2019;$&#xFF0C;&#x6839;&#x636E;&#x56FE;&#x4E2D;&#x7684;&#x8DDD;&#x79BB;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6211;&#x4EEC;&#x63A8;&#x5BFC;&#x51FA;&#x7684;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5750;&#x6807;&#x503C;&#x548C;&#x5B9E;&#x6D4B;&#x503C;<strong>&#xFF08;&#x4F7F;&#x7528;AutoCAD2010&#x7248;&#x81EA;&#x52A8;&#x6807;&#x6CE8;&#xFF09;</strong>&#x5B8C;&#x5168;&#x543B;&#x5408;&#xFF01;<br>&#x2003;&#x2003;&#x5176;&#x5B9E;&#x4E0A;&#x8FF0;&#x53D8;&#x6362;&#x8FD8;&#x53EF;&#x4EE5;&#x5206;&#x4F5C;<strong>&#x56DB;&#x6B65;</strong>&#x6765;&#x770B;&#x5F85;&#xFF0C;&#x5373;&#x628A;&#x6CBF;$\vec a$&#x548C;$\vec b$&#x65B9;&#x5411;&#x7684;&#x79FB;&#x52A8;&#x5206;&#x522B;&#x62C6;&#x5206;&#x6210;&#x6CBF;X&#x8F74;&#x548C;Y&#x8F74;&#x7684;&#x79FB;&#x52A8;&#xFF1A;<br>&#x2003;&#x2003;&#x2460;&#x6CBF;X&#x8F74;&#x6B63;&#x65B9;&#x5411;&#x79FB;&#x52A8;3&#xFF08;3&#xB7;$a_x$&#xFF09;&#x4E2A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;&#xFF0C;&#x5230;&#x8FBE;&#x70B9;(3,0)&#xFF1B;<br>&#x2003;&#x2003;&#x2461;&#x6CBF;Y&#x8F74;&#x6B63;&#x65B9;&#x5411;&#x79FB;&#x52A8;9&#xFF08;3&#xB7;$a_y$&#xFF09;&#x4E2A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;&#xFF0C;&#x5230;&#x8FBE;&#x70B9;(3,9)&#xFF08;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#x76F8;&#x5F53;&#x4E8E;&#x5B8C;&#x6210;&#x4E86;&#x6CBF;$\vec a$&#x65B9;&#x5411;&#x79FB;&#x52A8;3&#x4E2A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;&#xFF09;&#xFF1B;<br>&#x2003;&#x2003;&#x2462;&#x6CBF;X&#x8F74;&#x8D1F;&#x65B9;&#x5411;&#x79FB;&#x52A8;2&#xFF08;2&#xB7;$b_x$&#xFF09;&#x4E2A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;&#xFF0C;&#x5230;&#x8FBE;&#x70B9;(1,9)&#xFF1B;<br>&#x2003;&#x2003;&#x2463;&#x6CBF;Y&#xFF08;2&#xB7;$b_y$&#xFF09;&#x8F74;&#x6B63;&#x65B9;&#x5411;&#x79FB;&#x52A8;4&#x4E2A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;&#xFF0C;&#x5230;&#x8FBE;&#x7EC8;&#x70B9;(1,13)&#xFF08;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#x76F8;&#x5F53;&#x4E8E;&#x5B8C;&#x6210;&#x4E86;&#x6CBF;$\vec b$&#x65B9;&#x5411;&#x79FB;&#x52A8;2&#x4E2A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;&#xFF09;&#xFF1B;</p>
<h5 id="2-2-3-&#x5411;&#x91CF;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x77E9;&#x9635;&#x5F0F;"><a href="#2-2-3-&#x5411;&#x91CF;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x77E9;&#x9635;&#x5F0F;" class="headerlink" title="2.2.3 &#x5411;&#x91CF;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x77E9;&#x9635;&#x5F0F;"></a>2.2.3 &#x5411;&#x91CF;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x77E9;&#x9635;&#x5F0F;</h5><p>&#x2003;&#x2003;2.2.2&#x4E2D;&#x867D;&#x7136;&#x63A8;&#x5230;&#x51FA;&#x4E86;&#x4EFB;&#x610F;&#x5411;&#x91CF;&#x5728;&#x57FA;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5750;&#x6807;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x663E;&#x7136;&#x8FD8;&#x6CA1;&#x6709;&#x8DDF;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#xFF08;&#x77E9;&#x9635;&#x3001;&#x77E9;&#x9635;&#x8FD0;&#x7B97;&#xFF09;&#x8854;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x5728;&#x5750;&#x6807;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4E24;&#x6B65;&#x8BA1;&#x7B97;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EA;&#x770B;&#x5230;&#x4E00;&#x5806;&#x6570;&#x5B57;&#x5728;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x6E05;&#x6670;&#x7684;&#x53CD;&#x6620;&#x51FA;&#x57FA;&#x5411;&#x91CF;&#x662F;&#x5982;&#x4F55;&#x53C2;&#x4E0E;&#x53D8;&#x6362;&#x7684;&#xFF08;&#x867D;&#x7136;&#x4E3A;&#x4E86;&#x5927;&#x5BB6;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x6211;&#x5DF2;&#x7ECF;&#x52A0;&#x4E86;&#x4E0D;&#x5C11;&#x8BF4;&#x660E;&#x6587;&#x5B57;&#xFF09;&#xFF0C;&#x800C;&#x77E9;&#x9635;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;<br>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x53D8;&#x6362;&#x540E;&#x7684;&#x57FA;&#x7684;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x57FA;&#x5411;&#x91CF;&#x90FD;&#x662F;&#x4E8C;&#x7EF4;&#xFF08;&#x5206;&#x522B;&#x5BF9;&#x5E94;X&#x3001;Y&#x5750;&#x6807;&#x503C;&#xFF09;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x77E9;&#x9635;&#x6709;&#x4E24;&#x884C;(m=2)&#xFF0C;&#x53C8;&#x7531;&#x4E8E;&#x6709;&#x4E24;&#x4E2A;&#x57FA;&#x5411;&#x91CF;&#xFF08;&#x5373;$\vec a$&#x548C;$\vec b$&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x77E9;&#x9635;&#x6709;&#x4E24;&#x5217;(n=2)&#xFF0C;&#x5219;&#x53D8;&#x6362;&#x540E;&#x57FA;&#x7684;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<font color="blue"><br>$$<br>\vec w =<br>\begin{bmatrix}<br>a\ \ b<br>\end{bmatrix} =<br>\begin{bmatrix}<br>1\ \ -1\\\\<br>3\ \ \ \ \ \ 2<br>\end{bmatrix}<br>\tag{2-1}<br>$$<br></font><br>&#x2003;&#x2003;&#x9700;&#x8981;&#x53D8;&#x6362;&#x7684;&#x5411;&#x91CF;$\overrightarrow{OP}$&#x7684;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F0F;&#x5219;&#x4E3A;&#xFF1A;<br><font color="#9933CC"><br>$$<br>\overrightarrow{OP} =<br>\begin{bmatrix}<br>3\\\\<br>2<br>\end{bmatrix}<br>\tag{2-2}<br>$$<br></font><br>&#x2003;&#x2003;&#x57FA;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;$\overrightarrow{OP&#x2019;}$&#x7684;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F0F;&#x5219;&#x4E3A;&#xFF1A;<br><font color="red"><br>$$<br>\begin{split}<br>\overrightarrow{OP&#x2019;} =<br>3&#xB7;\vec a + 2&#xB7;\vec b &amp;=<br>3&#xB7;\begin{bmatrix}<br>1\\\\<br>3<br>\end{bmatrix} +  2&#xB7;<br>\begin{bmatrix}<br>-1\\\\<br>2<br>\end{bmatrix} \\\\<br>&amp;=<br>\begin{bmatrix}<br>1\ \ -1\\\\<br>3\ \ \ \ \ \ 2<br>\end{bmatrix} \cdot<br>\begin{bmatrix}<br>3\\\\<br>2<br>\end{bmatrix} =<br>\begin{bmatrix}<br>1\\\\<br>13<br>\end{bmatrix} =<br>\vec w \cdot<br>\overrightarrow{OP} \\\\<br>\end{split}<br>\tag{2-3}<br>$$<br></font>

<p>&#x2003;&#x2003;&#x7531;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7ED3;&#x8BBA;&#xFF1A;<font color="red"><strong>&#x8FDB;&#x884C;&#x57FA;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;&#x7B49;&#x4E8E;&#x53D8;&#x6362;&#x540E;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x57FA;&#x5411;&#x91CF;&#x77E9;&#x9635;&#x5DE6;&#x4E58;&#x8981;&#x53D8;&#x6362;&#x7684;&#x5411;&#x91CF;&#x3002;&#x6362;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x5DE6;&#x4E58;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x662F;&#x5728;&#x8FDB;&#x884C;&#x57FA;&#x53D8;&#x6362;&#xFF08;&#x4F46;&#x5E76;&#x975E;&#x6240;&#x6709;&#x5DE6;&#x4E58;&#x90FD;&#x662F;&#x57FA;&#x53D8;&#x6362;&#xFF09;&#x3002;<br>&#x2003;&#x2003;&#x8FD9;&#x91CC;&#x6709;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x5C06;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x548C;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x5BF9;&#x5E94;&#x8D77;&#x6765;&#x7684;&#x5145;&#x5206;&#x548C;&#x5FC5;&#x8981;&#x6027;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x57FA;&#x53D8;&#x6362;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x4E00;&#x5B9A;&#x662F;&#x5DE6;&#x4E58;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x4F46;&#x5DE6;&#x4E58;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x5374;&#x5E76;&#x975E;&#x4E00;&#x5B9A;&#x662F;&#x57FA;&#x53D8;&#x6362;&#x3002;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x8DDF;&#x201C;&#x5510;&#x50E7;&#x9A91;&#x7684;&#x4E00;&#x5B9A;&#x662F;&#x767D;&#x9A6C;&#xFF0C;&#x4F46;&#x9A91;&#x767D;&#x9A6C;&#x7684;&#x5374;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x5510;&#x50E7;&#x201D;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x5F88;&#x591A;&#x6982;&#x5FF5;&#x4E5F;&#x4E0E;&#x6B64;&#x7C7B;&#x4F3C;&#x3002;</strong></font><br>&#x2003;&#x2003;<font color="blue">&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x539F;&#x6765;&#x4EE5;$(\vec i, \ \vec j)$&#x4E3A;&#x57FA;&#xFF0C;&#x4E14;&#x5750;&#x6807;&#x503C;&#x4E3A;$(3,2)$&#x7684;&#x70B9;&#xFF0C;&#x5728;&#x65B0;&#x57FA;$(\vec a, \ \vec b)$&#x4E0B;&#x7684;&#x5750;&#x6807;&#x4E3A;$(1, 13)$&#x3002;</font><br>&#x2003;&#x2003;&#x66F4;&#x4E00;&#x822C;&#x7684;&#xFF0C;&#x5047;&#x8BBE;&#x53D8;&#x6362;&#x540E;&#x7684;&#x57FA;&#x3001;&#x8981;&#x53D8;&#x6362;&#x7684;&#x5411;&#x91CF;&#x5206;&#x522B;&#x4E3A;&#xFF1A;<br>$$<br>\vec w =<br>\begin{bmatrix}<br> \vec {i&#x2019;}\ \ \vec {j&#x2019;}<br>\end{bmatrix} =<br>\begin{bmatrix}<br>i&#x2019;_1\ \ i&#x2019;_2\\\\<br>j&#x2019;_1\ \ j&#x2019;_2<br>\end{bmatrix}<br>\ \ &#xFF0C;\ \<br>\overrightarrow{OP} =<br>\begin{bmatrix}<br> x_0\\\\<br>y_0<br>\end{bmatrix}<br>$$<br>&#x2003;&#x2003;&#x5219;&#x57FA;&#x53D8;&#x6362;&#x540E;&#x7684;&#x5411;&#x91CF;&#x4E3A;&#xFF1A;<br>$$<br>\overrightarrow{OP&#x2019;} =<br>\begin{bmatrix}<br>i&#x2019;_1\ \ i&#x2019;_2\\\\<br>j&#x2019;_1\ \ j&#x2019;_2<br>\end{bmatrix} \cdot<br>\begin{bmatrix}<br> x_0\\\\<br>y_0<br>\end{bmatrix}<br>$$</p>
<h5 id="2-2-4-&#x57FA;&#x53D8;&#x6362;"><a href="#2-2-4-&#x57FA;&#x53D8;&#x6362;" class="headerlink" title="2.2.4 &#x57FA;&#x53D8;&#x6362;"></a>2.2.4 &#x57FA;&#x53D8;&#x6362;</h5><p>&#x2003;&#x2003;&#x5728;<a href="#vector_transform">&#x4E0A;&#x5C0F;&#x8282;</a>&#x4E2D;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5BF9;&#x4EFB;&#x610F;&#x5411;&#x91CF;&#x8FDB;&#x884C;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x53CA;&#x53E3;&#x7B97;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x57FA;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x5207;&#x6362;&#x7684;&#x65F6;&#x5019;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5462;&#xFF08;&#x5373;&#x57FA;&#x53D8;&#x6362;&#xFF09;&#xFF1F;&#x6211;&#x4EEC;&#x4ECD;&#x4EE5;&#x4E0A;&#x5C0F;&#x8282;&#x63D0;&#x5230;&#x7684;&#x4E24;&#x7EC4;&#x57FA;&#x4E3A;&#x4F8B;&#xFF0C;&#x5206;&#x522B;&#x8BB0;&#x4E24;&#x7EC4;&#x57FA;$(\vec i, \vec j)&#x3001;(\vec a, \vec b)$&#x4E3A;&#x65B0;&#x57FA;&#x548C;&#x65E7;&#x57FA;&#xFF0C;&#x5E76;&#x7528;$\vec B_{old}&#x3001;\vec B_{new}$&#x6765;&#x52A0;&#x4EE5;&#x533A;&#x5206;&#xFF0C;&#x5373;&#x6709;&#xFF1A;<br>$$<br>\vec B_{old} =<br>\begin{bmatrix}<br>\vec i\ \ \vec j<br>\end{bmatrix} =<br>\begin{bmatrix}<br>1\ \ \ \ \ 0 \\\\<br>0\ \ \ \ \ \ 1<br>\end{bmatrix} \\\\<br>\vec B_{new} =<br>\begin{bmatrix}<br>\vec a\ \ \vec b<br>\end{bmatrix} =<br>\begin{bmatrix}<br>1\ \ -1\\\\<br>3\ \ \ \ \ \ 2<br>\end{bmatrix}<br>\tag{2-4}<br>$$<br>&#x2003;&#x2003;<font color="red">&#x6CE8;&#x610F;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;<strong>&#x57FA;&#x53D8;&#x6362;</strong>&#x662F;&#x5F3A;&#x8C03;&#x4E24;&#x7EC4;&#x57FA;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x8F6C;&#x5316;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E0A;&#x5C0F;&#x8282;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x4ECE;&#x4E00;&#x7EC4;&#x57FA;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x7EC4;&#x57FA;&#x540E;&#x7684;&#x65B0;&#x5411;&#x91CF;&#x3002;</font><br>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;$\vec B_{old} \to \vec B_{new}$&#x4EE5;&#x53CA;$\vec B_{new} \to \vec B_{old}$&#xFF0C;&#x56E0;&#x4E3A;&#x4E24;&#x7EC4;&#x57FA;&#x90FD;&#x662F;&#x4E00;&#x4E2A;$2*2$&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x8981;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#xFF0C;&#x9700;&#x8981;&#x5DE6;&#x4E58;&#x6216;&#x53F3;&#x4E58;&#x4E00;&#x4E2A;$2*2$&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x6240;&#x4E58;&#x7684;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x6709;&#x4E2A;&#x4E13;&#x7528;&#x540D;&#x8BCD;&#x53EB;&#x505A;<strong>&#x8FC7;&#x6E21;&#x77E9;&#x9635;</strong>&#xFF0C;&#x975E;&#x5E38;&#x5F62;&#x8C61;&#xFF0C;&#x4ECE;&#x4E00;&#x7EC4;&#x57FA;&#x8FC7;&#x6E21;&#x5230;&#x53E6;&#x4E00;&#x7EC4;&#x57FA;&#xFF0C;&#x4F60;&#x5C31;&#x5F97;&#x501F;&#x52A9;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x3002;&#x90A3;&#x4E48;&#x7A76;&#x7ADF;&#x8BE5;&#x5982;&#x4F55;&#x6C42;&#x51FA;&#x8FD9;&#x4E2A;&#x8FC7;&#x6E21;&#x77E9;&#x9635;&#x5462;&#xFF1F;<br>&#x2003;&#x2003;&#x8981;&#x6C42;&#x5F97;&#x8FD9;&#x4E2A;&#x7B54;&#x6848;&#x5E76;&#x4E14;&#x4ECE;&#x51E0;&#x4F55;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x63ED;&#x5F00;&#x8FD9;&#x4E2A;&#x795E;&#x79D8;&#x672F;&#x8BED;&#x7684;&#x9762;&#x7EB1;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x6682;&#x4E14;&#x5148;&#x8DF3;&#x8FC7;&#x8FD9;&#x4E00;&#x4E2A;&#x5751;&#xFF0C;&#x7B49;&#x8BB2;&#x5B8C;2.3&#x8282;&#x7684;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x540E;&#x518D;&#x56DE;&#x6765;&#x586B;&#x5751;&#x3002;</p>
<h4 id="2-3-&#x7EBF;&#x6027;&#x53D8;&#x6362;"><a href="#2-3-&#x7EBF;&#x6027;&#x53D8;&#x6362;" class="headerlink" title="2.3 &#x7EBF;&#x6027;&#x53D8;&#x6362;"></a>2.3 &#x7EBF;&#x6027;&#x53D8;&#x6362;</h4><p>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x5728;&#xFF08;&#x6216;&#x7EBF;&#x6027;&#x6620;&#x5C04;&#xFF09;&#xFF0C;<strong>&#x6709;&#x7684;&#x4E66;&#x7C4D;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x8BED;&#x4F5C;&#x4E3A;&#x540C;&#x4E49;&#x8BCD;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x4E66;&#x7C4D;&#x5219;&#x4E0D;&#x7136;&#x3002;</strong>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x91C7;&#x7EB3;<a href="https://en.wikipedia.org/wiki/Linear_map" target="_blank" rel="noopener">wikipedia</a>&#x8BCD;&#x6761;&#xFF0C;&#x5176;&#x6570;&#x5B66;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;<br>$$<br>\begin{split}<br>f(\vec u + \vec v) &amp;= f(\vec u) + f(\vec v) \\\\<br>f(c\vec u) &amp;=c f(\vec u)<br>\end{split}<br>\tag{2 - 5}<br>$$<br>&#x2003;&#x2003;&#x5F0F;&#x4E2D;$\vec u&#x3001;\vec v$&#x5206;&#x522B;&#x5C5E;&#x4E8E;$\vec V&#x3001;\vec W$&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x3002;<font color="red">&#x7279;&#x522B;&#x7684;&#xFF0C;&#x5F53;$\vec V = \vec W$&#x5373;&#x4E24;&#x8005;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<strong><code>Linear Operator&#x6216;&#x8005;Endomorphism&#xFF08;&#x4FDD;&#x7559;wikipedia&#x4E0A;&#x7684;&#x539F;&#x8BDD;&#xFF0C;&#x4E0D;&#x505A;&#x7FFB;&#x8BD1;&#xFF09;</code></strong>&#x3002;</font>&#x4E0A;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x6574;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x5F0F;&#x5B50;&#x91CC;&#x9762;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br>$$<br>f(m\vec u +n \vec v) = mf(\vec u) + nf(\vec v)<br>\tag{2 - 6}<br>$$<br>&#x2003;&#x2003;&#x5B83;&#x7684;&#x6570;&#x5B66;&#x542B;&#x4E49;&#x662F;&#xFF1A;&#x5176;&#x8FD0;&#x7B97;&#x7531;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x5373;<strong>&#x5411;&#x91CF;&#x52A0;&#x6CD5;&#x548C;&#x6807;&#x91CF;&#x4E58;&#x6CD5;</strong>&#x6240;&#x7EC4;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x6570;&#x5B66;&#x5B9A;&#x4E49;&#x4FDD;&#x8BC1;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x8FD0;&#x7B97;&#x7684;&#x5C01;&#x95ED;&#x6027;&#x3002;<br>&#x2003;&#x2003;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x6570;&#x5B66;&#x4E13;&#x4E1A;&#x7684;&#x5B66;&#x751F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6210;&#x4E3A;&#x9AD8;&#x65AF;&#x3001;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8FD9;&#x7C7B;&#x795E;&#x4EBA;&#x7684;&#x8FFD;&#x6C42;&#xFF08;&#x667A;&#x5546;&#xFF09;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E00;&#x5957;&#x4E00;&#x5957;&#x7684;&#x54AC;&#x6587;&#x7235;&#x5B57;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x53EA;&#x559C;&#x6B22;&#x76F4;&#x89C2;&#x7684;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x4F17;&#x591A;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x540C;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x4E0B;&#x9762;&#x7684;&#x51E0;&#x70B9;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x4EE5;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x4E3A;&#x4F8B;&#xFF08;<strong>&#x6572;&#x9ED1;&#x677F;&#xFF01;&#xFF01;&#xFF01;</strong>&#xFF09;&#xFF1A;</p>
<ul>
<li>&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x524D;&#x540E;&#xFF0C;&#x5750;&#x6807;&#x7CFB;<strong>&#x539F;&#x70B9;&#x4FDD;&#x6301;&#x4E0D;&#x52A8;</strong>&#xFF1B;</li>
<li>&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x524D;&#x540E;&#xFF0C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x4EFB;&#x610F;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x5FC5;&#x987B;<strong>&#x4FDD;&#x6301;&#x5176;&#x76F4;&#x7EBF;&#x7279;&#x6027;&#xFF0C;&#x4E0D;&#x80FD;&#x5F2F;&#x66F2;</strong>&#xFF1B;</li>
<li>&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x524D;&#x540E;&#xFF0C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x4EFB;&#x610F;&#x4E24;&#x6761;&#x5E73;&#x884C;&#x7684;&#x76F4;&#x7EBF;&#xFF0C;&#x5FC5;&#x987B;<strong>&#x4FDD;&#x6301;&#x5176;&#x5E73;&#x884C;&#x7279;&#x6027;</strong>&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x8FD9;&#x5C31;&#x662F;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x6700;&#x7B80;&#x6D01;&#x3001;&#x660E;&#x4E86;&#x7684;&#x51E0;&#x4F55;&#x7279;&#x6027;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0A;&#x9762;&#x4E09;&#x6761;&#x4E5F;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4E3A;<a href="https://www.youtube.com/watch?v=kYB8IZa5AuE" target="_blank" rel="noopener">3Blue1Brown</a>&#x6240;&#x603B;&#x7ED3;&#x6210;&#x7684;&#x4E00;&#x6761;&#xFF1A;<strong>&#x53D8;&#x6362;&#x524D;&#x540E;&#xFF0C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x7684;&#x7F51;&#x683C;&#x7EBF;&#x4E24;&#x4E24;&#x4FDD;&#x6301;&#x7B49;&#x8DDD;&#x4E14;&#x5E73;&#x884C;</strong>&#x3002;</p>
<h5 id="2-3-1-&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x7C7B;&#x578B;"><a href="#2-3-1-&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x7C7B;&#x578B;" class="headerlink" title="2.3.1 &#x7EBF;&#x6027;&#x53D8;&#x6362;&#x7C7B;&#x578B;"></a>2.3.1 &#x7EBF;&#x6027;&#x53D8;&#x6362;&#x7C7B;&#x578B;</h5><p>&#x2003;&#x2003;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x6309;&#x7167;&#x5176;&#x5BF9;&#x539F;&#x56FE;&#x5F62;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5206;&#x4E3A;&#xFF1A;<strong>&#x65CB;&#x8F6C;&#x3001;&#x7F29;&#x653E;&#x3001;&#x6295;&#x5F71;&#x3001;&#x955C;&#x50CF;&#x3001;&#x526A;&#x5207;&#x3001;&#x590D;&#x5408;</strong>&#x3002;&#x800C;&#x6309;&#x7167;&#x53D8;&#x6362;&#x524D;&#x540E;&#x56FE;&#x5F62;&#x662F;&#x5426;&#x53EF;&#x5B8C;&#x5168;&#x6062;&#x590D;&#xFF0C;&#x53C8;&#x5206;&#x4E3A;&#xFF1A;<strong>&#x53EF;&#x9006;&#x53D8;&#x6362;&#x3001;&#x4E0D;&#x53EF;&#x9006;&#x53D8;&#x6362;&#x3002;</strong>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E9B;&#x53D8;&#x6362;&#x9010;&#x4E00;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;<br>&#x2003;&#x2003;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x53D8;&#x6362;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x6781;&#x4E86;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x6EE1;&#x8DB3;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x90A3;&#x5C31;&#x662F;<strong>&#x5E73;&#x79FB;</strong>&#xFF0C;&#x53C2;&#x89C1;&#x4E0A;&#x9762;&#x7684;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x51E0;&#x4F55;&#x7279;&#x6027;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x3002;</p>
<h5 id="2-3-2-&#x7F29;&#x653E;"><a href="#2-3-2-&#x7F29;&#x653E;" class="headerlink" title="2.3.2 &#x7F29;&#x653E;"></a>2.3.2 <a name="transform_scale"></a>&#x7F29;&#x653E;</h5><p>&#x2003;&#x2003;&#x7F29;&#x653E;&#x5E94;&#x8BE5;&#x662F;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x91CC;&#x9762;&#x6700;&#x7B80;&#x5355;&#x3001;&#x6700;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x3002;<strong>&#x7F29;&#x653E;&#xFF08;&#x8FD9;&#x91CC;&#x6307;&#x7684;&#x662F;&#x5404;&#x65B9;&#x5411;&#x7F29;&#x653E;&#x5F15;&#x5B50;&#x5747;&#x76F8;&#x540C;&#x7684;&#x5747;&#x5300;&#x7F29;&#x653E;&#xFF09;&#x4EC5;&#x4EC5;&#x6539;&#x53D8;&#x4E86;&#x56FE;&#x5F62;&#x7684;&#x5C3A;&#x5BF8;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x56FE;&#x5F62;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x56FE;&#x5F62;&#x4E0E;&#x5750;&#x6807;&#x8F74;&#x7684;&#x5939;&#x89D2;&#xFF01;</strong>&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E2D;&#x7684;&#x7F29;&#x653E;&#x7684;&#x56FE;&#x793A;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><div style="text-align:center;"><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E4B;&#x7F29;&#x653E;.png" width="380" height="320">&#x56FE;2-8    &#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E4B;&#x7F29;&#x653E;&#x793A;&#x610F;&#x56FE;</div><br>&#x2003;&#x2003;&#x7531;&#x56FE;&#x6211;&#x4EEC;&#x6709;&#xFF1A;<br>$$<br>\begin{cases}<br>\frac{m}{p} = \frac{||\vec P_{new}||}{||\vec P_{old}||} \\\\<br>\frac{n}{q} = \frac{||\vec P_{new}||}{||\vec P_{old}||}<br>\end{cases}<br>\tag{2 - 7}<br>$$<br>&#x2003;&#x2003;&#x8BB0;$\frac {||\vec P_{new}|| } {||\vec P_{old}||} = k$&#xFF0C;&#x79F0;&#x4E3A;&#x7F29;&#x653E;&#x7CFB;&#x6570;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x6709;&#xFF1A;<br>$$<br>\begin{cases}<br>m = k \cdot p + 0 \cdot q \\\\<br>n = 0 \cdot p + k \cdot q<br>\end{cases}<br>\tag{2 - 8}<br>$$<br>&#x2003;&#x2003;&#x5199;&#x6210;&#x77E9;&#x9635;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#xFF1A;<br>$$<br>\begin{bmatrix}<br>m\ \\\\<br>n<br>\end{bmatrix} =<br>\begin{bmatrix}<br>k &amp; 0\\\\<br>0 &amp; k<br>\end{bmatrix}<br>\begin{bmatrix}<br>p \\\\<br>q<br>\end{bmatrix}<br>\tag{2 - 9}<br>$$<br>&#x2003;&#x2003;&#x4E5F;&#x5373;&#x7F29;&#x653E;&#x524D;&#x540E;&#x65E7;&#x5411;&#x91CF;&#x548C;&#x65B0;&#x5411;&#x91CF;&#x7684;&#x5173;&#x7CFB;&#x4E3A;&#xFF1A;<br>$$<br>\begin{cases}<br>\vec P_{old} =<br>\begin{bmatrix}<br>\frac{1}{k} &amp; 0\\\\<br>0 &amp; \frac{1}{k}<br>\end{bmatrix}<br>\vec P_{new}  = A \cdot \vec P_{new}\\\\<br>\vec P_{new} =<br>\begin{bmatrix}<br>k &amp; 0 \\\\<br>0 &amp; k<br>\end{bmatrix}<br>\vec P_{old}  = A^{-1} \cdot \vec P_{old}<br>\end{cases}<br>\tag{2 - 10}<br>$$<br>&#x2003;&#x2003;&#x7531;&#x4E0A;&#x53EF;&#x77E5;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x5DE6;&#x4E58;&#x4E00;&#x4E2A;<strong>&#x4E3B;&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;&#x5143;&#x7D20;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x89D2;&#x77E9;&#x9635;</strong>&#xFF0C;&#x5176;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x7F29;&#x653E;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E2A;&#x4E3A;&#x7F29;&#x653E;&#x77E9;&#x9635;&#x3002;&#x8BB0;&#x4F4F;<strong>&#x7F29;&#x653E;&#x77E9;&#x9635;&#x7684;&#x7279;&#x6027;</strong>&#xFF1A;</p>
<ul>
<li>&#x4E3B;&#x5BF9;&#x89D2;&#x5143;&#x7D20;&#x76F8;&#x7B49;&#xFF08;&#x540C;&#x503C;&#x3001;&#x540C;&#x53F7;&#xFF09;&#xFF1B;</li>
<li>&#x975E;&#x4E3B;&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;&#x5143;&#x7D20;&#x5747;&#x4E3A;0&#xFF08;&#x5BF9;&#x89D2;&#x77E9;&#x9635;&#xFF09;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x591F;&#x7B80;&#x5355;&#x5427;&#xFF0C;&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x8BE5;&#x4ECB;&#x7ECD;&#x4E0B;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E86;&#xFF1F;&#x5148;&#x522B;&#x7740;&#x6025;&#x5F80;&#x4E0B;&#x8D70;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x4E1C;&#x897F;&#x8FD8;&#x591A;&#x5462;&#x3002;&#x5BF9;&#x4E8E;&#x975E;&#x4E3B;&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;&#x7684;&#x5143;&#x7D20;&#x4E3A;0&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4ECE;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5355;&#x5C31;&#x8FD9;&#x4E00;&#x7279;&#x6027;&#xFF0C;&#x4EE3;&#x8868;&#x7684;&#x51E0;&#x4F55;&#x542B;&#x4E49;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4E09;&#x7EF4;&#x53CA;&#x66F4;&#x9AD8;&#x4E3A;&#x7A7A;&#x95F4;&#x7684;&#x7F29;&#x653E;&#x77E9;&#x9635;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF1F;<br>&#x2003;&#x2003;&#x5148;&#x6765;&#x770B;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x8981;&#x63ED;&#x5F00;&#x8FD9;&#x4E2A;&#x8C1C;&#x56E2;&#x5176;&#x5B9E;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x56DE;&#x987E;&#x4E0B;&#x6211;&#x4EEC;<a href="#vector_transform">2.2.2</a>&#x5C0F;&#x8282;&#x4E2D;&#x8BB2;&#x7684;&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x7F29;&#x653E;&#x4E5F;&#x770B;&#x505A;&#x662F;&#x5BF9;&#x5DF2;&#x77E5;&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;&#xFF0C;&#x53D8;&#x6362;&#x540E;&#x7684;&#x65B0;&#x57FA;&#x4E3A;$\vec e_1 = [k, 0]^T&#x3001;\vec e_2 = [0, k]^T$&#xFF0C;&#x53D8;&#x6362;&#x540E;&#x7684;&#x65B0;&#x57FA;&#x4E0E;&#x539F;&#x6765;&#x7684;&#x65E7;&#x57FA;$\vec i = [1, 0]^T&#x3001;\vec j = [0, 1]^T$&#x65B9;&#x5411;&#x91CD;&#x5408;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x5DEE;&#x5F02;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;<strong>&#x5C3A;&#x5EA6;</strong>&#x4E0A;&#x6709;&#x6240;&#x653E;&#x5927;/&#x7F29;&#x5C0F;&#xFF0C;&#x6BD4;&#x4F8B;&#x4E3A;$k$&#xFF0C;&#x800C;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x672C;&#x8D28;&#x53C8;&#x662F;&#x6CBF;&#x7740;&#x57FA;&#x5411;&#x91CF;&#x65B9;&#x5411;&#x7684;&#x8FD0;&#x52A8;&#xFF0C;<font color="red">&#x56E0;&#x6B64;&#x5F53;&#x6211;&#x4EEC;&#x7528;&#x65B0;&#x57FA;&#x53BB;&#x5EA6;&#x91CF;&#x65E7;&#x57FA;&#x4E2D;&#x7684;&#x56FE;&#x5F62;&#x65F6;&#xFF0C;&#x8FD0;&#x52A8;&#x7684;&#x65B9;&#x5411;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x8FD0;&#x52A8;&#x7684;&#x8DDD;&#x79BB;&#x6709;&#x6240;&#x53D8;&#x5316;&#x3002;</font><br>&#x2003;&#x2003;&#x800C;&#x5982;&#x679C;&#x975E;&#x4E3B;&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;&#x7684;&#x5143;&#x7D20;&#x4E0D;&#x4E3A;0&#xFF0C;&#x65B0;&#x57FA;&#x76F8;&#x5BF9;&#x4E8E;&#x65E7;&#x57FA;&#x4E0D;&#x4EC5;&#x6709;&#x5C3A;&#x5BF8;&#x4E0A;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x8FD8;&#x6709;&#x65B9;&#x5411;&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x5750;&#x6807;&#x8F74;&#x7684;&#x5939;&#x89D2;&#xFF09;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x65B0;&#x57FA;&#x53BB;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x65F6;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x8FD0;&#x52A8;&#x65B9;&#x5411;&#x3001;&#x5C3A;&#x5BF8;&#x5747;&#x5DF2;&#x6539;&#x53D8;&#xFF0C;&#x5176;&#x6700;&#x7EC8;&#x7684;&#x53D8;&#x6362;&#x6548;&#x679C;&#x4E5F;&#x5C31;&#x4E0D;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x7F29;&#x653E;&#x4E86;&#x3002;<br>&#x2003;&#x2003;&#x518D;&#x6765;&#x770B;&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x6709;&#x4E86;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x89E3;&#x7B54;&#x3002;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x628A;&#x7F29;&#x653E;&#x53D8;&#x6362;&#x89C6;&#x4F5C;&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;&#xFF0C;&#x8981;&#x4FDD;&#x6301;&#x5411;&#x91CF;&#x53D8;&#x6362;&#x524D;&#x540E;&#x53EA;&#x6709;&#x5C3A;&#x5EA6;&#x4E0A;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x90A3;&#x4E48;&#x53D8;&#x6362;&#x540E;&#x7684;&#x65B0;&#x57FA;&#x7684;&#x57FA;&#x5411;&#x91CF;&#x5E94;&#x8BE5;&#x4E0E;&#x539F;&#x6765;&#x7684;&#x57FA;&#x5411;&#x91CF;&#x65B9;&#x5411;&#x4E00;&#x81F4;&#x3002;&#x4E86;&#x89E3;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;n&#x7EF4;&#x5750;&#x6807;&#x7CFB;&#xFF0C;&#x5176;&#x7F29;&#x653E;&#x77E9;&#x9635;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x968F;&#x624B;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br>$$<br>A =<br>\underbrace{<br>n \begin{cases}<br>\begin{bmatrix}<br>k &amp; 0 &amp; 0 &amp; \cdots &amp; 0 \\\\<br>0 &amp; k &amp; 0 &amp; \cdots &amp; 0 \\\\<br>\vdots &amp; \ddots &amp; \ddots &amp; \ddots &amp; \vdots \\\\<br>0 &amp; 0 &amp; 0 &amp; \cdots &amp; k<br>\end{bmatrix}<br>\end{cases}} _{n}<br>\tag{2 - 11}<br>$$</p>
<h5 id="2-3-3-&#x65CB;&#x8F6C;"><a href="#2-3-3-&#x65CB;&#x8F6C;" class="headerlink" title="2.3.3 &#x65CB;&#x8F6C;"></a>2.3.3 &#x65CB;&#x8F6C;</h5><p>&#x2003;&#x2003;&#x6211;&#x4EEC;&#x4ECD;&#x5148;&#x4EE5;&#x4E8C;&#x7EF4;&#x5411;&#x91CF;&#x4E3A;&#x4F8B;&#xFF0C;&#x65CB;&#x8F6C;&#x524D;&#x7684;&#x5411;&#x91CF;&#x4E3A;$\vec P_{old} = (p, q)$&#xFF08;&#x56FE;&#x4E2D;&#x7684;&#x70B9;P&#xFF09;&#xFF0C;&#x65CB;&#x8F6C;&#x540E;&#x7684;&#x5411;&#x91CF;$\vec P_{new} = (m, n)$&#xFF08;&#x56FE;&#x4E2D;&#x7684;&#x70B9;P&#x2019;&#xFF09;&#x3002;&#x7531;&#x4E0B;&#x56FE;&#x53EF;&#x77E5;&#xFF0C;&#x65CB;&#x8F6C;&#x6700;&#x76F4;&#x89C2;&#x7684;&#x51E0;&#x4F55;&#x6982;&#x5FF5;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x6539;&#x53D8;&#x4E86;&#x5411;&#x91CF;&#xFF08;&#x56FE;&#x5F62;&#xFF09;&#x4E0E;&#x5750;&#x6807;&#x8F74;&#x7684;&#x5939;&#x89D2;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x5B83;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x65CB;&#x8F6C;&#x524D;&#x540E;&#x5411;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><div style="text-align:center;"><img src="/2017/04/03/&#x7279;&#x5F81;&#x503C;&#x548C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x5185;&#x5E55;&#x8BE6;&#x89E3;/&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E4B;&#x65CB;&#x8F6C;.png" width="380" height="320">&#x56FE;2-9 &#x7EBF;&#x6027;&#x53D8;&#x6362;&#x4E4B;&#x65CB;&#x8F6C;&#x793A;&#x610F;&#x56FE;</div><br>&#x2003;&#x2003;&#x7531;&#x56FE;&#x53EF;&#x77E5;&#xFF0C;&#x65B0;&#x5411;&#x91CF;&#x76F8;&#x5BF9;&#x4E8E;&#x539F;&#x5411;&#x91CF;&#x987A;&#x65F6;&#x9488;&#x65CB;&#x8F6C;&#x4E86;$\alpha^&#xB0;&#xFF0C;\alpha \neq 0$&#xFF0C;&#x65CB;&#x8F6C;&#x540E;&#x7684;&#x65B0;&#x5411;&#x91CF;&#x4E0E;<strong>X</strong>&#x8F74;&#x7684;&#x5939;&#x89D2;&#x4E3A;$\beta^&#xB0;$&#xFF0C;&#x7531;&#x56FE;&#x53EF;&#x5F97;&#x5230;&#x4E0B;&#x5217;&#x65B9;&#x7A0B;&#x7EC4;&#xFF1A;<br>$$<br>\begin{split}<br>\begin{cases}<br>||\vec P_{old}|| \cdot cos(\alpha + \beta) = p \\\\<br>||\vec P_{old}|| \cdot sin(\alpha + \beta) = q \\\\<br>||\vec P_{new}|| \cdot cos(\beta) = m \\\\<br>||\vec P_{new}|| \cdot sin(\beta) = n \\\\<br>||\vec P_{old}|| = ||\vec P_{new}||<br>\end{cases}<br>\end{split}<br>\tag{2 - 12}<br>$$<br>&#x2003;&#x2003;&#x4E3A;&#x65B9;&#x4FBF;&#x8BA8;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#x8BB0;$||\vec P_{old}|| = ||\vec P_{new}|| = R$&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x5411;&#x91CF;&#x7684;&#x957F;&#x5EA6;&#x503C;&#xFF08;&#x4E8C;&#x8303;&#x6570;&#xFF09;&#xFF0C;&#x5219;&#x5C06;&#x4E0A;&#x8FF0;&#x65B9;&#x7A0B;&#x7EC4;&#x5C55;&#x5F00;&#x6709;&#xFF1A;<br>$$<br>\begin{cases}<br>R \cdot cos(\alpha)cos(\beta) - R \cdot sin(\alpha)sin(\beta) = p \\\\<br>R \cdot sin(\alpha)cos(\beta) + R \cdot cos(\alpha)sin(\beta) = q \\\\<br>R \cdot cos(\beta) = m \\\\<br>R \cdot sin(\beta) = n \\\\<br>\end{cases}<br>\tag{2 - 13}<br>$$<br>&#x2003;&#x2003;&#x5C06;&#x4E0A;&#x5F0F;(2 - 13)&#x7684;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x5F0F;&#x5B50;&#x5206;&#x522B;&#x4EE3;&#x5165;&#x7B2C;&#x4E00;&#x3001;&#x7B2C;&#x4E8C;&#x4E2A;&#x5F0F;&#x5B50;&#x6709;&#xFF1A;<br>$$<br>\begin{cases}<br>p = m \cdot cos(\alpha) - n \cdot sin(\alpha) \\\\<br>q = m \cdot sin(\alpha) + n \cdot cos(\alpha)\\\\<br>\end{cases}<br>\tag{2 - 14}<br>$$<br>&#x2003;&#x2003;&#x4E0A;&#x5F0F;(2 - 14)&#x5373;&#x4E3A;&#x65CB;&#x8F6C;&#x540E;&#x539F;&#x5411;&#x91CF;&#x5750;&#x6807;&#x503C;&#x5173;&#x4E8E;&#x65B0;&#x5411;&#x91CF;&#x7684;&#x5750;&#x6807;&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5199;&#x6210;&#x77E9;&#x9635;&#x7684;&#x5F62;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<br>$$<br>\begin{bmatrix}<br>p\ \\\\<br>q<br>\end{bmatrix} =<br>\begin{bmatrix}<br>cos(\alpha)\ \ \ \ \ -sin(\alpha) \\\\<br>sin(\alpha)\ \ \ \ \ \ cos(\alpha)<br>\end{bmatrix}<br>\begin{bmatrix}<br>m \\\\<br>n<br>\end{bmatrix}<br>\tag{2 - 15}<br>$$<br>&#x2003;&#x2003;&#x4E5F;&#x5373;&#x65CB;&#x8F6C;&#x540E;&#x65E7;&#x5411;&#x91CF;&#x548C;&#x65B0;&#x5411;&#x91CF;&#x7684;&#x5173;&#x7CFB;&#x4E3A;&#xFF1A;<br>$$<br>\begin{cases}<br>\vec P_{old} =<br>\begin{bmatrix}<br>cos(\alpha)\ \ \ \ \ -sin(\alpha) \\\\<br>sin(\alpha)\ \ \ \ \ \ cos(\alpha)<br>\end{bmatrix}<br>\vec P_{new}  = A \cdot \vec P_{new}\\\\<br>\vec P_{new} =<br>\begin{bmatrix}<br>cos(\alpha)\ \ \ \ \ \ sin(\alpha) \\\\<br>-sin(\alpha)\ \ \ \ \ cos(\alpha)<br>\end{bmatrix}<br>\vec P_{old}  = A^{-1} \cdot \vec P_{old}<br>\end{cases}<br>\tag{2 - 16}<br>$$<br>&#x2003;&#x2003;<font color="red">&#x7531;&#x4E0A;&#x5F0F;&#x53EF;&#x77E5;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x5DE6;&#x4E58;&#x4E00;&#x4E2A;<strong>&#x5173;&#x4E8E;&#x89D2;&#x5EA6;&#x7684;&#x4E09;&#x89D2;&#x51FD;&#x6570;&#x77E9;&#x9635;</strong>&#xFF0C;&#x5176;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x5C31;&#x662F;<strong>&#x65CB;&#x8F6C;</strong>&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x4E3A;<strong>&#x65CB;&#x8F6C;&#x77E9;&#x9635;</strong>&#x3002;</font>&#x5F53;&#x7136;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x5E76;&#x4E0D;&#x4F1A;&#x4EE5;&#x4E09;&#x89D2;&#x51FD;&#x6570;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x8FBE;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5B9E;&#x6570;&#x77E9;&#x9635;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x8981;&#x8BB0;&#x4F4F;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E0A;&#x7684;<strong>&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x7279;&#x5F81;</strong>&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;&#x5143;&#x7D20;&#x76F8;&#x540C;&#xFF0C;&#x5747;&#x4E3A;&#x65CB;&#x8F6C;&#x89D2;&#x5EA6;&#x7684;<strong>&#x4F59;&#x5F26;&#x503C;</strong>&#xFF1B;</li>
<li>&#x5904;&#x4E8E;&#x5BF9;&#x79F0;&#x4F4D;&#x7F6E;&#x7684;&#x975E;&#x5BF9;&#x89D2;&#x7EBF;&#x5143;&#x7D20;&#x4E92;&#x4E3A;&#x76F8;&#x53CD;&#x6570;&#xFF0C;&#x5176;&#x503C;&#x4E3A;&#x65CB;&#x8F6C;&#x89D2;&#x5EA6;&#x7684;<strong>&#x6B63;&#x5F26;&#x503C;</strong>&#xFF1B;</li>
<li>&#x975E;&#x5BF9;&#x89D2;&#x7EBF;&#x5143;&#x7D20;&#x7B26;&#x53F7;&#x7684;&#x6B63;&#x8D1F;&#x4E0E;&#x9009;&#x53D6;&#x7684;&#x65B9;&#x5411;&#x6709;&#x5173;&#xFF08;<a href="https://en.wikipedia.org/wiki/Right-hand_rule" target="_blank" rel="noopener">&#x5DE6;&#x53F3;&#x624B;&#x5750;&#x6807;&#x7CFB;</a>&#xFF09;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x8BB0;&#x4F4F;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x7279;&#x6027;&#x540E;&#xFF0C;&#x7ED9;&#x5B9A;&#x65CB;&#x8F6C;&#x89D2;&#x5EA6;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x968F;&#x624B;&#x5199;&#x51FA;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x5185;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#xFF0C;&#x8FD9;&#x6837;&#x6709;&#x5229;&#x4E8E;&#x6211;&#x4EEC;&#x9A6C;&#x4E0A;&#x8981;&#x8BB2;&#x7684;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x6C42;&#x89E3;&#x3002;</p>
<p><div align="center"><font color="blue">&#x4EE5;&#x4E0B;&#x90E8;&#x5206;&#x9700;&#x8981;&#x81EA;&#x884C;&#x8111;&#x8865;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x8F83;&#x591A;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F5C;&#x4E3A;&#x9009;&#x8BFB;&#x5185;&#x5BB9;&#x3002;</font></div></p>
<hr>
<p>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x7684;&#x65CB;&#x8F6C;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x6C42;&#x89E3;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x672C;&#x8D28;&#x533A;&#x522B;&#x3002;<br>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;$XYZ$&#x6765;&#x8BF4;&#xFF0C;&#x4EFB;&#x610F;&#x4E00;&#x6B21;&#x65CB;&#x8F6C;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x62C6;&#x5206;&#x4E3A;&#x5728;&#x5E73;&#x9762;$XOY&#xFF08;Yaw&#x89D2;&#xFF09;&#x3001;XOZ&#xFF08;Pitch&#x89D2;&#xFF09;&#x3001;YOZ&#xFF08;Roll&#x89D2;&#xFF09;$&#x7684;&#x65CB;&#x8F6C;&#x7684;&#x5408;&#x6210;&#xFF08;&#x672C;&#x6765;&#x590D;&#x5408;&#x53D8;&#x6362;&#x8FD9;&#x90E8;&#x5206;&#x662F;&#x5728;&#x672C;&#x8282;&#x6700;&#x540E;&#x8BB2;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x4E3A;&#x4E86;&#x6C42;&#x89E3;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x524D;&#x8BB2;&#x4E00;&#x4E9B;&#x3002;&#xFF09;&#xFF0C;&#x5E76;&#x8BB0;&#x8FD9;&#x4E09;&#x4E2A;&#x65CB;&#x8F6C;&#x7684;&#x89D2;&#x5EA6;&#x503C;&#x4E3A;$\alpha&#x3001;\beta&#x3001;\gamma$&#xFF0C;&#x6709;&#x4E86;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x8BB2;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x968F;&#x624B;&#x5C31;&#x80FD;&#x5199;&#x51FA;&#x8FD9;&#x4E09;&#x4E2A;&#x5E73;&#x9762;&#x5185;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#xFF08;&#x5747;&#x4E3A;&#x987A;&#x65F6;&#x9488;&#x65CB;&#x8F6C;&#xFF09;&#x6765;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br>$$<br>\begin{cases}<br>R_{XOY} =<br>\begin{bmatrix}<br>cos(\alpha) &amp; -sin(\alpha) &amp;\boxed{\color{blue}0}\\\\<br>sin(\alpha) &amp; cos(\alpha) &amp;\boxed{\color{blue}0} \\\\<br>\boxed{\color{blue}0} &amp;\boxed{\color{blue}0} &amp;\boxed{\color{red}1}<br>\end{bmatrix}<br>\stackrel{define}{\longrightarrow} Yaw&#x89D2;&#xFF08;&#x7ED5;Z&#x8F74;&#xFF09;<br>\\\\<br>\\\\<br>R_{XOZ} =<br>\begin{bmatrix}<br>cos(\beta) &amp;\boxed{\color{blue}0} &amp;sin(\beta) \\\\<br>\boxed{\color{blue}0} &amp;\boxed{\color{red}1} &amp;\boxed{\color{blue}0} \\\\<br>-sin(\beta) &amp;\boxed{\color{blue}0} &amp;cos(\beta)<br>\end{bmatrix}<br>\stackrel{define}{\longrightarrow} Pitch&#x89D2;&#xFF08;&#x7ED5;Y&#x8F74;&#xFF09;<br>\\\\<br>\\\\<br>R_{YOZ} =<br>\begin{bmatrix}<br>\boxed{\color{red}1} &amp; \boxed{\color{blue}0} &amp; \boxed{\color{blue}0} \\\\<br>\boxed{\color{blue}0} &amp; cos(\gamma) &amp; -sin(\gamma) \\\\<br>\boxed{\color{blue}0} &amp; sin(\gamma) &amp; cos(\gamma)<br>\end{bmatrix}<br>\stackrel{define}{\longrightarrow} Roll&#x89D2;&#xFF08;&#x7ED5;X&#x8F74;&#xFF09;<br>\end{cases}<br>\tag{2 - 17}<br>$$<br>&#x2003;&#x2003;&#x6CE8;&#x610F;&#xFF1A;<a href="https://en.wikipedia.org/wiki/Rotation_matrix#Ambiguities" target="_blank" rel="noopener">wiki</a>&#x8BCD;&#x6761;&#x7684;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x53F3;&#x624B;&#x5750;&#x6807;&#x7CFB;&#x4EE5;&#x7ED5;Z&#x3001;X&#x8F74;&#x7684;&#x65CB;&#x8F6C;&#x5747;&#x4EE5;&#x9006;&#x65F6;&#x9488;&#x4E3A;&#x6B63;&#xFF0C;&#x4E3A;&#x4FDD;&#x6301;&#x4E0E;wiki&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E2D;&#x7684;&#x987A;&#x65F6;&#x9488;&#x65CB;&#x8F6C;&#x4E3A;&#x6B63;&#xFF08;&#x5DE6;&#x624B;&#x5750;&#x6807;&#x7CFB;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#x5F0F;&#xFF08;2-17&#xFF09;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x3001;&#x4E09;&#x4E2A;&#x77E9;&#x9635;&#x4E2D;&#x7684;&#x6B63;&#x5F26;&#x503C;&#x7B26;&#x53F7;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;<br>&#x2003;&#x2003;&#x53EA;&#x8981;&#x8BB0;&#x4F4F;&#x4E86;&#x524D;&#x9762;&#x8BB2;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x77E9;&#x9635;&#x5F88;&#x8F7B;&#x677E;&#x7684;&#x5C31;&#x80FD;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x4E24;&#x4E2A;&#x5730;&#x65B9;&#x5BB9;&#x6613;&#x5F04;&#x9519;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x77E9;&#x9635;&#x4E2D;&#x5E26;&#x6846;&#x7684;&#x7EFF;&#x8272;&#x6570;&#x5B57;&#x90E8;&#x5206;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x77E9;&#x9635;&#x4E2D;&#x5E26;&#x6846;&#x7684;&#x84DD;&#x8272;&#x6570;&#x5B57;&#x90E8;&#x5206;&#x3002;&#x4EE5;$R_{XOY}$&#x6765;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x5728;&#x5E73;&#x9762;<strong>XOY</strong>&#x5185;&#x8FDB;&#x884C;&#x7684;&#x65CB;&#x8F6C;&#xFF0C;&#x6240;&#x4EE5;&#x65CB;&#x8F6C;&#x524D;&#x540E;&#x5176;<strong>Z</strong>&#x5750;&#x6807;&#x503C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x56E0;&#x6B64;&#x77E9;&#x9635;&#x4E2D;<strong>&#x5BF9;&#x89D2;&#x7EBF;&#x4E0A;</strong>&#x8BE5;&#x5750;&#x6807;&#x8F74;&#x4F4D;&#x7F6E;&#x5904;&#x7684;&#x7CFB;&#x6570;&#x5E94;&#x8BE5;&#x4E3A;<strong>1&#xFF08;&#x800C;&#x4E0D;&#x662F;0&#xFF09;</strong>&#xFF0C;&#x800C;<strong>&#x975E;&#x5BF9;&#x89D2;&#x7EBF;</strong>&#x51E1;&#x662F;&#x4E0E;&#x4E0D;&#x53D8;&#x7684;&#x5750;&#x6807;&#x8F74;&#x6709;&#x5173;&#x7684;&#x4F4D;&#x7F6E;&#x5904;&#x7684;&#x7CFB;&#x6570;&#x5E94;&#x8BE5;&#x4E3A;<strong>0&#xFF08;&#x800C;&#x4E0D;&#x662F;1&#xFF09;</strong>&#xFF0C;&#x81F3;&#x4E8E;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;<a href="#transform_scale">2.3.2</a>&#x5C0F;&#x8282;&#x4E2D;&#x8BB2;&#x4E86;&#x3002;<br>&#x2003;&#x2003;&#x6709;&#x4E86;&#x8FD9;&#x4E09;&#x4E2A;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x590D;&#x5408;&#xFF08;&#x5408;&#x6210;&#xFF09;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E09;&#x4E2A;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x590D;&#x5408;&#x987A;&#x5E8F;&#x662F;&#x6709;&#x8BB2;&#x7A76;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E09;&#x4E2A;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x90FD;&#x4E0D;&#x662F;&#x5BF9;&#x79F0;&#x9635;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x540E;&#x7684;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x4E0E;&#x77E9;&#x9635;&#x76F8;&#x4E58;&#x7684;&#x987A;&#x5E8F;&#x4E25;&#x683C;&#x76F8;&#x5173;&#x3002;&#x5BF9;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#x7684;&#x89E3;&#x91CA;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x628A;&#x6BCF;&#x4E00;&#x6B21;&#x65CB;&#x8F6C;&#x5F53;&#x505A;&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x57FA;&#x53D8;&#x6362;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x524D;&#x4E00;&#x6B21;&#x64CD;&#x4F5C;&#x540E;&#x7684;&#x65B0;&#x57FA;&#x7684;&#xFF0C;&#x800C;&#x6BCF;&#x4E00;&#x6B21;&#x65CB;&#x8F6C;&#x540E;&#xFF0C;&#x57FA;&#x5411;&#x91CF;&#x7684;&#x5750;&#x6807;&#x503C;&#x3001;&#x65B9;&#x5411;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x4E86;&#x6539;&#x53D8;&#xFF08;&#x800C;&#x4E0D;&#x518D;&#x662F;&#x539F;&#x672C;&#x7684;$[\vec i, \vec j]^T$&#xFF09;&#x3002;<br>&#x2003;&#x2003;<strong>&#x6309;&#x7167;Z-Y-X&#xFF08;<font color="red">&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x91C7;&#x7528;Z-Y-X&#x65CB;&#x8F6C;&#x987A;&#x5E8F;&#x7684;<a href="https://en.wikipedia.org/wiki/Euler_angles" target="_blank" rel="noopener">Tait-Bryan&#x89D2;</a></font>&#xFF09;</strong>&#x7684;&#x65CB;&#x8F6C;&#x987A;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x4F5C;&#x7528;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x53CA;&#x4F5C;&#x7528;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;<br>$$<br>\begin{split}<br>\vec P_{new} &amp;= \underbrace{ R_{XOY}<br>\underbrace{ (R_{XOZ}<br>\underbrace{ (R_{YOZ} \vec P_{old}) } _{&#x7ED5;X&#x8F74;&#x65CB;&#x8F6C;}<br>} _{&#x7ED5;Y&#x8F74;&#x65CB;&#x8F6C;}) } _{&#x7ED5;Z&#x8F74;&#x65CB;&#x8F6C;} \\\\<br>&amp;= (R_{XOY} R_{XOZ} R_{YOZ})  \vec P_{old} \\\\<br>&amp;=<br>\begin{bmatrix}<br>cos(\alpha) cos(\beta) &amp; - sin(\alpha) cos(\gamma) +  cos(\alpha) sin(\beta) sin(\gamma) &amp;  sin(\alpha) sin(\gamma) + cos(\alpha) sin(\beta) cos(\gamma) \\\\<br>sin(\alpha) cos(\beta) &amp; cos(\alpha) cos(\beta)  +  sin(\alpha)sin(\beta) sin(\gamma) &amp;  -cos(\alpha)sin(\gamma) + sin(\alpha) sin(\beta) cos(\gamma) \\\\<br>-sin(\beta) &amp; cos(\beta)sin(\gamma) &amp;  cos(\beta) cos(\gamma) \\\\<br>\end{bmatrix}<br>\vec P_{old}<br>\end{split}<br>\tag{2 - 18}<br>$$</p>
<p>&#x2003;&#x2003;<font color="red"><strong>&#x6CE8;&#x610F;&#xFF1A;&#x4E0D;&#x540C;&#x7684;&#x65CB;&#x8F6C;&#x987A;&#x5E8F;&#x6240;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x6700;&#x7EC8;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x4F1A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x91CC;&#x4EC5;&#x505A;&#x6F14;&#x793A;&#x7528;&#xFF0C;&#x5E76;&#x975E;&#x552F;&#x4E00;&#x7ED3;&#x679C;&#x3002;</strong></font><br>&#x2003;&#x2003;&#x81F3;&#x4E8E;&#x56DB;&#x7EF4;&#x53CA;&#x4EE5;&#x4E0A;&#x7A7A;&#x95F4;&#xFF0C;&#x53BB;&#x8BA8;&#x8BBA;&#x5176;&#x51E0;&#x4F55;&#x610F;&#x4E49;&#x5DF2;&#x7ECF;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x5177;&#x5907;&#x5B9E;&#x9645;&#x4EF7;&#x503C;&#x7684;&#x4E86;&#xFF08;&#x53CD;&#x6B63;&#x6211;&#x662F;&#x60F3;&#x8C61;&#x4E0D;&#x51FA;&#x56DB;&#x7EF4;&#x7A7A;&#x95F4;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#xFF09;&#x3002;&#x5176;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x8D44;&#x6599;&#x53C2;&#x89C1;<a href="https://zh.wikipedia.org/wiki/%E5%90%89%E6%96%87%E6%96%AF%E6%97%8B%E8%BD%AC" target="_blank" rel="noopener">Givens rotation</a>&#x3002;&#x672C;&#x90E8;&#x5206;&#x9009;&#x8BFB;&#x5185;&#x5BB9;&#x7531;&#x4E8E;&#x6D89;&#x53CA;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x592A;&#x591A;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x6DF1;&#x5165;&#x53BB;&#x63A2;&#x8BA8;&#x4E86;&#xFF0C;&#x5199;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x76EE;&#x7684;&#x4E5F;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x7406;&#x89E3;&#x6211;&#x4EEC;&#x540E;&#x9762;&#x8981;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BF7;&#x81EA;&#x884C;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x3002;<br>&#x2003;&#x2003;&#x9644;&#x4E0A;&#x672C;&#x5C0F;&#x8282;&#x6240;&#x53C2;&#x8003;&#x7684;&#x4E00;&#x4E9B;&#x7F51;&#x7EDC;&#x8D44;&#x6599;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li><ol>
<li><a href="http://insaneguy.me/2015/03/25/rotation_matrix_and_quaternions/" target="_blank" rel="noopener">&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x4E0E;&#x56DB;&#x5143;&#x6570;</a>;</li>
</ol>
</li>
<li><ol>
<li><a href="http://planning.cs.uiuc.edu/node102.html" target="_blank" rel="noopener">Yaw, pitch, and roll rotations</a>;</li>
</ol>
</li>
<li><ol>
<li><a href="https://en.wikipedia.org/wiki/Three-dimensional_rotation_operator" target="_blank" rel="noopener">Three-dimensional rotation operator</a>;</li>
</ol>
</li>
<li><ol>
<li><a href="https://en.wikipedia.org/wiki/Rotation_matrix" target="_blank" rel="noopener">Rotation matrix</a>;</li>
</ol>
</li>
<li><ol>
<li><a href="https://www.jianshu.com/p/6c2c0542071d" target="_blank" rel="noopener">3D&#x56FE;&#x5F62;:&#x77E9;&#x9635;&#x4E0E;&#x7EBF;&#x6027;&#x53D8;&#x6362;</a>;</li>
</ol>
</li>
</ul>
<hr>
<p>&#x2003;&#x2003;&#x4F5C;&#x4E3A;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x7684;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x4E4B;&#x4E00;&#xFF0C;&#x638C;&#x63E1;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x7279;&#x6027;&#x5C06;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x53BB;&#x7406;&#x89E3;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h3 id="3-&#x540E;&#x8BB0;"><a href="#3-&#x540E;&#x8BB0;" class="headerlink" title="3. &#x540E;&#x8BB0;"></a>3. &#x540E;&#x8BB0;</h3><h4 id="3-1-&#x7ED3;&#x8BED;"><a href="#3-1-&#x7ED3;&#x8BED;" class="headerlink" title="3.1 &#x7ED3;&#x8BED;"></a>3.1 &#x7ED3;&#x8BED;</h4><p>&#x2003;&#x2003;&#x672C;&#x7CFB;&#x5217;&#x624D;&#x5F00;&#x4E86;&#x4E2A;&#x5934;&#x5C31;&#x5199;&#x7ED3;&#x8BED;&#x4F3C;&#x4E4E;&#x6709;&#x70B9;&#x602A;&#x602A;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#x8FD9;&#x6837;&#x3002;&#x770B;&#x5230;&#x5404;&#x4F4D;&#x7684;&#x7559;&#x8A00;&#xFF0C;&#x5B9E;&#x5728;&#x60ED;&#x6127;&#x3002;&#x56E0;&#x4E3A;&#x5E73;&#x65F6;&#x5DE5;&#x4F5C;&#x8F83;&#x5FD9;&#xFF0C;&#x535A;&#x5BA2;&#x8FD9;&#x8FB9;&#x5C31;&#x6709;&#x70B9;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#xFF0C;&#x4E0D;&#x8FC7;&#x8BF7;&#x5404;&#x4F4D;&#x653E;&#x5FC3;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x628A;&#x672C;&#x7CFB;&#x5217;&#x5199;&#x597D;&#x3001;&#x5199;&#x5B8C;&#x3002;&#x4F60;&#x4EEC;&#x7684;&#x6279;&#x8BC4;&#x548C;&#x652F;&#x6301;&#x5C06;&#x662F;&#x6211;&#x6700;&#x8BDA;&#x631A;&#x7684;&#x52A8;&#x529B;&#xFF01;</p>
<h4 id="3-1-&#x4FEE;&#x6539;&#x8BB0;&#x5F55;"><a href="#3-1-&#x4FEE;&#x6539;&#x8BB0;&#x5F55;" class="headerlink" title="3.1 &#x4FEE;&#x6539;&#x8BB0;&#x5F55;"></a>3.1 &#x4FEE;&#x6539;&#x8BB0;&#x5F55;</h4><p>&#x2003;&#x2003;1. <font color="red"><strong>2018-03-04</strong> </font>&#x4FEE;&#x6539;2.2.2&#x8282;&#x7684;&#x6807;&#x9898;<strong>&#x201C;&#x57FA;&#x53D8;&#x6362;&#x201D;</strong>&#x4E3A;<strong>&#x201C;&#x5411;&#x91CF;&#x7684;&#x57FA;&#x53D8;&#x6362;&#x201D;</strong>&#xFF0C;&#x539F;&#x6807;&#x9898;&#x53EF;&#x80FD;&#x4F1A;&#x8BEF;&#x5BFC;&#x8BFB;&#x8005;&#xFF0C;<strong>&#x7EBF;&#x6027;&#x4EE3;&#x6570;</strong>&#x4E2D;&#x7684;<strong><code>&#x57FA;&#x53D8;&#x6362;</code></strong>&#x66F4;&#x4FA7;&#x91CD;&#x4E8E;&#x4E24;&#x7EC4;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x4E4B;&#x95F4;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x6D89;&#x53CA;&#x5230;<strong><code>&#x8FC7;&#x6E21;&#x77E9;&#x9635;</code></strong>&#xFF0C;&#x800C;&#x6211;&#x5728;&#x8FD9;&#x8282;&#x4E2D;&#x8BB2;&#x7684;&#x5219;&#x66F4;&#x4FA7;&#x91CD;&#x4E8E;&#x7ED9;&#x5B9A;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x4EFB;&#x610F;&#x5411;&#x91CF;&#x5728;&#x65B0;&#x3001;&#x65E7;&#x57FA;&#x4E4B;&#x95F4;&#x8F6C;&#x6362;&#x65F6;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x3002;<br>&#x2003;&#x2003;2. <font color="red"><strong>2018-03-04</strong></font> &#x4FEE;&#x6539;2.2.3&#x8282;&#x7684;&#x6807;&#x9898;<strong>&#x201C;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x77E9;&#x9635;&#x5F0F;&#x201D;</strong>&#x4E3A;<strong>&#x201C;&#x5411;&#x91CF;&#x57FA;&#x53D8;&#x6362;&#x7684;&#x77E9;&#x9635;&#x5F0F;&#x201D;</strong>&#xFF0C;&#x539F;&#x56E0;&#x540C;&#x4E0A;&#x3002;</p>
</div><!-- 正文结束标志         --><!--标记内容的显示格式，定义在style.style中--><div class="end-of-content"><!--要显示的内容--><div class="end-of-content"><div><i>————    本文结束    ————</i><p></p></div></div></div><!-- 文末文章标签--><div class="tags"><a href="/tags/特征值/">特征值</a><a href="/tags/特征向量/">特征向量</a></div><!-- 分享文章--><div class="post-share"><div class="bdsharebuttonbox"><span style="float:left;line-height: 28px;height: 28px;font-size:16px;font-weight:blod">分享到：</span><a href="#" data-cmd="more" class="bds_more"></a><a href="#" data-cmd="mshare" title="分享到一键分享" class="bds_mshare"></a><a href="#" data-cmd="fbook" title="分享到Facebook" class="bds_fbook"></a><a href="#" data-cmd="twi" title="分享到Twitter" class="bds_twi"></a><a href="#" data-cmd="linkedin" title="分享到linkedin" class="bds_linkedin"></a><a href="#" data-cmd="youdao" title="分享到有道云笔记" class="bds_youdao"></a><a href="#" data-cmd="evernotecn" title="分享到印象笔记" class="bds_evernotecn"></a><a href="#" data-cmd="weixin" title="分享到微信" class="bds_weixin"></a><a href="#" data-cmd="qzone" title="分享到QQ空间" class="bds_qzone"></a><a href="#" data-cmd="tsina" title="分享到新浪微博" class="bds_tsina"></a></div></div><!-- 站内导航--><div class="post-nav"><a href="/2017/04/30/机器学习算法系列之三：SVM3/" class="pre">机器学习算法系列之三：SVM（3）</a><a href="/2017/02/17/机器学习算法系列之三：SVM2/" class="next">机器学习算法系列之三：SVM（2）</a></div><!--新增打赏功能在正文底部--><div class="page-reward"><a id="a_label" class="page-reward-btn tooltip-top"><div id="reward_guide" class="tooltip tooltip-east"><span id="btn_guide" href="javascript:;" class="tooltip-item">打赏</span></div><script type="text/javascript">document.getElementById("btn_guide").onclick = function(){
    document.getElementById("reward_guide").setAttribute("style", "display:none");
    document.getElementById("a_label").setAttribute("style", "display:none");
    document.getElementById("img_guide").setAttribute("style", "display:block");
}</script></a><div id="img_guide" style="display:none" class="tooltip reward-box"><table><tr><td><img src="https://flat2010.github.io/about/weixin_qrcode.jpg" style="text-align:center;float:center" class="reward-img"></td><td></td></tr></table></div><script type="text/javascript">document.getElementById("img_guide").onclick = function(){
    document.getElementById("reward_guide").setAttribute("style", "display:inline-block");
    document.getElementById("a_label").setAttribute("style", "display:inline-block");
    document.getElementById("img_guide").setAttribute("style", "display:none");
}</script></div><!--end--><div id="comments"><div id="disqus_thread"></div></div></div></div></div><div class="layout-r"><div id="sidebar"><div class="search-pla"></div><div id="toc" class="widget"><div class="widget-title"><i class="fa fa-fei">文章目录</i></div><ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#1-概述"><span class="toc-text">1. 概述</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#2-基础概念"><span class="toc-text">2. 基础概念</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#2-1-向量"><span class="toc-text">2.1 向量</span></a><ol class="toc-child"><li class="toc-item toc-level-5"><a class="toc-link" href="#2-1-1-物理学的向量"><span class="toc-text">2.1.1 物理学的向量</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-1-2-计算机中的向量"><span class="toc-text">2.1.2 计算机中的向量</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-1-3-数学的向量"><span class="toc-text">2.1.3 数学的向量</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-1-4-向量的表达形式"><span class="toc-text">2.1.4 向量的表达形式</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-1-5-注意"><span class="toc-text">2.1.5 注意</span></a></li></ol></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-2-基"><span class="toc-text">2.2 基</span></a><ol class="toc-child"><li class="toc-item toc-level-5"><a class="toc-link" href="#2-2-1-概念"><span class="toc-text">2.2.1 概念</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-2-2-向量的基变换"><span class="toc-text">2.2.2 向量的基变换</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-2-3-向量基变换的矩阵式"><span class="toc-text">2.2.3 向量基变换的矩阵式</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-2-4-基变换"><span class="toc-text">2.2.4 基变换</span></a></li></ol></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-3-线性变换"><span class="toc-text">2.3 线性变换</span></a><ol class="toc-child"><li class="toc-item toc-level-5"><a class="toc-link" href="#2-3-1-线性变换类型"><span class="toc-text">2.3.1 线性变换类型</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-3-2-缩放"><span class="toc-text">2.3.2 缩放</span></a></li><li class="toc-item toc-level-5"><a class="toc-link" href="#2-3-3-旋转"><span class="toc-text">2.3.3 旋转</span></a></li></ol></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#3-后记"><span class="toc-text">3. 后记</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#3-1-结语"><span class="toc-text">3.1 结语</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#3-1-修改记录"><span class="toc-text">3.1 修改记录</span></a></li></ol></li></ol></div><div class="widget"><div class="widget-title"><i class="fa fa-xie"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2018/10/26/共轭梯度法通俗讲义/">共轭梯度法通俗讲义</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/26/共轭的那些事儿/">共轭的那些事儿</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/10/24/hello-world/">Hello World</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/06/30/病态问题及条件数/">病态问题及条件数</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/06/15/手算CNN中的参数/">CNN中的参数解释及计算</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/04/23/字符串匹配算法系列之一：BF-KMP/">字符串匹配算法系列之一：BF && KMP</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/04/21/机器学习算法系列之三：SVM6/">机器学习算法系列之三：SVM6</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/04/19/模运算中为何要用素数作为模/"> 模运算中为何要用素数作为模</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/03/31/机器学习算法系列之三：SVM5/">机器学习算法系列之三：SVM（5）</a></li><li class="post-list-item"><a class="post-list-link" href="/2018/02/16/深度学习：目标检测之一（基础篇）/">深度学习：目标检测之一（基础篇）</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-gui"> 分类</i><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul><ul></ul></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Docker/">Docker</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/个人博客/">个人博客</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/字符串匹配/">字符串匹配</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/安装配置教程/">安装配置教程</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/数学理论/">数学理论</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/日常技巧总结/">日常技巧总结</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/机器学习/">机器学习</a><span class="category-list-count">9</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/机器学习/支持向量机/">支持向量机</a><span class="category-list-count">1</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/深度学习/">深度学习</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/编程笔记/">编程笔记</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/读书笔记/">读书笔记</a><span class="category-list-count">5</span></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-biao"> 标签</i></div><div class="tagcloud"><a href="/tags/个人博客/" style="font-size: 12px; color: #00f">个人博客</a> <a href="/tags/机器学习/" style="font-size: 22.4px; color: #c0f">机器学习</a> <a href="/tags/Docker/" style="font-size: 12px; color: #00f">Docker</a> <a href="/tags/Hadoop/" style="font-size: 12px; color: #00f">Hadoop</a> <a href="/tags/Spark/" style="font-size: 12px; color: #00f">Spark</a> <a href="/tags/分布式/" style="font-size: 12px; color: #00f">分布式</a> <a href="/tags/Numpy/" style="font-size: 12px; color: #00f">Numpy</a> <a href="/tags/Python/" style="font-size: 17.2px; color: #60f">Python</a> <a href="/tags/算法/" style="font-size: 25px; color: #f0f">算法</a> <a href="/tags/Netfilter/" style="font-size: 12px; color: #00f">Netfilter</a> <a href="/tags/Iptables/" style="font-size: 12px; color: #00f">Iptables</a> <a href="/tags/Linux/" style="font-size: 14.6px; color: #30f">Linux</a> <a href="/tags/3D图形/" style="font-size: 12px; color: #00f">3D图形</a> <a href="/tags/Oracle/" style="font-size: 12px; color: #00f">Oracle</a> <a href="/tags/Ubuntu/" style="font-size: 14.6px; color: #30f">Ubuntu</a> <a href="/tags/数据库/" style="font-size: 12px; color: #00f">数据库</a> <a href="/tags/Pcapy/" style="font-size: 12px; color: #00f">Pcapy</a> <a href="/tags/Wireshark/" style="font-size: 12px; color: #00f">Wireshark</a> <a href="/tags/HTTP/" style="font-size: 12px; color: #00f">HTTP</a> <a href="/tags/共轭/" style="font-size: 14.6px; color: #30f">共轭</a> <a href="/tags/Hexo/" style="font-size: 12px; color: #00f">Hexo</a> <a href="/tags/深度学习/" style="font-size: 12px; color: #00f">深度学习</a> <a href="/tags/字符串匹配/" style="font-size: 12px; color: #00f">字符串匹配</a> <a href="/tags/统计学习/" style="font-size: 12px; color: #00f">统计学习</a> <a href="/tags/李航/" style="font-size: 12px; color: #00f">李航</a> <a href="/tags/拉格朗日/" style="font-size: 12px; color: #00f">拉格朗日</a> <a href="/tags/对偶问题/" style="font-size: 12px; color: #00f">对偶问题</a> <a href="/tags/SVM/" style="font-size: 19.8px; color: #90f">SVM</a> <a href="/tags/支持向量机/" style="font-size: 19.8px; color: #90f">支持向量机</a> <a href="/tags/数据挖掘/" style="font-size: 12px; color: #00f">数据挖掘</a> <a href="/tags/DataMine/" style="font-size: 12px; color: #00f">DataMine</a> <a href="/tags/JiaWei-Han/" style="font-size: 12px; color: #00f">JiaWei Han</a> <a href="/tags/卷积/" style="font-size: 12px; color: #00f">卷积</a> <a href="/tags/池化/" style="font-size: 12px; color: #00f">池化</a> <a href="/tags/数学概念/" style="font-size: 12px; color: #00f">数学概念</a> <a href="/tags/数学定义/" style="font-size: 12px; color: #00f">数学定义</a> <a href="/tags/病态/" style="font-size: 12px; color: #00f">病态</a> <a href="/tags/条件数/" style="font-size: 12px; color: #00f">条件数</a> <a href="/tags/Hash/" style="font-size: 12px; color: #00f">Hash</a> <a href="/tags/模运算/" style="font-size: 12px; color: #00f">模运算</a> <a href="/tags/特征值/" style="font-size: 12px; color: #00f">特征值</a> <a href="/tags/特征向量/" style="font-size: 12px; color: #00f">特征向量</a> <a href="/tags/回调函数/" style="font-size: 12px; color: #00f">回调函数</a> <a href="/tags/目标检测/" style="font-size: 12px; color: #00f">目标检测</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-archive"> 时间线</i></div><ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/10/">2018年10月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/06/">2018年06月</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/04/">2018年04月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/03/">2018年03月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/02/">2018年02月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/12/">2017年12月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/08/">2017年08月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/07/">2017年07月</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/05/">2017年05月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/04/">2017年04月</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017年02月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017年01月</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016年12月</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016年11月</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016年08月</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2014/06/">2014年06月</a><span class="archive-list-count">1</span></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-github"> Github</i></div><ul></ul><a href="https://github.com/flat2010" title="flat2010" target="_blank">flat2010</a><iframe width="100%" height="100" frameborder="0" scrolling="no" src="" class="share_self"></iframe></div></div></div></div><a id="totop" href="#top"></a><div id="footer"><div class="footer-info"><p><a href="/baidusitemap.xml">baidusitemap</a> |  <a href="/atom.xml">订阅</a> |  <a href="/about/">关于</a></p><!-- 首页底部显示网站总字数--><p>本站博客总字数：<i>161.9k 字</i></p><p>本站访客总数：<i id="busuanzi_container_site_uv"><i id="busuanzi_value_site_uv"></i></i>次</p><p>文章总阅读次数：<i id="busuanzi_container_site_pv"><i id="busuanzi_value_site_pv"></i></i>次</p><p><span> Copyright &copy;<a href="/." rel="nofollow">Jineney.</a></span><span> Theme by<a rel="nofollow" target="_blank" href="https://github.com/flat2010/Molin"> Molin.</a></span><span> Count by<a href="https://busuanzi.ibruce.info/"> busuanzi.</a></span><span> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a></span></p></div></div></div><script src="https://busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js" async></script><script type="text/javascript" src="/js/search.json.js?v=2.0.1"></script><!-- tocfold.js中需要用到jquery--><script type="text/javascript" src="http://code.jquery.com/jquery-1.7.1.min.js" async></script><!-- 控制文章目录折叠特性的脚本--><script type="text/javascript" src="/js/tocfold.js?v=2.0.1" async> </script><!-- 返回文章顶部的脚本 --><script type="text/javascript" src="/js/toctotop.js?v=2.0.1" async></script><script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"2","bdMiniList":["mshare","weixin","tsina","qzone","linkedin","fbook","twi","print","renren","sqq","evernotecn","bdysc","tqq","tqf","bdxc","kaixin001","tieba","douban","bdhome","thx","ibaidu","meilishuo","mogujie","diandian","huaban","duitang","hx","fx","youdao","sdo","qingbiji","people","xinhua","mail","isohu","yaolan","wealink","ty","iguba","h163","copy"],"bdPic":"","bdStyle":"1","bdSize":"16"},"share":{},"image":{"viewList":["tsina","qzone","weixin","fbook","twi","linkedin","youdao","evernotecn","mshare"],"viewText":"分享到：","viewSize":"16"},"selectShare":{"bdContainerClass":null,"bdSelectMiniList":["tsina","qzone","weixin","fbook","twi","linkedin","youdao","evernotecn","mshare"]}};with(document)0[(getElementsByTagName('head')[0]||head).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];
</script><script>var disqus_shortname = 'flat2010';
var disqus_identifier = '2017/04/03/特征值和特征向量内幕详解/';
var disqus_title = '特征值和特征向量内幕详解';
var disqus_url = 'https://flat2010.github.io/2017/04/03/特征值和特征向量内幕详解/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//flat2010.disqus.com/count.js" async></script><!-- 开启下面这条，所有评论会出现在底部，非常难看--><!--script(type='text/javascript', src='//#{theme.comment.disqus}.disqus.com/recent_comments_widget.js?num_items=5&hide_avatars=1&avatar_size=32&excerpt_length=20&hide_mods=1')--></body></html><!--为主题添加mathjax支持--><script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-MML-AM_CHTML" async></script><script type="text/x-mathjax-config">MathJax.Hub.Config({"HTML-CSS": { preferredFont: "TeX", availableFonts: ["STIX","TeX"], linebreaks: { automatic:true }, EqnChunk: (MathJax.Hub.Browser.isMobile ? 10 : 50) },
tex2jax: { inlineMath: [ ["$", "$"], ["\\\(","\\)"] ], processEscapes: true, ignoreClass: "tex2jax_ignore|dno",skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']},
TeX: { noUndefined: { attributes: { mathcolor: "red", mathbackground: "#FFEEEE", mathsize: "90%" } }, Macros: { href: "{}" } },
messageStyle: "none"
});</script>